/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: PlotManagerDLC_UNC_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1798
// [0x00020002] 
struct UBioAutoConditionals_execF1798_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1798_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1798_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1826
// [0x00020002] 
struct UBioAutoConditionals_execF1826_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1826_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1826_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1824
// [0x00020002] 
struct UBioAutoConditionals_execF1824_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1824_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1824_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1823
// [0x00020002] 
struct UBioAutoConditionals_execF1823_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1823_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1823_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1822
// [0x00020002] 
struct UBioAutoConditionals_execF1822_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1822_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1822_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1816
// [0x00020002] 
struct UBioAutoConditionals_execF1816_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1816_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1816_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1815
// [0x00020002] 
struct UBioAutoConditionals_execF1815_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1815_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1815_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1814
// [0x00020002] 
struct UBioAutoConditionals_execF1814_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1814_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1814_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1813
// [0x00020002] 
struct UBioAutoConditionals_execF1813_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1813_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1813_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1808
// [0x00020002] 
struct UBioAutoConditionals_execF1808_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1808_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1808_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1807
// [0x00020002] 
struct UBioAutoConditionals_execF1807_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1807_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1807_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1806
// [0x00020002] 
struct UBioAutoConditionals_execF1806_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1806_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1806_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1805
// [0x00020002] 
struct UBioAutoConditionals_execF1805_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1805_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1805_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1804
// [0x00020002] 
struct UBioAutoConditionals_execF1804_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1804_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1804_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1803
// [0x00020002] 
struct UBioAutoConditionals_execF1803_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1803_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1803_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1802
// [0x00020002] 
struct UBioAutoConditionals_execF1802_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1802_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1802_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1801
// [0x00020002] 
struct UBioAutoConditionals_execF1801_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1801_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1801_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1799
// [0x00020002] 
struct UBioAutoConditionals_execF1799_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1799_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1799_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F2017
// [0x00020002] 
struct UBioAutoConditionals_execF2017_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2017_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2017_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F2016
// [0x00020002] 
struct UBioAutoConditionals_execF2016_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2016_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2016_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F2015
// [0x00020002] 
struct UBioAutoConditionals_execF2015_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2015_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2015_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1828
// [0x00020002] 
struct UBioAutoConditionals_execF1828_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1828_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1828_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1827
// [0x00020002] 
struct UBioAutoConditionals_execF1827_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1827_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1827_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1789
// [0x00020002] 
struct UBioAutoConditionals_execF1789_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1789_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1789_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1790
// [0x00020002] 
struct UBioAutoConditionals_execF1790_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1790_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1790_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1791
// [0x00020002] 
struct UBioAutoConditionals_execF1791_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1791_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1791_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1797
// [0x00020002] 
struct UBioAutoConditionals_execF1797_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1797_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1797_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1796
// [0x00020002] 
struct UBioAutoConditionals_execF1796_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1796_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1796_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1795
// [0x00020002] 
struct UBioAutoConditionals_execF1795_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1795_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1795_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1794
// [0x00020002] 
struct UBioAutoConditionals_execF1794_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1794_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1794_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1793
// [0x00020002] 
struct UBioAutoConditionals_execF1793_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1793_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1793_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1792
// [0x00020002] 
struct UBioAutoConditionals_execF1792_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1792_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1792_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1809
// [0x00020002] 
struct UBioAutoConditionals_execF1809_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1809_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1809_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1800
// [0x00020002] 
struct UBioAutoConditionals_execF1800_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1800_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1800_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1812
// [0x00020002] 
struct UBioAutoConditionals_execF1812_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1812_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1812_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1811
// [0x00020002] 
struct UBioAutoConditionals_execF1811_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1811_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1811_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1810
// [0x00020002] 
struct UBioAutoConditionals_execF1810_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1810_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1810_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1821
// [0x00020002] 
struct UBioAutoConditionals_execF1821_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1821_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1821_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1820
// [0x00020002] 
struct UBioAutoConditionals_execF1820_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1820_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1820_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1819
// [0x00020002] 
struct UBioAutoConditionals_execF1819_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1819_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1819_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1818
// [0x00020002] 
struct UBioAutoConditionals_execF1818_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1818_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1818_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1817
// [0x00020002] 
struct UBioAutoConditionals_execF1817_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1817_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1817_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1832
// [0x00020002] 
struct UBioAutoConditionals_execF1832_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1832_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1832_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1831
// [0x00020002] 
struct UBioAutoConditionals_execF1831_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1831_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1831_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1825
// [0x00020002] 
struct UBioAutoConditionals_execF1825_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1825_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1825_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1830
// [0x00020002] 
struct UBioAutoConditionals_execF1830_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1830_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1830_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1829
// [0x00020002] 
struct UBioAutoConditionals_execF1829_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1829_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1829_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1779
// [0x00020002] 
struct UBioAutoConditionals_execF1779_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1779_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1779_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1778
// [0x00020002] 
struct UBioAutoConditionals_execF1778_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1778_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1778_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1777
// [0x00020002] 
struct UBioAutoConditionals_execF1777_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1777_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1777_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1780
// [0x00020002] 
struct UBioAutoConditionals_execF1780_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1780_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1780_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1781
// [0x00020002] 
struct UBioAutoConditionals_execF1781_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1781_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1781_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1776
// [0x00020002] 
struct UBioAutoConditionals_execF1776_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioAutoConditionals_execF1776_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1776_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1775
// [0x00020002] 
struct UBioAutoConditionals_execF1775_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1775_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1775_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1774
// [0x00020002] 
struct UBioAutoConditionals_execF1774_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1774_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1774_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1773
// [0x00020002] 
struct UBioAutoConditionals_execF1773_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1773_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1773_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1772
// [0x00020002] 
struct UBioAutoConditionals_execF1772_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1772_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1772_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1771
// [0x00020002] 
struct UBioAutoConditionals_execF1771_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1771_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1771_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1770
// [0x00020002] 
struct UBioAutoConditionals_execF1770_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1770_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1770_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1769
// [0x00020002] 
struct UBioAutoConditionals_execF1769_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1769_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1769_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1768
// [0x00020002] 
struct UBioAutoConditionals_execF1768_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1768_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1768_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1767
// [0x00020002] 
struct UBioAutoConditionals_execF1767_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1767_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1767_Parms() {}
};

// Function PlotManagerDLC_UNC.BioAutoConditionals.F1766
// [0x00020002] 
struct UBioAutoConditionals_execF1766_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
