/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: SFXGame_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGame.BioDEBUGMarker.Clear
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventClear_Parms
{

	 ABioDEBUGMarker_eventClear_Parms() { memset(this, 0, sizeof *this); }
	~ABioDEBUGMarker_eventClear_Parms() {}
};

// Function SFXGame.BioDEBUGMarker.AddMarker
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventAddMarker_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 ABioDEBUGMarker_eventAddMarker_Parms() { memset(this, 0, sizeof *this); }
	~ABioDEBUGMarker_eventAddMarker_Parms() {}
};

// Function SFXGame.BioDEBUGMarker.AddLine
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventAddLine_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             _End; };                                          		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0018 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0019 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x001A (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 ABioDEBUGMarker_eventAddLine_Parms() { memset(this, 0, sizeof *this); }
	~ABioDEBUGMarker_eventAddLine_Parms() {}
};

// Function SFXGame.BioDEBUGMarker.Tick
// [0x00020802] ( FUNC_Event )
struct ABioDEBUGMarker_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 ABioDEBUGMarker_eventTick_Parms() { memset(this, 0, sizeof *this); }
	~ABioDEBUGMarker_eventTick_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearMarkers
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearMarkers_Parms
{

	 UBioDEBUGMarkerComponent_eventClearMarkers_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventClearMarkers_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearCircles
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearCircles_Parms
{

	 UBioDEBUGMarkerComponent_eventClearCircles_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventClearCircles_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearDiamonds
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearDiamonds_Parms
{

	 UBioDEBUGMarkerComponent_eventClearDiamonds_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventClearDiamonds_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearArrows
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearArrows_Parms
{

	 UBioDEBUGMarkerComponent_eventClearArrows_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventClearArrows_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.ClearLines
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClearLines_Parms
{

	 UBioDEBUGMarkerComponent_eventClearLines_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventClearLines_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.Clear
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventClear_Parms
{

	 UBioDEBUGMarkerComponent_eventClear_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventClear_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.AddCircles
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddCircles_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x0014 (0x0004) [0x0000000000000000]              

	 UBioDEBUGMarkerComponent_eventAddCircles_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventAddCircles_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.AddDiamond
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddDiamond_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x0014 (0x0004) [0x0000000000000000]              

	 UBioDEBUGMarkerComponent_eventAddDiamond_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventAddDiamond_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.AddMarker
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddMarker_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	int                                                _size;                                            		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0010 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0011 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x0012 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x0014 (0x0004) [0x0000000000000000]              

	 UBioDEBUGMarkerComponent_eventAddMarker_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventAddMarker_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.AddArrows
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddArrows_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             _End; };                                          		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0018 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0019 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x001A (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x001C (0x0004) [0x0000000000000000]              

	 UBioDEBUGMarkerComponent_eventAddArrows_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventAddArrows_Parms() {}
};

// Function SFXGame.BioDEBUGMarkerComponent.AddLine
// [0x00020802] ( FUNC_Event )
struct UBioDEBUGMarkerComponent_eventAddLine_Parms
{
	union { struct FVector                             _Start; };                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             _End; };                                          		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _R;                                               		// 0x0018 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _G;                                               		// 0x0019 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      _B;                                               		// 0x001A (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// int                                             pos;                                              		// 0x001C (0x0004) [0x0000000000000000]              

	 UBioDEBUGMarkerComponent_eventAddLine_Parms() { memset(this, 0, sizeof *this); }
	~UBioDEBUGMarkerComponent_eventAddLine_Parms() {}
};

// Function SFXGame.BioDamageType.SetDeathVFX
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execSetDeathVFX_Parms
{
	class UBioDeathVFX*                                pDeathVFX;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UBioDamageType_execSetDeathVFX_Parms() { memset(this, 0, sizeof *this); }
	~UBioDamageType_execSetDeathVFX_Parms() {}
};

// Function SFXGame.BioDamageType.GetDeathVFX
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execGetDeathVFX_Parms
{
	class UBioDeathVFX*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioDamageType_execGetDeathVFX_Parms() { memset(this, 0, sizeof *this); }
	~UBioDamageType_execGetDeathVFX_Parms() {}
};

// Function SFXGame.BioDamageType.SetAttributes
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execSetAttributes_Parms
{
	class UBioAttributesDamage*                        pAttributes;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UBioDamageType_execSetAttributes_Parms() { memset(this, 0, sizeof *this); }
	~UBioDamageType_execSetAttributes_Parms() {}
};

// Function SFXGame.BioDamageType.GetAttributes
// [0x00020400] ( FUNC_Native )
struct UBioDamageType_execGetAttributes_Parms
{
	class UBioAttributesDamage*                        ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioDamageType_execGetAttributes_Parms() { memset(this, 0, sizeof *this); }
	~UBioDamageType_execGetAttributes_Parms() {}
};

// Function SFXGame.BioDamageType.InitializeDamageType
// [0x00024400] ( FUNC_Native )
struct UBioDamageType_execInitializeDamageType_Parms
{
	class UBioAttributesDamage*                        pAttributes;                                      		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class UBioDeathVFX*                                pDeathVFX;                                        		// 0x0008 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UBioDamageType_execInitializeDamageType_Parms() { memset(this, 0, sizeof *this); }
	~UBioDamageType_execInitializeDamageType_Parms() {}
};

// Function SFXGame.BioDestinationArrow.SetArrowColor
// [0x00020802] ( FUNC_Event )
struct ABioDestinationArrow_eventSetArrowColor_Parms
{
	unsigned char                                      clr;                                              		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	// class UMaterialInstanceConstant*                MC;                                               		// 0x0004 (0x0008) [0x0000000000000000]              

	 ABioDestinationArrow_eventSetArrowColor_Parms() { memset(this, 0, sizeof *this); }
	~ABioDestinationArrow_eventSetArrowColor_Parms() {}
};

// Function SFXGame.BioEventDispatcher.Dispatch
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioEventDispatcher_execDispatch_Parms
{
	union { struct SFXName                             oEventName; };                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UBioEventDispatcher_execDispatch_Parms() { memset(this, 0, sizeof *this); }
	~UBioEventDispatcher_execDispatch_Parms() {}
};

// Function SFXGame.BioEventDispatcher.Unsubscribe
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioEventDispatcher_execUnsubscribe_Parms
{
	union { struct SFXName                             oEventName; };                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     oSubscriber;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioEventDispatcher_execUnsubscribe_Parms() { memset(this, 0, sizeof *this); }
	~UBioEventDispatcher_execUnsubscribe_Parms() {}
};

// Function SFXGame.BioEventDispatcher.Subscribe
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UBioEventDispatcher_execSubscribe_Parms
{
	union { struct SFXName                             oEventName; };                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UObject*                                     oSubscriber;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioEventDispatcher_execSubscribe_Parms() { memset(this, 0, sizeof *this); }
	~UBioEventDispatcher_execSubscribe_Parms() {}
};

// Function SFXGame.BioGameReplicationInfo.PostBeginPlay
// [0x00020102] ( FUNC_Simulated )
struct ABioGameReplicationInfo_execPostBeginPlay_Parms
{

	 ABioGameReplicationInfo_execPostBeginPlay_Parms() { memset(this, 0, sizeof *this); }
	~ABioGameReplicationInfo_execPostBeginPlay_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateRichPresence
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateRichPresence_Parms
{

	 UBioGamerProfile_execUpdateRichPresence_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateRichPresence_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateSoundOptions
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateSoundOptions_Parms
{

	 UBioGamerProfile_execUpdateSoundOptions_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateSoundOptions_Parms() {}
};

// Function SFXGame.BioGamerProfile.ApplyGraphicsOptions
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execApplyGraphicsOptions_Parms
{
	union { struct FGameOptions                        Options; };                                       		// 0x0000 (0x00B0) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execApplyGraphicsOptions_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execApplyGraphicsOptions_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateGraphicsOptions
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateGraphicsOptions_Parms
{

	 UBioGamerProfile_execUpdateGraphicsOptions_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateGraphicsOptions_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateAllOptions
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateAllOptions_Parms
{
	unsigned long                                      bUpdateRichPresence;                              		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UBioGamerProfile_execUpdateAllOptions_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateAllOptions_Parms() {}
};

// Function SFXGame.BioGamerProfile.DuplicateGameOptions
// [0x00420802] ( FUNC_Event )
struct UBioGamerProfile_eventDuplicateGameOptions_Parms
{
	union { struct FGameOptions                        destOptions; };                                   		// 0x0000 (0x00B0) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UBioGamerProfile_eventDuplicateGameOptions_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_eventDuplicateGameOptions_Parms() {}
};

// Function SFXGame.BioGamerProfile.OverwiteGameOptions
// [0x00024802] ( FUNC_Event )
struct UBioGamerProfile_eventOverwiteGameOptions_Parms
{
	union { struct FGameOptions                        sourceOptions; };                                 		// 0x0000 (0x00B0) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUpdateRichPresence;                              		// 0x00B0 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UBioGamerProfile_eventOverwiteGameOptions_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_eventOverwiteGameOptions_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetTargetingAssistModifier
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetTargetingAssistModifier_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetTargetingAssistModifier_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetTargetingAssistModifier_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetOptionEx
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetOptionEx_Parms
{
	union { struct FGameOptions                        io_oGameOptions; };                               		// 0x0000 (0x00B0) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionType;                                    		// 0x00B0 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x00B4 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UBioGamerProfile_execGetOptionEx_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetOptionEx_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetOption
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetOption_Parms
{
	int                                                i_nOptionType;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UBioGamerProfile_execGetOption_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetOption_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetOptionEx
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execSetOptionEx_Parms
{
	union { struct FGameOptions                        io_oGameOptions; };                               		// 0x0000 (0x00B0) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                i_nOptionType;                                    		// 0x00B0 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x00B4 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bSuppressUpdate;                                		// 0x00B8 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetOptionEx_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetOptionEx_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetOption
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetOption_Parms
{
	int                                                i_nOptionType;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_nOptionValue;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bSuppressUpdate;                                		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetOption_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetOption_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetCombatDifficulty
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetCombatDifficulty_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetCombatDifficulty_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetCombatDifficulty_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetCombatDifficulty
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetCombatDifficulty_Parms
{
	int                                                i_Template;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetCombatDifficulty_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetCombatDifficulty_Parms() {}
};

// Function SFXGame.BioGamerProfile.DumpAchievementStats
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execDumpAchievementStats_Parms
{

	 UBioGamerProfile_execDumpAchievementStats_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execDumpAchievementStats_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetGammaPostProcessTemplate
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetGammaPostProcessTemplate_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetGammaPostProcessTemplate_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetGammaPostProcessTemplate_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetGammaPostProcessTemplate
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetGammaPostProcessTemplate_Parms
{
	int                                                i_Template;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetGammaPostProcessTemplate_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetGammaPostProcessTemplate_Parms() {}
};

// Function SFXGame.BioGamerProfile.SelectDefaultStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSelectDefaultStorageDevice_Parms
{

	 UBioGamerProfile_execSelectDefaultStorageDevice_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSelectDefaultStorageDevice_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetDefaultStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetDefaultStorageDevice_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetDefaultStorageDevice_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetDefaultStorageDevice_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetDefaultStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetDefaultStorageDevice_Parms
{
	int                                                i_DeviceId;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetDefaultStorageDevice_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetDefaultStorageDevice_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetBioProfileStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetBioProfileStorageDevice_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetBioProfileStorageDevice_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetBioProfileStorageDevice_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetBioProfileStorageDevice
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetBioProfileStorageDevice_Parms
{
	int                                                i_DeviceId;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetBioProfileStorageDevice_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetBioProfileStorageDevice_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetYAxisInverted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetYAxisInverted_Parms
{
	unsigned long                                      bInverted;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execSetYAxisInverted_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetYAxisInverted_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetYAxisInverted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetYAxisInverted_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetYAxisInverted_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetYAxisInverted_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetAllUnlockedBonusTalentInfo
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetAllUnlockedBonusTalentInfo_Parms
{
	union { TArray<struct FUnlockedBonusTalentInfo>    aUnlockedBonusTalentInfo; };                      		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	union { struct SFXName                             nmCharClass; };                                   		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execGetAllUnlockedBonusTalentInfo_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetAllUnlockedBonusTalentInfo_Parms() {}
};

// Function SFXGame.BioGamerProfile.AwardAllPassiveBonusTalents
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execAwardAllPassiveBonusTalents_Parms
{

	 UBioGamerProfile_execAwardAllPassiveBonusTalents_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execAwardAllPassiveBonusTalents_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateAchievementState
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateAchievementState_Parms
{
	int                                                nAchievementID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bEarned;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUpdatePlotState;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bAwardBonusTalent;                                		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSaveProfile;                                     		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UBioGamerProfile_execUpdateAchievementState_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateAchievementState_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetDefaultValues
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetDefaultValues_Parms
{
	union { struct FGameOptions                        io_Options; };                                    		// 0x0000 (0x00B0) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 UBioGamerProfile_execGetDefaultValues_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetDefaultValues_Parms() {}
};

// Function SFXGame.BioGamerProfile.ResetToDefaults
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execResetToDefaults_Parms
{
	unsigned long                                      bUpdateRichPresence;                              		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UBioGamerProfile_execResetToDefaults_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execResetToDefaults_Parms() {}
};

// Function SFXGame.BioGamerProfile.SortAchievementInfo
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execSortAchievementInfo_Parms
{
	union { TArray<struct FAchievementInfo>            aAchievementList; };                              		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execSortAchievementInfo_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSortAchievementInfo_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetAllAchievementInfo
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetAllAchievementInfo_Parms
{
	union { TArray<struct FAchievementInfo>            aAchievementList; };                              		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execGetAllAchievementInfo_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetAllAchievementInfo_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetAchievementID
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetAchievementID_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetAchievementID_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetAchievementID_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetIsAchievementEarned
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetIsAchievementEarned_Parms
{
	int                                                AchievementId;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetIsAchievementEarned_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetIsAchievementEarned_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateAchievements
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateAchievements_Parms
{
	union { TArray<struct FAchievementDetails>         Achievements; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class ABioPlayerController*                        PC;                                               		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UBioGamerProfile_execUpdateAchievements_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateAchievements_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateCharacterProfilePawnDataEx
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateCharacterProfilePawnDataEx_Parms
{
	union { struct FCharacterProfile                   sCharProfile; };                                  		// 0x0000 (0x00BC) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	class ABioPawn*                                    i_playerPawn;                                     		// 0x00BC (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bUpdateFirstName;                               		// 0x00C4 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oHoursPlayed;                                   		// 0x00C8 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oMinPlayed;                                     		// 0x00CC (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oSecPlayed;                                     		// 0x00D0 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x00D4 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execUpdateCharacterProfilePawnDataEx_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateCharacterProfilePawnDataEx_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateCharacterProfilePawnData
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateCharacterProfilePawnData_Parms
{
	union { FString                                    sCharacterID; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class ABioPawn*                                    i_playerPawn;                                     		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oHoursPlayed;                                   		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oMinPlayed;                                     		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                i_oSecPlayed;                                     		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      i_bUpdateFirstName;                               		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0028 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execUpdateCharacterProfilePawnData_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateCharacterProfilePawnData_Parms() {}
};

// Function SFXGame.BioGamerProfile.DeleteCharacterProfile
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execDeleteCharacterProfile_Parms
{
	union { FString                                    sCharacterID; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execDeleteCharacterProfile_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execDeleteCharacterProfile_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetCharacterProfileIndex
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetCharacterProfileIndex_Parms
{
	union { FString                                    sCharacterID; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetCharacterProfileIndex_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetCharacterProfileIndex_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetCharacterProfile
// [0x00024400] ( FUNC_Native )
struct UBioGamerProfile_execSetCharacterProfile_Parms
{
	union { FString                                    sCharacterID; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { struct FCharacterProfile                   i_CharProfile; };                                 		// 0x0010 (0x00BC) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      i_bAddProfileIfNotExist;                          		// 0x00CC (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 UBioGamerProfile_execSetCharacterProfile_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetCharacterProfile_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetCharacterProfile
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetCharacterProfile_Parms
{
	union { FString                                    sCharacterID; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { struct FCharacterProfile                   ReturnValue; };                                   		// 0x0010 (0x00BC) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execGetCharacterProfile_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetCharacterProfile_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetCharacterProfileLastPlayedSlot
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetCharacterProfileLastPlayedSlot_Parms
{
	union { FString                                    sCharacaterID; };                                 		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nLastPlayedSlot;                                  		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execSetCharacterProfileLastPlayedSlot_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetCharacterProfileLastPlayedSlot_Parms() {}
};

// Function SFXGame.BioGamerProfile.ConvertToValidCharacterID
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execConvertToValidCharacterID_Parms
{
	union { FString                                    sCharacterName; };                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bConvertAccentCharacters;                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0014 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execConvertToValidCharacterID_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execConvertToValidCharacterID_Parms() {}
};

// Function SFXGame.BioGamerProfile.CreateNewCharacterProfile
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execCreateNewCharacterProfile_Parms
{
	union { FString                                    sCharacterName; };                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    ReturnValue; };                                   		// 0x0010 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execCreateNewCharacterProfile_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execCreateNewCharacterProfile_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetFloatStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetFloatStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fValue;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execSetFloatStatistic_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetFloatStatistic_Parms() {}
};

// Function SFXGame.BioGamerProfile.InrementFloatStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execInrementFloatStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fAmount;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execInrementFloatStatistic_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execInrementFloatStatistic_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetFloatStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetFloatStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetFloatStatistic_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetFloatStatistic_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetIntStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetIntStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nValue;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execSetIntStatistic_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetIntStatistic_Parms() {}
};

// Function SFXGame.BioGamerProfile.IncrementIntStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execIncrementIntStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nAmount;                                          		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execIncrementIntStatistic_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execIncrementIntStatistic_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetIntStatistic
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetIntStatistic_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetIntStatistic_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetIntStatistic_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetHighestDifficultyCompleted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetHighestDifficultyCompleted_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetHighestDifficultyCompleted_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetHighestDifficultyCompleted_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetPlaythroughCompleted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetPlaythroughCompleted_Parms
{
	int                                                nDifficulty;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetPlaythroughCompleted_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetPlaythroughCompleted_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetNumberOfPlaythroughsCompleted
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetNumberOfPlaythroughsCompleted_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetNumberOfPlaythroughsCompleted_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetNumberOfPlaythroughsCompleted_Parms() {}
};

// Function SFXGame.BioGamerProfile.UpdateEndGameGamerProfileStats
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execUpdateEndGameGamerProfileStats_Parms
{
	unsigned long                                      bLogStats;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execUpdateEndGameGamerProfileStats_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execUpdateEndGameGamerProfileStats_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetUnlockedTalentTrees
// [0x00420400] ( FUNC_Native )
struct UBioGamerProfile_execGetUnlockedTalentTrees_Parms
{
	union { TArray<int>                                aUnlockedTalentTrees; };                          		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execGetUnlockedTalentTrees_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetUnlockedTalentTrees_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetRewardStatUnlockedAt
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetRewardStatUnlockedAt_Parms
{
	union { FString                                    sStatisticName; };                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetRewardStatUnlockedAt_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetRewardStatUnlockedAt_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetRewardStatName
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetRewardStatName_Parms
{
	int                                                nAchievementID;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UBioGamerProfile_execGetRewardStatName_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetRewardStatName_Parms() {}
};

// Function SFXGame.BioGamerProfile.GetIsRewardStatUnlocked
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execGetIsRewardStatUnlocked_Parms
{
	union { FString                                    sStatisticName; };                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execGetIsRewardStatUnlocked_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execGetIsRewardStatUnlocked_Parms() {}
};

// Function SFXGame.BioGamerProfile.IncrementRewardStat
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execIncrementRewardStat_Parms
{
	union { FString                                    sStatisticName; };                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nAmount;                                          		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execIncrementRewardStat_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execIncrementRewardStat_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetRewardStat
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetRewardStat_Parms
{
	union { FString                                    sStatisticName; };                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nValue;                                           		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execSetRewardStat_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetRewardStat_Parms() {}
};

// Function SFXGame.BioGamerProfile.RestoreGamerProfilePlotManagerVariables
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execRestoreGamerProfilePlotManagerVariables_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execRestoreGamerProfilePlotManagerVariables_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execRestoreGamerProfilePlotManagerVariables_Parms() {}
};

// Function SFXGame.BioGamerProfile.SetGamerProfilePlotManagerVariables
// [0x00020400] ( FUNC_Native )
struct UBioGamerProfile_execSetGamerProfilePlotManagerVariables_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioGamerProfile_execSetGamerProfilePlotManagerVariables_Parms() { memset(this, 0, sizeof *this); }
	~UBioGamerProfile_execSetGamerProfilePlotManagerVariables_Parms() {}
};

// Function SFXGame.BioObject.ValidateOwnershipSemantics
// [0x00026400] ( FUNC_Native )
struct UBioObject_execValidateOwnershipSemantics_Parms
{
	class UObject*                                     Target;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      isVerbose;                                        		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                recurrence;                                       		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UBioObject_execValidateOwnershipSemantics_Parms() { memset(this, 0, sizeof *this); }
	~UBioObject_execValidateOwnershipSemantics_Parms() {}
};

// Function SFXGame.BioObject.ParseIntoArray
// [0x00422400] ( FUNC_Native )
struct UBioObject_execParseIntoArray_Parms
{
	union { TArray<FString>                            aString; };                                       		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	union { FString                                    sDelimitedStrings; };                             		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    sDelimiter; };                                    		// 0x0020 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bCullEmptyStrings;                                		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UBioObject_execParseIntoArray_Parms() { memset(this, 0, sizeof *this); }
	~UBioObject_execParseIntoArray_Parms() {}
};

// Function SFXGame.BioObject.ParseIntoArrayWS
// [0x00422400] ( FUNC_Native )
struct UBioObject_execParseIntoArrayWS_Parms
{
	union { FString                                    whitespaceDelimitedStrings; };                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { TArray<FString>                            Strings; };                                       		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UBioObject_execParseIntoArrayWS_Parms() { memset(this, 0, sizeof *this); }
	~UBioObject_execParseIntoArrayWS_Parms() {}
};

// Function SFXGame.BioObject.GetEnumValue
// [0x00422400] ( FUNC_Native )
struct UBioObject_execGetEnumValue_Parms
{
	class UClass*                                      clsEnumDefiner;                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             nmEnumField; };                                   		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             nmEnumValue; };                                   		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
