/*
#############################################################################################
# Mass Effect 1 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: SFXOnlineFoundation_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXOnlineFoundation.SFXOnlineEvent.Update
// [0x00020400] ( FUNC_Native )
struct USFXOnlineEvent_execUpdate_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execUpdate_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execUpdate_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsComplete
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsComplete_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsComplete_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsComplete_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsPending
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsPending_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsPending_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsPending_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.CompleteAndSucceeded
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execCompleteAndSucceeded_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execCompleteAndSucceeded_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execCompleteAndSucceeded_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.HasTimedOut
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execHasTimedOut_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execHasTimedOut_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execHasTimedOut_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsTimeoutEnabled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsTimeoutEnabled_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsTimeoutEnabled_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsTimeoutEnabled_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.DisableTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execDisableTimeout_Parms
{

	 USFXOnlineEvent_execDisableTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execDisableTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.EnableTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execEnableTimeout_Parms
{

	 USFXOnlineEvent_execEnableTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execEnableTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetTimeout_Parms
{
	float                                              fEventTimeout;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetTimeout_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetErrorString
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetErrorString_Parms
{
	union { FString                                    sMessage; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execSetErrorString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetErrorString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetErrorString
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetErrorString_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execGetErrorString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetErrorString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetErrorCode
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetErrorCode_Parms
{
	int                                                nCode;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetErrorCode_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetErrorCode_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetErrorCode
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetErrorCode_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetErrorCode_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetErrorCode_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetStatus
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetStatus_Parms
{
	unsigned char                                      eNewStatus;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetStatus_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetStatus_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetStatus
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetStatus_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetStatus_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetStatus_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetOutcome
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetOutcome_Parms
{
	unsigned char                                      eStatusFinished;                                  		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetOutcome_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetOutcome_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetOutcome
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetOutcome_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetOutcome_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetOutcome_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetEventId
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetEventId_Parms
{
	int                                                nNewEventId;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetEventId_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetEventId_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventId
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetEventId_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetEventId_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventId_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetEventType
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetEventType_Parms
{
	unsigned char                                      eNewEventType;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetEventType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetEventType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventType
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetEventType_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetEventType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Integer.SetInteger
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Integer_execSetInteger_Parms
{
	int                                                nInteger;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_Integer_execSetInteger_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Integer_execSetInteger_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Integer.GetInteger
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Integer_execGetInteger_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_Integer_execGetInteger_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Integer_execGetInteger_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_String.SetStringData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_String_execSetStringData_Parms
{
	union { FString                                    sStringData; };                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineEvent_String_execSetStringData_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_String_execSetStringData_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_String.GetStringData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_String_execGetStringData_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_String_execGetStringData_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_String_execGetStringData_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.SetPriority
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execSetPriority_Parms
{
	int                                                nPriority;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_Notification_execSetPriority_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execSetPriority_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.GetPriority
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execGetPriority_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_Notification_execGetPriority_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execGetPriority_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.SetImageName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execSetImageName_Parms
{
	union { FString                                    sImageName; };                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineEvent_Notification_execSetImageName_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execSetImageName_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.GetImageName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execGetImageName_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_Notification_execGetImageName_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execGetImageName_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetNextTimedOutEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetNextTimedOutEvent_Parms
{
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetNextTimedOutEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetNextTimedOutEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.RemoveEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execRemoveEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execRemoveEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execRemoveEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.FindEventByType
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execFindEventByType_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                nEventId;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execFindEventByType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execFindEventByType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.FindEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execFindEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execFindEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execFindEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetEventAtIndex
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetEventAtIndex_Parms
{
	int                                                nEventIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetEventAtIndex_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetEventAtIndex_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.AddEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execAddEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execAddEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execAddEvent_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponent.GetAPIName
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponent_execGetAPIName_Parms
{
	union { struct SFXName                             ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponent_execGetAPIName_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponent_execGetAPIName_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponent.OnRelease
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponent_execOnRelease_Parms
{

	 UISFXOnlineComponent_execOnRelease_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponent_execOnRelease_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponent.OnInitialize
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponent_execOnInitialize_Parms
{
	class USFXOnlineSubsystem*                         oOnlineSubsystem;                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponent_execOnInitialize_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponent_execOnInitialize_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAPI.Idle
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAPI_execIdle_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAPI_execIdle_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAPI_execIdle_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.GetTitleAchievementID
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UISFXOnlineComponentAchievement_execGetTitleAchievementID_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SetIndex;                                         		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAchievement_execGetTitleAchievementID_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execGetTitleAchievementID_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.GetPlatformAchievementID
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UISFXOnlineComponentAchievement_execGetPlatformAchievementID_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SetIndex;                                         		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAchievement_execGetPlatformAchievementID_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execGetPlatformAchievementID_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.IsGranted
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAchievement_execIsGranted_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AchievementId;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAchievement_execIsGranted_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execIsGranted_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.Grant
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAchievement_execGrant_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AchievementId;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentAchievement_execGrant_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execGrant_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GetConnectMode
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGetConnectMode_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execGetConnectMode_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGetConnectMode_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GetUIState
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGetUIState_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execGetUIState_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGetUIState_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CanShowPresenceInformation
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCanShowPresenceInformation_Parms
{
	int                                                nUserIndex;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCanShowPresenceInformation_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCanShowPresenceInformation_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CanViewPlayerProfiles
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCanViewPlayerProfiles_Parms
{
	int                                                nUserIndex;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCanViewPlayerProfiles_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCanViewPlayerProfiles_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CanPurchaseContent
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCanPurchaseContent_Parms
{
	int                                                nUserIndex;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCanPurchaseContent_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCanPurchaseContent_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CanDownloadUserContent
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCanDownloadUserContent_Parms
{
	int                                                nUserIndex;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCanDownloadUserContent_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCanDownloadUserContent_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CanCommunicate
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCanCommunicate_Parms
{
	int                                                nUserIndex;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCanCommunicate_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCanCommunicate_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CanPlayOnline
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCanPlayOnline_Parms
{
	int                                                nUserIndex;                                       		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCanPlayOnline_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCanPlayOnline_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.EnterCDKey
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execEnterCDKey_Parms
{
	union { FString                                    sKey; };                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execEnterCDKey_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execEnterCDKey_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.OnDownloadOffersUICompleted
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execOnDownloadOffersUICompleted_Parms
{

	 UISFXOnlineComponentLogin_execOnDownloadOffersUICompleted_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execOnDownloadOffersUICompleted_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.OnDLCInfoLoaded
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execOnDLCInfoLoaded_Parms
{

	 UISFXOnlineComponentLogin_execOnDLCInfoLoaded_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execOnDLCInfoLoaded_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.OpenCerberusUI
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execOpenCerberusUI_Parms
{

	 UISFXOnlineComponentLogin_execOpenCerberusUI_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execOpenCerberusUI_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CheckEntitlement
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCheckEntitlement_Parms
{
	union { FString                                    sGroup; };                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    sTag; };                                          		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execCheckEntitlement_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCheckEntitlement_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.IsCerberusMember
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execIsCerberusMember_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execIsCerberusMember_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execIsCerberusMember_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.DisablePersona
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execDisablePersona_Parms
{
	union { FString                                    sPersonaNonGrata; };                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execDisablePersona_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execDisablePersona_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.CreatePersona
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCreatePersona_Parms
{
	union { FString                                    sPersonaName; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execCreatePersona_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCreatePersona_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SelectPersona
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSelectPersona_Parms
{
	union { FString                                    sPersonaName; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execSelectPersona_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSelectPersona_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.AcceptTOS
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execAcceptTOS_Parms
{
	unsigned long                                      bAccepted;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execAcceptTOS_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execAcceptTOS_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.Disconnect
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execDisconnect_Parms
{

	 UISFXOnlineComponentLogin_execDisconnect_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execDisconnect_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitStore
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitStore_Parms
{
	union { TArray<int>                                aiChosen; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execSubmitStore_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitStore_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitCreateNucleusAccountEx
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitCreateNucleusAccountEx_Parms
{
	union { FString                                    sEmail; };                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    sPassword; };                                     		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bEAProducts;                                      		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bThirdParty;                                      		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bBioWareProducts;                                 		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    i_sCountryCode; };                                		// 0x002C (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                BirthDay;                                         		// 0x003C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                BirthMonth;                                       		// 0x0040 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                BirthYear;                                        		// 0x0044 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    i_sLanguageCode; };                               		// 0x0048 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bSubmit;                                          		// 0x0058 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitCreateNucleusAccountEx_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitCreateNucleusAccountEx_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitEmailPasswordMismatch
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitEmailPasswordMismatch_Parms
{
	union { FString                                    Email; };                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    Password; };                                      		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                eReturnCode;                                      		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitEmailPasswordMismatch_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitEmailPasswordMismatch_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitMessageBox
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitMessageBox_Parms
{
	int                                                eReturnCode;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitMessageBox_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitMessageBox_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitRedeemCode
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitRedeemCode_Parms
{
	unsigned long                                      bContinue;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    i_sCode; };                                       		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execSubmitRedeemCode_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitRedeemCode_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitCerberusWelcomeMessage
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitCerberusWelcomeMessage_Parms
{

	 UISFXOnlineComponentLogin_execSubmitCerberusWelcomeMessage_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitCerberusWelcomeMessage_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitCerberusIntro
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitCerberusIntro_Parms
{
	int                                                eReturnCode;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitCerberusIntro_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitCerberusIntro_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitNucleusWelcomeMessage
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitNucleusWelcomeMessage_Parms
{

	 UISFXOnlineComponentLogin_execSubmitNucleusWelcomeMessage_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitNucleusWelcomeMessage_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitCreateNucleusAccount
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitCreateNucleusAccount_Parms
{
	union { FString                                    sEmail; };                                        		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    sPassword; };                                     		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bEAProducts;                                      		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bThirdParty;                                      		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bBioWareProducts;                                 		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSubmit;                                          		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitCreateNucleusAccount_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitCreateNucleusAccount_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitParentEmail
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitParentEmail_Parms
{
	unsigned long                                      bContinue;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ParentEmail; };                                   		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execSubmitParentEmail_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitParentEmail_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitNucleusLogin
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitNucleusLogin_Parms
{
	union { FString                                    Email; };                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    Password; };                                      		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      eReturnCode;                                      		// 0x0020 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitNucleusLogin_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitNucleusLogin_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SubmitIntroPage
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSubmitIntroPage_Parms
{
	unsigned long                                      bContinue;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSimulated;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSubmitIntroPage_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSubmitIntroPage_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.Connect
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execConnect_Parms
{
	unsigned char                                      connectMode;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execConnect_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execConnect_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GoBackInUI
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGoBackInUI_Parms
{

	 UISFXOnlineComponentLogin_execGoBackInUI_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGoBackInUI_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.Cancel
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execCancel_Parms
{

	 UISFXOnlineComponentLogin_execCancel_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execCancel_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GetUserId
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGetUserId_Parms
{
	union { struct FUniqueNetId                        ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execGetUserId_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGetUserId_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GetPersonaName
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGetPersonaName_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentLogin_execGetPersonaName_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGetPersonaName_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.HasInternetConnection
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execHasInternetConnection_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execHasInternetConnection_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execHasInternetConnection_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.IsConnectedTo3rdPartyOnlineService
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execIsConnectedTo3rdPartyOnlineService_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execIsConnectedTo3rdPartyOnlineService_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execIsConnectedTo3rdPartyOnlineService_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.HasAccountFor3rdPartyOnlineService
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execHasAccountFor3rdPartyOnlineService_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execHasAccountFor3rdPartyOnlineService_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execHasAccountFor3rdPartyOnlineService_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.IsSignedIn
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execIsSignedIn_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execIsSignedIn_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execIsSignedIn_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.IsConnected
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execIsConnected_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execIsConnected_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execIsConnected_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.SwitchActiveUserIndex
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execSwitchActiveUserIndex_Parms
{
	int                                                nNewIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentLogin_execSwitchActiveUserIndex_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execSwitchActiveUserIndex_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GetActiveUserIndex
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGetActiveUserIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execGetActiveUserIndex_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGetActiveUserIndex_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentLogin.GetLoginStatus
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentLogin_execGetLoginStatus_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentLogin_execGetLoginStatus_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentLogin_execGetLoginStatus_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.GetTargetOfferInfo
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execGetTargetOfferInfo_Parms
{
	unsigned char                                      nSource;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FSFXOnlineTargetOfferInfo           ReturnValue; };                                   		// 0x0004 (0x0020) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentNotification_execGetTargetOfferInfo_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execGetTargetOfferInfo_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.HasUserPurchasedAnOffer
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execHasUserPurchasedAnOffer_Parms
{
	union { struct FSFXOnline_OfferID                  aOfferId; };                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0008 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentNotification_execHasUserPurchasedAnOffer_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execHasUserPurchasedAnOffer_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.DownloadOffers
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execDownloadOffers_Parms
{
	union { TArray<struct FSFXOnline_OfferID>          aOfferIds; };                                     		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentNotification_execDownloadOffers_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execDownloadOffers_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.GetOfferKeyIfEntitled
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execGetOfferKeyIfEntitled_Parms
{
	int                                                internalId;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentNotification_execGetOfferKeyIfEntitled_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execGetOfferKeyIfEntitled_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.GetGrantingOffers
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execGetGrantingOffers_Parms
{
	union { TArray<struct FSFXOfferDescriptor>         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentNotification_execGetGrantingOffers_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execGetGrantingOffers_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.GetEntitledDLCInfo
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execGetEntitledDLCInfo_Parms
{
	union { TArray<struct FSFXOfferDescriptor>         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentNotification_execGetEntitledDLCInfo_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execGetEntitledDLCInfo_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.RefreshEntitlementFlags
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execRefreshEntitlementFlags_Parms
{

	 UISFXOnlineComponentNotification_execRefreshEntitlementFlags_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execRefreshEntitlementFlags_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.GetEntitlementGroups
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execGetEntitlementGroups_Parms
{
	union { TArray<struct FSFXOnlineEntitlementGroupInfo> ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentNotification_execGetEntitlementGroups_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execGetEntitlementGroups_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.GetDaysSinceCerberusRegistration
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execGetDaysSinceCerberusRegistration_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentNotification_execGetDaysSinceCerberusRegistration_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execGetDaysSinceCerberusRegistration_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.IsCalendarUnlockEarned
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execIsCalendarUnlockEarned_Parms
{
	int                                                nDay;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentNotification_execIsCalendarUnlockEarned_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execIsCalendarUnlockEarned_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.RequestServerInfo
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execRequestServerInfo_Parms
{

	 UISFXOnlineComponentNotification_execRequestServerInfo_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execRequestServerInfo_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentNotification.RequestData
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentNotification_execRequestData_Parms
{

	 UISFXOnlineComponentNotification_execRequestData_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentNotification_execRequestData_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentPlatform.GetRebootUserData
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentPlatform_execGetRebootUserData_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentPlatform_execGetRebootUserData_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentPlatform_execGetRebootUserData_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentPlatform.WasRebootedFromOSCodeRedemptionUI
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentPlatform_execWasRebootedFromOSCodeRedemptionUI_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentPlatform_execWasRebootedFromOSCodeRedemptionUI_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentPlatform_execWasRebootedFromOSCodeRedemptionUI_Parms() {}
};

