/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: IpDrv_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function IpDrv.InternetLink.ResolveFailed
// [0x00020800] ( FUNC_Event )
struct AInternetLink_eventResolveFailed_Parms
{

	 AInternetLink_eventResolveFailed_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_eventResolveFailed_Parms() {}
};

// Function IpDrv.InternetLink.Resolved
// [0x00020800] ( FUNC_Event )
struct AInternetLink_eventResolved_Parms
{
	union { struct FIpAddr                             Addr; };                                          		// 0x0000 (0x0014) [0x0000000000000080]              ( CPF_Parm )

	 AInternetLink_eventResolved_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_eventResolved_Parms() {}
};

// Function IpDrv.InternetLink.GetLocalIP
// [0x00420400] ( FUNC_Native )
struct AInternetLink_execGetLocalIP_Parms
{
	union { struct FIpAddr                             Arg; };                                           		// 0x0000 (0x0014) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 AInternetLink_execGetLocalIP_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execGetLocalIP_Parms() {}
};

// Function IpDrv.InternetLink.StringToIpAddr
// [0x00420400] ( FUNC_Native )
struct AInternetLink_execStringToIpAddr_Parms
{
	union { FString                                    Str; };                                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { struct FIpAddr                             Addr; };                                          		// 0x0010 (0x0014) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0024 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AInternetLink_execStringToIpAddr_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execStringToIpAddr_Parms() {}
};

// Function IpDrv.InternetLink.IpAddrToString
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execIpAddrToString_Parms
{
	union { struct FIpAddr                             Arg; };                                           		// 0x0000 (0x0014) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0014 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 AInternetLink_execIpAddrToString_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execIpAddrToString_Parms() {}
};

// Function IpDrv.InternetLink.GetLastError
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execGetLastError_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AInternetLink_execGetLastError_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execGetLastError_Parms() {}
};

// Function IpDrv.InternetLink.Resolve
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execResolve_Parms
{
	union { FString                                    Domain; };                                        		// 0x0000 (0x0010) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )

	 AInternetLink_execResolve_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execResolve_Parms() {}
};

// Function IpDrv.InternetLink.ParseURL
// [0x00420400] ( FUNC_Native )
struct AInternetLink_execParseURL_Parms
{
	union { FString                                    URL; };                                           		// 0x0000 (0x0010) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	union { FString                                    Addr; };                                          		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                PortNum;                                          		// 0x0020 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { FString                                    LevelName; };                                     		// 0x0024 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	union { FString                                    EntryName; };                                     		// 0x0034 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0044 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AInternetLink_execParseURL_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execParseURL_Parms() {}
};

// Function IpDrv.InternetLink.IsDataPending
// [0x00020400] ( FUNC_Native )
struct AInternetLink_execIsDataPending_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AInternetLink_execIsDataPending_Parms() { memset(this, 0, sizeof *this); }
	~AInternetLink_execIsDataPending_Parms() {}
};

// Function IpDrv.TcpLink.ReceivedBinary
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventReceivedBinary_Parms
{
	int                                                Count;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      B[ 0xFF ];                                        		// 0x0004 (0x00FF) [0x0000000000000080]              ( CPF_Parm )

	 ATcpLink_eventReceivedBinary_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_eventReceivedBinary_Parms() {}
};

// Function IpDrv.TcpLink.ReceivedLine
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventReceivedLine_Parms
{
	union { FString                                    Line; };                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 ATcpLink_eventReceivedLine_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_eventReceivedLine_Parms() {}
};

// Function IpDrv.TcpLink.ReceivedText
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventReceivedText_Parms
{
	union { FString                                    Text; };                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 ATcpLink_eventReceivedText_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_eventReceivedText_Parms() {}
};

// Function IpDrv.TcpLink.Closed
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventClosed_Parms
{

	 ATcpLink_eventClosed_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_eventClosed_Parms() {}
};

// Function IpDrv.TcpLink.Opened
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventOpened_Parms
{

	 ATcpLink_eventOpened_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_eventOpened_Parms() {}
};

// Function IpDrv.TcpLink.Accepted
// [0x00020800] ( FUNC_Event )
struct ATcpLink_eventAccepted_Parms
{

	 ATcpLink_eventAccepted_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_eventAccepted_Parms() {}
};

// Function IpDrv.TcpLink.ReadBinary
// [0x00420400] ( FUNC_Native )
struct ATcpLink_execReadBinary_Parms
{
	int                                                Count;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      B[ 0xFF ];                                        		// 0x0004 (0x00FF) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                ReturnValue;                                      		// 0x0104 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execReadBinary_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execReadBinary_Parms() {}
};

// Function IpDrv.TcpLink.ReadText
// [0x00420400] ( FUNC_Native )
struct ATcpLink_execReadText_Parms
{
	union { FString                                    Str; };                                           		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execReadText_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execReadText_Parms() {}
};

// Function IpDrv.TcpLink.SendBinary
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execSendBinary_Parms
{
	int                                                Count;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      B[ 0xFF ];                                        		// 0x0004 (0x00FF) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0104 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execSendBinary_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execSendBinary_Parms() {}
};

// Function IpDrv.TcpLink.SendText
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execSendText_Parms
{
	union { FString                                    Str; };                                           		// 0x0000 (0x0010) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execSendText_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execSendText_Parms() {}
};

// Function IpDrv.TcpLink.IsConnected
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execIsConnected_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execIsConnected_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execIsConnected_Parms() {}
};

// Function IpDrv.TcpLink.Close
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execClose_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execClose_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execClose_Parms() {}
};

// Function IpDrv.TcpLink.Open
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execOpen_Parms
{
	union { struct FIpAddr                             Addr; };                                          		// 0x0000 (0x0014) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execOpen_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execOpen_Parms() {}
};

// Function IpDrv.TcpLink.Listen
// [0x00020400] ( FUNC_Native )
struct ATcpLink_execListen_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execListen_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execListen_Parms() {}
};

// Function IpDrv.TcpLink.BindPort
// [0x00024400] ( FUNC_Native )
struct ATcpLink_execBindPort_Parms
{
	int                                                PortNum;                                          		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bUseNextAvailable;                                		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ATcpLink_execBindPort_Parms() { memset(this, 0, sizeof *this); }
	~ATcpLink_execBindPort_Parms() {}
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadHardwareData
// [0x00020000] 
struct UOnlineEventsInterfaceMcp_execUploadHardwareData_Parms
{
	union { struct FUniqueNetId                        UniqueId; };                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    PlayerNick; };                                    		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineEventsInterfaceMcp_execUploadHardwareData_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineEventsInterfaceMcp_execUploadHardwareData_Parms() {}
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadGameplayEventsData
// [0x00020400] ( FUNC_Native )
struct UOnlineEventsInterfaceMcp_execUploadGameplayEventsData_Parms
{
	class UOnlineGameplayEvents*                       Events;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineEventsInterfaceMcp_execUploadGameplayEventsData_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineEventsInterfaceMcp_execUploadGameplayEventsData_Parms() {}
};

// Function IpDrv.OnlineEventsInterfaceMcp.UploadProfileData
// [0x00020400] ( FUNC_Native )
struct UOnlineEventsInterfaceMcp_execUploadProfileData_Parms
{
	union { struct FUniqueNetId                        UniqueId; };                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    PlayerNick; };                                    		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class UOnlineProfileSettings*                      ProfileSettings;                                  		// 0x0018 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineEventsInterfaceMcp_execUploadProfileData_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineEventsInterfaceMcp_execUploadProfileData_Parms() {}
};

// Function IpDrv.OnlineNewsInterfaceMcp.GetNews
// [0x00020002] 
struct UOnlineNewsInterfaceMcp_execGetNews_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      NewsType;                                         		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             NewsIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]              

	 UOnlineNewsInterfaceMcp_execGetNews_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineNewsInterfaceMcp_execGetNews_Parms() {}
};

// Function IpDrv.OnlineNewsInterfaceMcp.ClearReadNewsCompletedDelegate
// [0x00020002] 
struct UOnlineNewsInterfaceMcp_execClearReadNewsCompletedDelegate_Parms
{
	union { struct FScriptDelegate                     ReadGameNewsDelegate; };                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              

	 UOnlineNewsInterfaceMcp_execClearReadNewsCompletedDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineNewsInterfaceMcp_execClearReadNewsCompletedDelegate_Parms() {}
};

// Function IpDrv.OnlineNewsInterfaceMcp.AddReadNewsCompletedDelegate
// [0x00020002] 
struct UOnlineNewsInterfaceMcp_execAddReadNewsCompletedDelegate_Parms
{
	union { struct FScriptDelegate                     ReadNewsDelegate; };                              		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UOnlineNewsInterfaceMcp_execAddReadNewsCompletedDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineNewsInterfaceMcp_execAddReadNewsCompletedDelegate_Parms() {}
};

// Function IpDrv.OnlineNewsInterfaceMcp.OnReadNewsCompleted
// [0x00120000] 
struct UOnlineNewsInterfaceMcp_execOnReadNewsCompleted_Parms
{
	unsigned long                                      bWasSuccessful;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      NewsType;                                         		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UOnlineNewsInterfaceMcp_execOnReadNewsCompleted_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineNewsInterfaceMcp_execOnReadNewsCompleted_Parms() {}
};

// Function IpDrv.OnlineNewsInterfaceMcp.ReadNews
// [0x00020400] ( FUNC_Native )
struct UOnlineNewsInterfaceMcp_execReadNews_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      NewsType;                                         		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineNewsInterfaceMcp_execReadNews_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineNewsInterfaceMcp_execReadNews_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ClearDownloadedFiles
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execClearDownloadedFiles_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineTitleFileDownloadMcp_execClearDownloadedFiles_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execClearDownloadedFiles_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.GetTitleFileState
// [0x00020002] 
struct UOnlineTitleFileDownloadMcp_execGetTitleFileState_Parms
{
	union { FString                                    Filename; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             FileIndex;                                        		// 0x0014 (0x0004) [0x0000000000000000]              

	 UOnlineTitleFileDownloadMcp_execGetTitleFileState_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execGetTitleFileState_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.GetTitleFileContents
// [0x00420400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execGetTitleFileContents_Parms
{
	union { FString                                    Filename; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { TArray<unsigned char>                      FileContents; };                                  		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineTitleFileDownloadMcp_execGetTitleFileContents_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execGetTitleFileContents_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ClearReadTitleFileCompleteDelegate
// [0x00020002] 
struct UOnlineTitleFileDownloadMcp_execClearReadTitleFileCompleteDelegate_Parms
{
	union { struct FScriptDelegate                     ReadTitleFileCompleteDelegate; };                 		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	// int                                             RemoveIndex;                                      		// 0x0010 (0x0004) [0x0000000000000000]              

	 UOnlineTitleFileDownloadMcp_execClearReadTitleFileCompleteDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execClearReadTitleFileCompleteDelegate_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.AddReadTitleFileCompleteDelegate
// [0x00020002] 
struct UOnlineTitleFileDownloadMcp_execAddReadTitleFileCompleteDelegate_Parms
{
	union { struct FScriptDelegate                     ReadTitleFileCompleteDelegate; };                 		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UOnlineTitleFileDownloadMcp_execAddReadTitleFileCompleteDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execAddReadTitleFileCompleteDelegate_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.ReadTitleFile
// [0x00020400] ( FUNC_Native )
struct UOnlineTitleFileDownloadMcp_execReadTitleFile_Parms
{
	union { FString                                    FileToRead; };                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineTitleFileDownloadMcp_execReadTitleFile_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execReadTitleFile_Parms() {}
};

// Function IpDrv.OnlineTitleFileDownloadMcp.OnReadTitleFileComplete
// [0x00120000] 
struct UOnlineTitleFileDownloadMcp_execOnReadTitleFileComplete_Parms
{
	unsigned long                                      bWasSuccessful;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Filename; };                                      		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UOnlineTitleFileDownloadMcp_execOnReadTitleFileComplete_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineTitleFileDownloadMcp_execOnReadTitleFileComplete_Parms() {}
};

// Function IpDrv.MeshBeacon.DestroyBeacon
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UMeshBeacon_eventDestroyBeacon_Parms
{

	 UMeshBeacon_eventDestroyBeacon_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeacon_eventDestroyBeacon_Parms() {}
};

// Function IpDrv.MeshBeaconClient.DebugRender
// [0x00020002] 
struct UMeshBeaconClient_execDebugRender_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             HistoryIdx;                                       		// 0x0008 (0x0004) [0x0000000000000000]              
	// float                                           XL;                                               		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           YL;                                               		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           Offset;                                           		// 0x0014 (0x0004) [0x0000000000000000]              

	 UMeshBeaconClient_execDebugRender_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execDebugRender_Parms() {}
};

// Function IpDrv.MeshBeaconClient.DumpInfo
// [0x00020002] 
struct UMeshBeaconClient_execDumpInfo_Parms
{
	// int                                             HistoryIdx;                                       		// 0x0000 (0x0004) [0x0000000000000000]              

	 UMeshBeaconClient_execDumpInfo_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execDumpInfo_Parms() {}
};

// Function IpDrv.MeshBeaconClient.SendHostNewGameSessionResponse
// [0x00420400] ( FUNC_Native )
struct UMeshBeaconClient_execSendHostNewGameSessionResponse_Parms
{
	unsigned long                                      bSuccess;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             SessionName; };                                   		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      SearchClass;                                      		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x0014 (0x0050) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0064 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconClient_execSendHostNewGameSessionResponse_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execSendHostNewGameSessionResponse_Parms() {}
};

// Function IpDrv.MeshBeaconClient.OnCreateNewSessionRequestReceived
// [0x00520000] 
struct UMeshBeaconClient_execOnCreateNewSessionRequestReceived_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      SearchClass;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<struct FPlayerMember>               Players; };                                       		// 0x0010 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UMeshBeaconClient_execOnCreateNewSessionRequestReceived_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execOnCreateNewSessionRequestReceived_Parms() {}
};

// Function IpDrv.MeshBeaconClient.OnTravelRequestReceived
// [0x00520000] 
struct UMeshBeaconClient_execOnTravelRequestReceived_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      SearchClass;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x0010 (0x0050) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )

	 UMeshBeaconClient_execOnTravelRequestReceived_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execOnTravelRequestReceived_Parms() {}
};

// Function IpDrv.MeshBeaconClient.OnReceivedBandwidthTestResults
// [0x00520000] 
struct UMeshBeaconClient_execOnReceivedBandwidthTestResults_Parms
{
	unsigned char                                      testType;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      TestResult;                                       		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FConnectionBandwidthStats           BandwidthStats; };                                		// 0x0004 (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )

	 UMeshBeaconClient_execOnReceivedBandwidthTestResults_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execOnReceivedBandwidthTestResults_Parms() {}
};

// Function IpDrv.MeshBeaconClient.OnReceivedBandwidthTestRequest
// [0x00120000] 
struct UMeshBeaconClient_execOnReceivedBandwidthTestRequest_Parms
{
	unsigned char                                      testType;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UMeshBeaconClient_execOnReceivedBandwidthTestRequest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execOnReceivedBandwidthTestRequest_Parms() {}
};

// Function IpDrv.MeshBeaconClient.OnConnectionRequestResult
// [0x00120000] 
struct UMeshBeaconClient_execOnConnectionRequestResult_Parms
{
	unsigned char                                      ConnectionResult;                                 		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UMeshBeaconClient_execOnConnectionRequestResult_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execOnConnectionRequestResult_Parms() {}
};

// Function IpDrv.MeshBeaconClient.BeginBandwidthTest
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconClient_execBeginBandwidthTest_Parms
{
	unsigned char                                      testType;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                TestBufferSize;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconClient_execBeginBandwidthTest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execBeginBandwidthTest_Parms() {}
};

// Function IpDrv.MeshBeaconClient.RequestConnection
// [0x00420400] ( FUNC_Native )
struct UMeshBeaconClient_execRequestConnection_Parms
{
	union { struct FOnlineGameSearchResult             DesiredHost; };                                   		// 0x0000 (0x0010) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	union { struct FClientConnectionRequest            ClientRequest; };                                 		// 0x0010 (0x0028) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      bRegisterSecureAddress;                           		// 0x0038 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x003C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconClient_execRequestConnection_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_execRequestConnection_Parms() {}
};

// Function IpDrv.MeshBeaconClient.DestroyBeacon
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UMeshBeaconClient_eventDestroyBeacon_Parms
{

	 UMeshBeaconClient_eventDestroyBeacon_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconClient_eventDestroyBeacon_Parms() {}
};

// Function IpDrv.MeshBeaconHost.DebugRender
// [0x00020002] 
struct UMeshBeaconHost_execDebugRender_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FUniqueNetId                        CurOptimalHostId; };                              		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             ClientIdx;                                        		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             HistoryIdx;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// union { struct FUniqueNetId                     NetId; };                                         		// 0x0018 (0x0008) [0x0000000000000000]              
	// float                                           XL;                                               		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           YL;                                               		// 0x0024 (0x0004) [0x0000000000000000]              
	// float                                           Offset;                                           		// 0x0028 (0x0004) [0x0000000000000000]              

	 UMeshBeaconHost_execDebugRender_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execDebugRender_Parms() {}
};

// Function IpDrv.MeshBeaconHost.DumpConnections
// [0x00020002] 
struct UMeshBeaconHost_execDumpConnections_Parms
{
	// int                                             ClientIdx;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             HistoryIdx;                                       		// 0x0004 (0x0004) [0x0000000000000000]              
	// union { struct FUniqueNetId                     NetId; };                                         		// 0x0008 (0x0008) [0x0000000000000000]              

	 UMeshBeaconHost_execDumpConnections_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execDumpConnections_Parms() {}
};

// Function IpDrv.MeshBeaconHost.OnReceivedClientCreateNewSessionResult
// [0x00520000] 
struct UMeshBeaconHost_execOnReceivedClientCreateNewSessionResult_Parms
{
	unsigned long                                      bSucceeded;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             SessionName; };                                   		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      SearchClass;                                      		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x0014 (0x0050) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )

	 UMeshBeaconHost_execOnReceivedClientCreateNewSessionResult_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execOnReceivedClientCreateNewSessionResult_Parms() {}
};

// Function IpDrv.MeshBeaconHost.RequestClientCreateNewSession
// [0x00420400] ( FUNC_Native )
struct UMeshBeaconHost_execRequestClientCreateNewSession_Parms
{
	union { struct FUniqueNetId                        PlayerNetId; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             SessionName; };                                   		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      SearchClass;                                      		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<struct FPlayerMember>               Players; };                                       		// 0x0018 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0028 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execRequestClientCreateNewSession_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execRequestClientCreateNewSession_Parms() {}
};

// Function IpDrv.MeshBeaconHost.TellClientsToTravel
// [0x00420400] ( FUNC_Native )
struct UMeshBeaconHost_execTellClientsToTravel_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      SearchClass;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x0010 (0x0050) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )

	 UMeshBeaconHost_execTellClientsToTravel_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execTellClientsToTravel_Parms() {}
};

// Function IpDrv.MeshBeaconHost.OnAllPendingPlayersConnected
// [0x00120000] 
struct UMeshBeaconHost_execOnAllPendingPlayersConnected_Parms
{

	 UMeshBeaconHost_execOnAllPendingPlayersConnected_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execOnAllPendingPlayersConnected_Parms() {}
};

// Function IpDrv.MeshBeaconHost.AllPlayersConnected
// [0x00420400] ( FUNC_Native )
struct UMeshBeaconHost_execAllPlayersConnected_Parms
{
	union { TArray<struct FUniqueNetId>                Players; };                                       		// 0x0000 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execAllPlayersConnected_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execAllPlayersConnected_Parms() {}
};

// Function IpDrv.MeshBeaconHost.GetConnectionIndexForPlayer
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execGetConnectionIndexForPlayer_Parms
{
	union { struct FUniqueNetId                        PlayerNetId; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execGetConnectionIndexForPlayer_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execGetConnectionIndexForPlayer_Parms() {}
};

// Function IpDrv.MeshBeaconHost.SetPendingPlayerConnections
// [0x00420002] 
struct UMeshBeaconHost_execSetPendingPlayerConnections_Parms
{
	union { TArray<struct FUniqueNetId>                Players; };                                       		// 0x0000 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UMeshBeaconHost_execSetPendingPlayerConnections_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execSetPendingPlayerConnections_Parms() {}
};

// Function IpDrv.MeshBeaconHost.OnFinishedBandwidthTest
// [0x00520000] 
struct UMeshBeaconHost_execOnFinishedBandwidthTest_Parms
{
	union { struct FUniqueNetId                        PlayerNetId; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      testType;                                         		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      TestResult;                                       		// 0x0009 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FConnectionBandwidthStats           BandwidthStats; };                                		// 0x000C (0x000C) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )

	 UMeshBeaconHost_execOnFinishedBandwidthTest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execOnFinishedBandwidthTest_Parms() {}
};

// Function IpDrv.MeshBeaconHost.OnStartedBandwidthTest
// [0x00120000] 
struct UMeshBeaconHost_execOnStartedBandwidthTest_Parms
{
	union { struct FUniqueNetId                        PlayerNetId; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      testType;                                         		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UMeshBeaconHost_execOnStartedBandwidthTest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execOnStartedBandwidthTest_Parms() {}
};

// Function IpDrv.MeshBeaconHost.OnReceivedClientConnectionRequest
// [0x00520000] 
struct UMeshBeaconHost_execOnReceivedClientConnectionRequest_Parms
{
	union { struct FClientMeshBeaconConnection         NewClientConnection; };                           		// 0x0000 (0x005C) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 UMeshBeaconHost_execOnReceivedClientConnectionRequest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execOnReceivedClientConnectionRequest_Parms() {}
};

// Function IpDrv.MeshBeaconHost.AllowBandwidthTesting
// [0x00020002] 
struct UMeshBeaconHost_execAllowBandwidthTesting_Parms
{
	unsigned long                                      bEnabled;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UMeshBeaconHost_execAllowBandwidthTesting_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execAllowBandwidthTesting_Parms() {}
};

// Function IpDrv.MeshBeaconHost.CancelPendingBandwidthTests
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execCancelPendingBandwidthTests_Parms
{

	 UMeshBeaconHost_execCancelPendingBandwidthTests_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execCancelPendingBandwidthTests_Parms() {}
};

// Function IpDrv.MeshBeaconHost.HasPendingBandwidthTest
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execHasPendingBandwidthTest_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execHasPendingBandwidthTest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execHasPendingBandwidthTest_Parms() {}
};

// Function IpDrv.MeshBeaconHost.CancelInProgressBandwidthTests
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execCancelInProgressBandwidthTests_Parms
{

	 UMeshBeaconHost_execCancelInProgressBandwidthTests_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execCancelInProgressBandwidthTests_Parms() {}
};

// Function IpDrv.MeshBeaconHost.HasInProgressBandwidthTest
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execHasInProgressBandwidthTest_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execHasInProgressBandwidthTest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execHasInProgressBandwidthTest_Parms() {}
};

// Function IpDrv.MeshBeaconHost.RequestClientBandwidthTest
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execRequestClientBandwidthTest_Parms
{
	union { struct FUniqueNetId                        PlayerNetId; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      testType;                                         		// 0x0008 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                TestBufferSize;                                   		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execRequestClientBandwidthTest_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execRequestClientBandwidthTest_Parms() {}
};

// Function IpDrv.MeshBeaconHost.DestroyBeacon
// [0x00020C00] ( FUNC_Event | FUNC_Native )
struct UMeshBeaconHost_eventDestroyBeacon_Parms
{

	 UMeshBeaconHost_eventDestroyBeacon_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_eventDestroyBeacon_Parms() {}
};

// Function IpDrv.MeshBeaconHost.InitHostBeacon
// [0x00020400] ( FUNC_Native )
struct UMeshBeaconHost_execInitHostBeacon_Parms
{
	union { struct FUniqueNetId                        InOwningPlayerId; };                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UMeshBeaconHost_execInitHostBeacon_Parms() { memset(this, 0, sizeof *this); }
	~UMeshBeaconHost_execInitHostBeacon_Parms() {}
};

// Function IpDrv.OnlineSubsystemCommonImpl.GetRegisteredPlayers
// [0x00420002] 
struct UOnlineSubsystemCommonImpl_execGetRegisteredPlayers_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<struct FUniqueNetId>                OutRegisteredPlayers; };                          		// 0x0008 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
	// int                                             PlayerIdx;                                        		// 0x001C (0x0004) [0x0000000000000000]              

	 UOnlineSubsystemCommonImpl_execGetRegisteredPlayers_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineSubsystemCommonImpl_execGetRegisteredPlayers_Parms() {}
};

// Function IpDrv.OnlineSubsystemCommonImpl.IsPlayerInSession
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemCommonImpl_execIsPlayerInSession_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FUniqueNetId                        PlayerID; };                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineSubsystemCommonImpl_execIsPlayerInSession_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineSubsystemCommonImpl_execIsPlayerInSession_Parms() {}
};

// Function IpDrv.OnlineSubsystemCommonImpl.GetPlayerUniqueNetIdFromIndex
// [0x00020800] ( FUNC_Event )
struct UOnlineSubsystemCommonImpl_eventGetPlayerUniqueNetIdFromIndex_Parms
{
	int                                                UserIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FUniqueNetId                        ReturnValue; };                                   		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineSubsystemCommonImpl_eventGetPlayerUniqueNetIdFromIndex_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineSubsystemCommonImpl_eventGetPlayerUniqueNetIdFromIndex_Parms() {}
};

// Function IpDrv.OnlineSubsystemCommonImpl.GetPlayerNicknameFromIndex
// [0x00020800] ( FUNC_Event )
struct UOnlineSubsystemCommonImpl_eventGetPlayerNicknameFromIndex_Parms
{
	int                                                UserIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UOnlineSubsystemCommonImpl_eventGetPlayerNicknameFromIndex_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineSubsystemCommonImpl_eventGetPlayerNicknameFromIndex_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.ClearQuickMatchCompleteDelegate
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execClearQuickMatchCompleteDelegate_Parms
{
	union { struct FScriptDelegate                     QuickMatchCompleteDelegate; };                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UOnlineGameInterfaceImpl_execClearQuickMatchCompleteDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execClearQuickMatchCompleteDelegate_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.AddQuickMatchCompleteDelegate
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execAddQuickMatchCompleteDelegate_Parms
{
	union { struct FScriptDelegate                     QuickMatchCompleteDelegate; };                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UOnlineGameInterfaceImpl_execAddQuickMatchCompleteDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execAddQuickMatchCompleteDelegate_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.OnQuickMatchComplete
// [0x00120000] 
struct UOnlineGameInterfaceImpl_execOnQuickMatchComplete_Parms
{
	unsigned char                                      Result;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UOnlineGameInterfaceImpl_execOnQuickMatchComplete_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execOnQuickMatchComplete_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.QuickMatch
// [0x00024000] 
struct UOnlineGameInterfaceImpl_execQuickMatch_Parms
{
	class UOnlineGameSettings*                         quickMatchSettings;                               		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execQuickMatch_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execQuickMatch_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.ForceCleanUp
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execForceCleanUp_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execForceCleanUp_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execForceCleanUp_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.BindPlatformSpecificSessionToSearch
// [0x00020400] ( FUNC_Native )
struct UOnlineGameInterfaceImpl_execBindPlatformSpecificSessionToSearch_Parms
{
	unsigned char                                      SearchingPlayerNum;                               		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class UOnlineGameSearch*                           SearchSettings;                                   		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x000C (0x0050) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x005C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execBindPlatformSpecificSessionToSearch_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execBindPlatformSpecificSessionToSearch_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.ReadPlatformSpecificSessionInfoBySessionName
// [0x00420000] 
struct UOnlineGameInterfaceImpl_execReadPlatformSpecificSessionInfoBySessionName_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x0008 (0x0050) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0058 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execReadPlatformSpecificSessionInfoBySessionName_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execReadPlatformSpecificSessionInfoBySessionName_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.ReadPlatformSpecificSessionInfo
// [0x00420400] ( FUNC_Native )
struct UOnlineGameInterfaceImpl_execReadPlatformSpecificSessionInfo_Parms
{
	union { struct FOnlineGameSearchResult             DesiredGame; };                                   		// 0x0000 (0x0010) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	unsigned char                                      PlatformSpecificInfo[ 0x50 ];                     		// 0x0010 (0x0050) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x0060 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execReadPlatformSpecificSessionInfo_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execReadPlatformSpecificSessionInfo_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.QueryNonAdvertisedData
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execQueryNonAdvertisedData_Parms
{
	int                                                StartAt;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumberToQuery;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execQueryNonAdvertisedData_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execQueryNonAdvertisedData_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.RecalculateSkillRating
// [0x00420000] 
struct UOnlineGameInterfaceImpl_execRecalculateSkillRating_Parms
{
	union { struct SFXName                             SessionName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<struct FUniqueNetId>                Players; };                                       		// 0x0008 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execRecalculateSkillRating_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execRecalculateSkillRating_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.AcceptGameInvite
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execAcceptGameInvite_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             SessionName; };                                   		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UOnlineGameInterfaceImpl_execAcceptGameInvite_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execAcceptGameInvite_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.ClearGameInviteAcceptedDelegate
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execClearGameInviteAcceptedDelegate_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FScriptDelegate                     GameInviteAcceptedDelegate; };                    		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UOnlineGameInterfaceImpl_execClearGameInviteAcceptedDelegate_Parms() { memset(this, 0, sizeof *this); }
	~UOnlineGameInterfaceImpl_execClearGameInviteAcceptedDelegate_Parms() {}
};

// Function IpDrv.OnlineGameInterfaceImpl.AddGameInviteAcceptedDelegate
// [0x00020000] 
struct UOnlineGameInterfaceImpl_execAddGameInviteAcceptedDelegate_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
