/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: SFXGameContent_classes.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_SHOTGUN_SMOOTHING_BUFFER                           3

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum SFXGameContent.SFXCustomAction_HenchmanMelee.HenchMeleeStage
/*enum HenchMeleeStage
{
	HM_Attack1                                         = 0,
	HM_Attack2                                         = 1,
	HM_Attack3                                         = 2,
	HM_MAX                                             = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class SFXGameContent.SFXVocalizationManagerSP
// 0x0000 (0x02C0 - 0x02C0)
class ASFXVocalizationManagerSP : public ASFXVocalizationManager
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXGRISP
// 0x0003 (0x0380 - 0x037D)
class ASFXGRISP : public ASFXGRI
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXGameInfoSP
// 0x0000 (0x083C - 0x083C)
class ASFXGameInfoSP : public ASFXGame
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool AwardItem ( struct SFXName ItemName, FString const& Level );
	bool AwardCredits ( int Amount, FString const& Level, unsigned long bShowNotification );
	bool AwardCreditPercent ( float fAmount, FString const& Level, unsigned long bShowNotifications );
	bool AwardXP ( int Amount, FString const& Level, unsigned long bShowNotifications );
	class ANavigationPoint* FindPlayerStart ( class AController* Player, unsigned char InTeam, FString const& IncomingName );
	void eventPostBeginPlay ( );
};

// Class SFXGameContent.SFXDamageType_AssaultRifle
// 0x0000 (0x0130 - 0x0130)
class USFXDamageType_AssaultRifle : public USFXDamageType_Weapon
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXDamageType_HeavyPistol
// 0x0000 (0x0130 - 0x0130)
class USFXDamageType_HeavyPistol : public USFXDamageType_Weapon
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXDamageType_MattockAssaultRifle
// 0x0000 (0x0130 - 0x0130)
class USFXDamageType_MattockAssaultRifle : public USFXDamageType_Weapon
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXGUI_HeavyWeaponReticle
// 0x0018 (0x00D0 - 0x00B8)
class USFXGUI_HeavyWeaponReticle : public USFXGUI_WeaponReticleBase
{
public:
	class UGFxValue*                                   m_oActualReticle;                                 		// 0x00B8 (0x0008) [0x0000000000000000]              
	class UGFxValue*                                   m_oAmmoText;                                      		// 0x00C0 (0x0008) [0x0000000000000000]              
	class UGFxValue*                                   m_oReticleBG;                                     		// 0x00C8 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void eventTargetCanHitChanged ( unsigned long bCanHit );
	void eventWeaponAmmoChanged ( int nAmmo );
	void OnReticleLoaded ( );
	void eventPerformReticleHide ( unsigned long bInstant );
	void eventPerformReticleShow ( unsigned long bInstant );
};

// Class SFXGameContent.SFXSeqAct_GiveStartingConsumables
// 0x0000 (0x00F8 - 0x00F8)
class USFXSeqAct_GiveStartingConsumables : public USequenceAction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void Activated ( );
};

// Class SFXGameContent.SFXSeqAct_OpenWeaponSelection
// 0x0010 (0x0120 - 0x0110)
class USFXSeqAct_OpenWeaponSelection : public UBioSequenceLatentAction
{
public:
	class UGFxMovieInfo*                               WeaponSelectionMovieInfo;                         		// 0x0110 (0x0008) [0x0000000000000000]              
	int                                                MaxWeapons;                                       		// 0x0118 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      ShowAllWeapons : 1;                               		// 0x011C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIsFinished : 1;                                  		// 0x011C (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool OnMovieClosedDelegate ( class USFXGUIMovie* i_ScreenToClose );
	bool UpdateOp ( float fDeltaT );
	void Activated ( );
};

// Class SFXGameContent.SFXShield_Energy_Player
// 0x0000 (0x04BC - 0x04BC)
class ASFXShield_Energy_Player : public ASFXShield_Player
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXWeapon_AssaultRifle_Avenger
// 0x0000 (0x10CC - 0x10CC)
class ASFXWeapon_AssaultRifle_Avenger : public ASFXWeapon_AssaultRifle_Base
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXWeapon_AssaultRifle_Mattock
// 0x0000 (0x10CC - 0x10CC)
class ASFXWeapon_AssaultRifle_Mattock : public ASFXWeapon_AssaultRifle_Base
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXWeapon_Heavy_Beam_Base
// 0x003C (0x1108 - 0x10CC)
class ASFXWeapon_Heavy_Beam_Base : public ASFXHeavyWeapon
{
public:
	struct FVector                                     vLastHitLocation;                                 		// 0x10CC (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FRotator                                    rPreCalAim;                                       		// 0x10D8 (0x000C) [0x0000000000002000]              ( CPF_Transient )
	struct FVector2D                                   BeamInterpSpeed;                                  		// 0x10E4 (0x0008) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                DecalFrequency;                                   		// 0x10EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fCurrentBeamInterpTime;                           		// 0x10F0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              BeamInterpTime;                                   		// 0x10F4 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                LastDecalTime;                                    		// 0x10F8 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              LastImpactTime;                                   		// 0x10FC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              VFXUpdateInterval;                                		// 0x1100 (0x0004) [0x0000000000000000]              
	unsigned long                                      bFiringContinuously : 1;                          		// 0x1104 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )
	unsigned long                                      bIsFiring : 1;                                    		// 0x1104 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	struct FRotator GetAdjustedAim ( struct FVector const& StartFireLoc );
	void PreCalculateAdjustedAim ( float fDeltaTime );
	void UpdateBeam ( float DeltaTime );
	void ProcessInstantHit ( unsigned char FiringMode, struct FImpactInfo const& Impact, int NumHits );
	void CalcFireStart ( );
	void StopFire ( unsigned char FireModeNum );
	void StartFire ( unsigned char FireModeNum );
	void Tick ( float DeltaTime );
	void SpawnImpactEffects ( struct FImpactInfo const& Impact );
	class UWwiseEvent* GetWeaponSpecificImpactSound ( class USFXPhysicalMaterialImpactSounds* ImpactSounds );
	class UParticleSystem* GetWeaponSpecificImpactEffect ( class USFXPhysicalMaterialImpactEffects* ImpactEffects );
	class UDecalComponent* GetWeaponSpecificDecalData ( class USFXPhysicalMaterialDecals* DecalEffects, float* FadeTime );
	void StopMuzzleFlashEffect ( );
	void PlayMuzzleFlashEffect ( );
	void StretchDecal ( struct FImpactInfo const& Impact );
	void SpawnADecal ( struct FImpactInfo const& Impact );
	void InitDefaultDecalProperties ( );
};

// Class SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon
// 0x003C (0x1144 - 0x1108)
class ASFXWeapon_Heavy_LegionDisinfectionWeapon : public ASFXWeapon_Heavy_Beam_Base
{
public:
	FString                                            AmmoAmountRTPC;                                   		// 0x1108 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FGuid                                       ClientEffectFiringGuid;                           		// 0x1118 (0x0010) [0x0000000000000000]              
	class URvrClientEffectInterface*                   CE_FiringTemplate;                                		// 0x1128 (0x0008) [0x0000000000000000]              
	float                                              RechargeRatePerSecond;                            		// 0x1130 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              RechargeDelay;                                    		// 0x1134 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              StoppedFiringTimeStamp;                           		// 0x1138 (0x0004) [0x0000000000000000]              
	float                                              AccumulatedAmmo;                                  		// 0x113C (0x0004) [0x0000000000000000]              
	unsigned long                                      bRecharging : 1;                                  		// 0x1140 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bFireSoundPlaying : 1;                            		// 0x1140 (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool OutOfAmmo ( );
	void InitDefaultDecalProperties ( );
	void Tick ( float DeltaTime );
	class UWwiseEvent* GetWeaponSpecificImpactSound ( class USFXPhysicalMaterialImpactSounds* ImpactSounds );
	class UParticleSystem* GetWeaponSpecificImpactEffect ( class USFXPhysicalMaterialImpactEffects* ImpactEffects );
	void StopMuzzleFlashEffect ( );
	void StopFireSounds ( );
};

// Class SFXGameContent.SFXWeapon_Pistol_Predator
// 0x0000 (0x10C8 - 0x10C8)
class ASFXWeapon_Pistol_Predator : public ASFXWeapon_Pistol_Base
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	class UDecalComponent* GetWeaponSpecificDecalData ( class USFXPhysicalMaterialDecals* DecalEffects, float* FadeTime );
};

// Class SFXGameContent.SFXTreasureDataLive
// 0x0000 (0x0080 - 0x0080)
class USFXTreasureDataLive : public USFXTreasureData
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCharacterClass_Content
// 0x0003 (0x0230 - 0x022D)
class USFXCharacterClass_Content : public USFXCharacterClass
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_Revive
// 0x000E (0x014C - 0x013E)
class USFXCustomAction_Revive : public USFXCustomAction_SingleAnim
{
public:
	class ASFXPawn_PlayerParty*                        DownedPlayer;                                     		// 0x0140 (0x0008) [0x0000000000000000]              
	unsigned long                                      bSuccessRevive : 1;                               		// 0x0148 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void Replicate ( );
	void ClientDoCustomAction ( unsigned long bForced );
	void CheckFiring ( );
	void TickCustomAction ( float DeltaTime );
	void StopCustomAction ( );
	void Resurrect ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_Reload
// 0x0018 (0x0128 - 0x0110)
class USFXCustomAction_Reload : public USFXCustomAction_ReloadBase
{
public:
	struct FBodyStance                                 BS_Anim;                                          		// 0x0110 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              fAnimBlendInTime;                                 		// 0x0120 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimBlendOutTime;                                		// 0x0124 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void StartCustomAction ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_ActivateWeaponFlashlight
// 0x000A (0x0148 - 0x013E)
class USFXCustomAction_ActivateWeaponFlashlight : public USFXCustomAction_SingleAnim
{
public:
	class USFXAnimSetCookSpec*                         AnimInfo;                                         		// 0x0140 (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_MantleLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_MantleLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Mid_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_CoverSlipLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_CoverSlipLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Mid_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_StdCoverSlipLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_StdCoverSlipLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Std_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_SwatTurnLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_SwatTurnLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Mid_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Mid_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_StdSwatTurnLookAt
// 0x0062 (0x01E8 - 0x0186)
class USFXCustomAction_StdSwatTurnLookAt : public USFXCustomAction_LookAtLoop
{
public:
	struct FBodyStance                                 BS_Std_Cov_Right_Start;                           		// 0x0188 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_Loop;                            		// 0x0198 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Right_End;                             		// 0x01A8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Start;                            		// 0x01B8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_Loop;                             		// 0x01C8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_Std_Cov_Left_End;                              		// 0x01D8 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void FlinchActionOverride ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
	struct FBodyStance GetEndBodyStanceAnim ( );
	struct FBodyStance GetLoopBodyStanceAnim ( );
	struct FBodyStance GetStartBodyStanceAnim ( );
};

// Class SFXGameContent.SFXCustomAction_GapJump
// 0x004B (0x0158 - 0x010D)
class USFXCustomAction_GapJump : public UBioCustomAction
{
public:
	struct FBodyStance                                 BS_Anim;                                          		// 0x0110 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ASFXNav_JumpNode*                            StartPoint;                                       		// 0x0120 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class ASFXNav_JumpNode*                            EndPoint;                                         		// 0x0128 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class ASFXReachSpecPlaceholderCylinder*            BlockingStartCylinder;                            		// 0x0130 (0x0008) [0x0000000000000000]              
	class ASFXReachSpecPlaceholderCylinder*            BlockingEndCylinder;                              		// 0x0138 (0x0008) [0x0000000000000000]              
	float                                              fAnimPlayRate;                                    		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimBlendInTime;                                 		// 0x0144 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimBlendOutTime;                                		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimStartTime;                                   		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fAnimDuration;                                    		// 0x0150 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      ERootMotionMode;                                  		// 0x0154 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneX;                                        		// 0x0155 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneY;                                        		// 0x0156 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      RootBoneZ;                                        		// 0x0157 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	bool NotifyBump ( class AActor* Other, struct FVector const& HitNormal );
	void EndThisCustomAction ( );
	void RemoveBlockingEndPoints ( );
	void BlockMoveEndPoints ( );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void StopCustomAction ( );
	void StartAnimation ( );
	void ReachedPrecisePosition ( );
	void AlignmentTimeout ( );
	void StartCustomAction ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_StandingGapJump
// 0x0000 (0x0158 - 0x0158)
class USFXCustomAction_StandingGapJump : public USFXCustomAction_GapJump
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_JumpDown
// 0x0000 (0x01A4 - 0x01A4)
class USFXCustomAction_JumpDown : public USFXCustomAction_BoostDownBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void TickInput ( class UBioPlayerInput* Input, float DeltaTime );
	void PlayStartAnimation ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerMantleOverCover
// 0x0094 (0x05C8 - 0x0534)
class USFXCustomAction_PlayerMantleOverCover : public USFXCustomAction_MantleOverCoverBase
{
public:
	struct FBodyStance                                 BS_CoverStart;                                    		// 0x0534 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_StandingStart;                                 		// 0x0544 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_QuickStandingStart;                            		// 0x0554 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_CoverLoop;                                     		// 0x0564 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_StandingLoop;                                  		// 0x0574 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_QuickStandingLoop;                             		// 0x0584 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_CoverEnd;                                      		// 0x0594 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_StandingEnd;                                   		// 0x05A4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_QuickStandingEnd;                              		// 0x05B4 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bStartFromCover : 1;                              		// 0x05C4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bStartFromStorm : 1;                              		// 0x05C4 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void GetEndAnim ( struct FBodyStance* Stance );
	void GetLoopAnim ( struct FBodyStance* Stance );
	void GetStartAnim ( struct FBodyStance* Stance );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void eventTickCustomAction ( float DeltaTime );
	void StopCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_SimpleMoveBase
// 0x0045 (0x0152 - 0x010D)
class USFXCustomAction_SimpleMoveBase : public UBioCustomAction
{
public:
	struct FBodyStance                                 BS_Anim;                                          		// 0x0110 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ASFXReachSpecPlaceholderCylinder*            BlockingStartCylinder;                            		// 0x0120 (0x0008) [0x0000000000000000]              
	class ASFXReachSpecPlaceholderCylinder*            BlockingEndCylinder;                              		// 0x0128 (0x0008) [0x0000000000000000]              
	class UReachSpec*                                  MovementPath;                                     		// 0x0130 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              MoveDistance;                                     		// 0x0138 (0x0004) [0x0000000000000000]              
	float                                              fBlendInTime;                                     		// 0x013C (0x0004) [0x0000000000000000]              
	float                                              fBlendOutTime;                                    		// 0x0140 (0x0004) [0x0000000000000000]              
	unsigned long                                      bAlignPawnBeforeMove : 1;                         		// 0x0144 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	unsigned char                                      BlendType;                                        		// 0x0148 (0x0001) [0x0000000000000000]              
	unsigned char                                      RootBoneX;                                        		// 0x0149 (0x0001) [0x0000000000000000]              
	unsigned char                                      RootBoneY;                                        		// 0x014A (0x0001) [0x0000000000000000]              
	unsigned char                                      RootBoneZ;                                        		// 0x014B (0x0001) [0x0000000000000000]              
	unsigned char                                      RMM;                                              		// 0x014C (0x0001) [0x0000000000000000]              
	unsigned char                                      RootRotationPitch;                                		// 0x014D (0x0001) [0x0000000000000000]              
	unsigned char                                      RootRotationYaw;                                  		// 0x014E (0x0001) [0x0000000000000000]              
	unsigned char                                      RootRotationRoll;                                 		// 0x014F (0x0001) [0x0000000000000000]              
	unsigned char                                      RMRM;                                             		// 0x0150 (0x0001) [0x0000000000000000]              
	unsigned char                                      MovePhysics;                                      		// 0x0151 (0x0001) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomAction ( unsigned long bForced );
	void Replicate ( );
	bool CanBeInterrupted ( );
	void DestTimeout ( );
	void BodyStanceAnimEndNotification ( class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime );
	void StopCustomAction ( );
	void PlayStartAnimation ( );
	struct FBodyStance GetBodyStanceAnim ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void RemoveBlockingEndPoints ( );
	void BlockMoveEndPoints ( );
	void eventReachedPrecisePosition ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_PlayerMantleUp
// 0x002E (0x0180 - 0x0152)
class USFXCustomAction_PlayerMantleUp : public USFXCustomAction_SimpleMoveBase
{
public:
	struct FBodyStance                                 BS_MantleUpOutOfCover;                            		// 0x0154 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_MantleUpInCover;                               		// 0x0164 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ACoverSlotMarker*                            StartingSlot;                                     		// 0x0174 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bStartInCover : 1;                                		// 0x017C (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomAction ( unsigned long bForced );
	void ServerStartCustomAction ( int NewAction, class ABioPawn* Sync, int NewPowerAction );
	void Replicate ( );
	struct FBodyStance GetBodyStanceAnim ( );
	void StopCustomAction ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipLeft
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipLeft : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipLeftStanding
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipLeftStanding : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipRight
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipRight : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerCoverSlipRightStanding
// 0x0000 (0x0140 - 0x0140)
class USFXCustomAction_PlayerCoverSlipRightStanding : public USFXCustomAction_CoverSlipBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PlayerLadderClimbUp
// 0x0034 (0x01EC - 0x01B8)
class USFXCustomAction_PlayerLadderClimbUp : public USFXCustomAction_ClimbUpBase
{
public:
	struct FBodyStance                                 BS_CloseLadderEnter;                              		// 0x01B8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBodyStance                                 BS_FarLadderEnter;                                		// 0x01C8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UAnimSet*                                    LadderAnimSet;                                    		// 0x01D8 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	float                                              DecayRate;                                        		// 0x01E0 (0x0004) [0x0000000000000000]              
	float                                              CloseEnterDistance;                               		// 0x01E4 (0x0004) [0x0000000000000000]              
	float                                              JumpStartDistance;                                		// 0x01E8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void PreAlignPawnLocation ( );
	void SetMoveStage ( unsigned char NextStage );
	void TickCustomAction ( float DeltaTime );
	void SyncRotation ( float Alpha );
	void SyncJumpEntrance ( float Alpha );
	void TickAlignment ( float DeltaTime );
	void StartCustomAction ( );
	void TickInput ( class UBioPlayerInput* Input, float DeltaTime );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_PlayerLadderClimbDown
// 0x0000 (0x01B0 - 0x01B0)
class USFXCustomAction_PlayerLadderClimbDown : public USFXCustomAction_LadderClimbDownBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void TickInput ( class UBioPlayerInput* Input, float DeltaTime );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeLeft
// 0x0004 (0x0144 - 0x0140)
class USFXCustomAction_PlayerEvadeLeft : public USFXCustomAction_PlayerEvadeBase
{
public:
	float                                              MoveDist;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void RollOverride ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeRight
// 0x0004 (0x0144 - 0x0140)
class USFXCustomAction_PlayerEvadeRight : public USFXCustomAction_PlayerEvadeBase
{
public:
	float                                              MoveDist;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void RollOverride ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeForward
// 0x0014 (0x0154 - 0x0140)
class USFXCustomAction_PlayerEvadeForward : public USFXCustomAction_PlayerEvadeBase
{
public:
	struct FVector                                     MoveOffset;                                       		// 0x0140 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	float                                              MoveDist;                                         		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bHitWallEnabled : 1;                              		// 0x0150 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void RollOverride ( );
	void StopCustomAction ( );
	void TurnOnHitWall ( );
	bool NotifyHitWall ( struct FVector const& HitNormal, class AActor* Wall );
	void EndThisCustomAction ( );
	void SyncRotation ( float Alpha, struct FVector const& ToEnd2D );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_PlayerEvadeBackwards
// 0x0004 (0x0144 - 0x0140)
class USFXCustomAction_PlayerEvadeBackwards : public USFXCustomAction_PlayerEvadeBase
{
public:
	float                                              MoveDist;                                         		// 0x0140 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void RollOverride ( );
	void StopCustomAction ( );
	void StartCustomAction ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
};

// Class SFXGameContent.SFXCustomAction_MantleMelee
// 0x0010 (0x0260 - 0x0250)
class USFXCustomAction_MantleMelee : public USFXCustomAction_PlayerMeleeBase
{
public:
	TArray<class AActor*>                              HitActors;                                        		// 0x0250 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void EndThisCustomAction ( );
	void Breakout ( );
	bool NotifyBump ( class AActor* Other, struct FVector const& HitNormal );
	void ClientDoCustomActionImpact ( class AActor* oActor, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void StopCustomAction ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_SyncCoverGrab
// 0x0067 (0x020C - 0x01A5)
class USFXCustomAction_SyncCoverGrab : public USFXCustomAction_ClassMelee
{
public:
	struct FBodyStance                                 BS_AttackerMirror;                                		// 0x01A8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBodyStance                                 BS_VictimMirror;                                  		// 0x01B8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FBasedPosition                              VictimLocation;                                   		// 0x01C8 (0x0038) [0x0000000000000000]              
	class ASFXReachSpecPlaceholderCylinder*            PlaceholderCylinder;                              		// 0x0200 (0x0008) [0x0000000000000000]              
	unsigned long                                      bMirroredAttack : 1;                              		// 0x0208 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void NonSyncedAction ( );
	void SyncAttack ( );
	void GetVictimAnim ( struct FBodyStance* Stance );
	void GetAttackerAnim ( struct FBodyStance* Stance );
	class ABioPawn* GetVictimPawn ( );
	void StartCustomAction ( );
	bool ShouldPlayMirrorAnim ( );
	bool VerifyVictimDestIsClear ( class ABioPawn* VictimPawn, struct FVector const& DestinationPos );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void StartMeleeAttack ( );
};

// Class SFXGameContent.SFXCustomAction_SyncCoverMelee
// 0x0010 (0x0260 - 0x0250)
class USFXCustomAction_SyncCoverMelee : public USFXCustomAction_PlayerMeleeBase
{
public:
	struct FBodyStance                                 BS_AnimPistol;                                    		// 0x0250 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void MeleeImpact ( );
	void StopCustomAction ( );
	void EndThisCustomAction ( );
	void StartCustomAction ( );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_CoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_CoverMeleeRight : public USFXCustomAction_PlayerMeleeBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	class ABioPawn* GetVictimPawn ( );
	void GetMeleeImpactParameters ( struct FAreaEffectParameters* ImpactParams );
	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_CoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_CoverMeleeLeft : public USFXCustomAction_CoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_StdCoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_StdCoverMeleeLeft : public USFXCustomAction_CoverMeleeLeft
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_StdCoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_StdCoverMeleeRight : public USFXCustomAction_CoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_HvyCoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyCoverMeleeRight : public USFXCustomAction_PlayerMeleeBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	class ABioPawn* GetVictimPawn ( );
	void GetMeleeImpactParameters ( struct FAreaEffectParameters* ImpactParams );
	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_HvyCoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyCoverMeleeLeft : public USFXCustomAction_HvyCoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void NonSyncedAction ( );
};

// Class SFXGameContent.SFXCustomAction_HvyStdCoverMeleeLeft
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyStdCoverMeleeLeft : public USFXCustomAction_HvyCoverMeleeLeft
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_HvyStdCoverMeleeRight
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_HvyStdCoverMeleeRight : public USFXCustomAction_HvyCoverMeleeRight
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_RifleMeleeOne
// 0x0004 (0x0254 - 0x0250)
class USFXCustomAction_RifleMeleeOne : public USFXCustomAction_PlayerMeleeBase
{
public:
	float                                              BladeImpactScale;                                 		// 0x0250 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopMove ( );
	bool OnActorImpacted ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector const& HitLocation, struct FVector const& HitNormal );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void StopCustomAction ( );
	void EndAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoRifleMeleeTwo ( );
	void RifleMeleeSecondary ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_RifleMeleeTwo
// 0x0000 (0x0254 - 0x0254)
class USFXCustomAction_RifleMeleeTwo : public USFXCustomAction_RifleMeleeOne
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoRifleMeleeThree ( );
	void RifleMeleeThird ( );
};

// Class SFXGameContent.SFXCustomAction_RifleMeleeThree
// 0x0000 (0x0254 - 0x0254)
class USFXCustomAction_RifleMeleeThree : public USFXCustomAction_RifleMeleeTwo
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void RifleMeleeThird ( );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
};

// Class SFXGameContent.SFXCustomAction_PistolMeleeOne
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_PistolMeleeOne : public USFXCustomAction_PlayerMeleeBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopMove ( );
	bool OnActorImpacted ( unsigned char Resistance, class AActor* oImpacted, int nPreviouslyImpacted, struct FVector const& HitLocation, struct FVector const& HitNormal );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void StopCustomAction ( );
	void EndAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoPistolMeleeTwo ( );
	void PistolMeleeSecondary ( );
	void StartCustomAction ( );
};

// Class SFXGameContent.SFXCustomAction_PistolMeleeTwo
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_PistolMeleeTwo : public USFXCustomAction_PistolMeleeOne
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void DoPistolMeleeThree ( );
	void PistolMeleeThird ( );
};

// Class SFXGameContent.SFXCustomAction_PistolMeleeThree
// 0x0000 (0x0250 - 0x0250)
class USFXCustomAction_PistolMeleeThree : public USFXCustomAction_PistolMeleeTwo
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void StopCustomAction ( );
	void HeavyMelee ( );
	void NoHeavyMelee ( );
	void PistolMeleeThird ( );
	void ReplicateImpact ( class ABioPawn* Target, int ImpactCount, unsigned long bFirstTarget, struct FVector const& HitLocation, struct FVector const& HitNormal, int CustomActionReactionType );
};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpact
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpact : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpactForward
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpactForward : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpactLeft
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpactLeft : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerStandardImpactRight
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerStandardImpactRight : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerMeleed
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerMeleed : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpactForward
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpactForward : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_MeleedLeft
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_MeleedLeft : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_MeleedRight
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_MeleedRight : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpact
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpact : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpactLeft
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpactLeft : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_KnockbackImpactRight
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_KnockbackImpactRight : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_MeleedForward
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_MeleedForward : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_FlinchBase
// 0x00CC (0x020A - 0x013E)
class USFXCustomAction_FlinchBase : public USFXCustomAction_SingleAnim
{
public:
	struct FBodyStance                                 BS_Reaction;                                      		// 0x0140 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAlt;                                   		// 0x0150 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionMidRight;                              		// 0x0160 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltMidRight;                           		// 0x0170 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionMidLeft;                               		// 0x0180 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltMidLeft;                            		// 0x0190 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionStdRight;                              		// 0x01A0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltStdRight;                           		// 0x01B0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionStdLeft;                               		// 0x01C0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FBodyStance                                 BS_ReactionAltStdLeft;                            		// 0x01D0 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAnimSet*                                    AnimSet;                                          		// 0x01E0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallSoundPlayer;                             		// 0x01E8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallImpactSoundPlayer;                       		// 0x01F0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallSoundHench;                              		// 0x01F8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UWwiseEvent*                                 CloseCallImpactSoundHench;                        		// 0x0200 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CoverType;                                        		// 0x0208 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      CoverAction;                                      		// 0x0209 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

	void PlayImpactSound ( );
	void PlayWhizSound ( );
	void FlinchActionOverride ( );
	void StopCustomAction ( );
	void StartCustomAction ( );
	struct FBodyStance GetBodyStanceAnim ( );
	bool InternalCanDoCustomAction ( class ABioPawn* SyncPawn, unsigned long bForced );
	void eventGetUsedAnimNames ( TArray<struct SFXName>* UsedAnims );
};

// Class SFXGameContent.SFXCustomAction_FlinchLight
// 0x0002 (0x020C - 0x020A)
class USFXCustomAction_FlinchLight : public USFXCustomAction_FlinchBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_FlinchHeavy
// 0x0002 (0x020C - 0x020A)
class USFXCustomAction_FlinchHeavy : public USFXCustomAction_FlinchBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCustomAction_PlayerOnFire
// 0x0003 (0x015C - 0x0159)
class USFXCustomAction_PlayerOnFire : public USFXCustomAction_DamageReaction
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXCharacterClass_Adept
// 0x0000 (0x0230 - 0x0230)
class USFXCharacterClass_Adept : public USFXCharacterClass_Content
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass();

};

// Class SFXGameContent.SFXPowerCustomAction_Shockwave
// 0x018B (0x094C - 0x07C1)
class USFXPowerCustomAction_Shockwave : public USFXPowerCustomAction
{
public:
	struct FPowerData                                  NumShockwaveImpacts;                              		// 0x07C4 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  GravityLevel;                                     		// 0x07F8 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  GravityDuration;                                  		// 0x082C (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FPowerData                                  TimeBetweenImpacts;                               		// 0x0860 (0x0034) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
