/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: SFXGameContent_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGameContent.SFXGameInfoSP.AwardItem
// [0x00024002] 
struct ASFXGameInfoSP_execAwardItem_Parms
{
	union { struct SFXName                             ItemName; };                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Level; };                                         		// 0x0008 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// union { struct FTD                              TreasureData; };                                  		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// union { struct FLevelTreasureSaveRecord         NewTreasureRecord; };                             		// 0x007C (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             idx;                                              		// 0x009C (0x0004) [0x0000000000000000]              
	// union { FString                                 S; };                                             		// 0x00A0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// union { struct SFXName                          N; };                                             		// 0x00B0 (0x0008) [0x0000000000000000]              

	 ASFXGameInfoSP_execAwardItem_Parms() { memset(this, 0, sizeof *this); }
	~ASFXGameInfoSP_execAwardItem_Parms() {}
};

// Function SFXGameContent.SFXGameInfoSP.AwardCredits
// [0x00024002] 
struct ASFXGameInfoSP_execAwardCredits_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Level; };                                         		// 0x0004 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNotification;                                		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// union { struct FTD                              TreasureData; };                                  		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             CreditBudget;                                     		// 0x007C (0x0004) [0x0000000000000000]              
	// int                                             CreditsSoFar;                                     		// 0x0080 (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x0084 (0x0004) [0x0000000000000000]              
	// class ASFXInventoryManager*                     Inventory;                                        		// 0x0088 (0x0008) [0x0000000000000000]              
	// union { struct FLevelTreasureSaveRecord         NewTreasureRecord; };                             		// 0x0090 (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )

	 ASFXGameInfoSP_execAwardCredits_Parms() { memset(this, 0, sizeof *this); }
	~ASFXGameInfoSP_execAwardCredits_Parms() {}
};

// Function SFXGameContent.SFXGameInfoSP.AwardCreditPercent
// [0x00024002] 
struct ASFXGameInfoSP_execAwardCreditPercent_Parms
{
	float                                              fAmount;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Level; };                                         		// 0x0004 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNotifications;                               		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// union { struct FTD                              TreasureData; };                                  		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             CreditBudget;                                     		// 0x007C (0x0004) [0x0000000000000000]              
	// class ASFXInventoryManager*                     Inventory;                                        		// 0x0080 (0x0008) [0x0000000000000000]              

	 ASFXGameInfoSP_execAwardCreditPercent_Parms() { memset(this, 0, sizeof *this); }
	~ASFXGameInfoSP_execAwardCreditPercent_Parms() {}
};

// Function SFXGameContent.SFXGameInfoSP.AwardXP
// [0x00024002] 
struct ASFXGameInfoSP_execAwardXP_Parms
{
	int                                                Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Level; };                                         		// 0x0004 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowNotifications;                               		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               oEngine;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// union { struct FTD                              TreasureData; };                                  		// 0x0024 (0x0054) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// unsigned long                                   bFoundData;                                       		// 0x0078 (0x0004) [0x0000000000000000]              
	// int                                             XPBudget;                                         		// 0x007C (0x0004) [0x0000000000000000]              
	// int                                             XPSoFar;                                          		// 0x0080 (0x0004) [0x0000000000000000]              
	// int                                             idx;                                              		// 0x0084 (0x0004) [0x0000000000000000]              
	// class ABioPlayerController*                     PC;                                               		// 0x0088 (0x0008) [0x0000000000000000]              
	// union { struct FLevelTreasureSaveRecord         NewTreasureRecord; };                             		// 0x0090 (0x0020) [0x0000000000400000]              ( CPF_NeedCtorLink )

	 ASFXGameInfoSP_execAwardXP_Parms() { memset(this, 0, sizeof *this); }
	~ASFXGameInfoSP_execAwardXP_Parms() {}
};

// Function SFXGameContent.SFXGameInfoSP.FindPlayerStart
// [0x00024002] 
struct ASFXGameInfoSP_execFindPlayerStart_Parms
{
	class AController*                                 Player;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      InTeam;                                           		// 0x0008 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	union { FString                                    IncomingName; };                                  		// 0x000C (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	class ANavigationPoint*                            ReturnValue;                                      		// 0x001C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXEngine*                               Engine;                                           		// 0x0024 (0x0008) [0x0000000000000000]              
	// union { struct SFXName                          ATStart; };                                       		// 0x002C (0x0008) [0x0000000000000000]              
	// class AActor*                                   ChkActor;                                         		// 0x0034 (0x0008) [0x0000000000000000]              
	// class ABioStartLocation*                        ChkBioStartLocation;                              		// 0x003C (0x0008) [0x0000000000000000]              

	 ASFXGameInfoSP_execFindPlayerStart_Parms() { memset(this, 0, sizeof *this); }
	~ASFXGameInfoSP_execFindPlayerStart_Parms() {}
};

// Function SFXGameContent.SFXGameInfoSP.PostBeginPlay
// [0x00020902] ( FUNC_Simulated | FUNC_Event )
struct ASFXGameInfoSP_eventPostBeginPlay_Parms
{
	// class UEngine*                                  oEngine;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class UClass*                                   TreasureClass;                                    		// 0x0008 (0x0008) [0x0000000000000000]              
	// class UObject*                                  DynamicLoadedClassObject;                         		// 0x0010 (0x0008) [0x0000000000000000]              

	 ASFXGameInfoSP_eventPostBeginPlay_Parms() { memset(this, 0, sizeof *this); }
	~ASFXGameInfoSP_eventPostBeginPlay_Parms() {}
};

// Function SFXGameContent.SFXGUI_HeavyWeaponReticle.TargetCanHitChanged
// [0x00020802] ( FUNC_Event )
struct USFXGUI_HeavyWeaponReticle_eventTargetCanHitChanged_Parms
{
	unsigned long                                      bCanHit;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXGUI_HeavyWeaponReticle_eventTargetCanHitChanged_Parms() { memset(this, 0, sizeof *this); }
	~USFXGUI_HeavyWeaponReticle_eventTargetCanHitChanged_Parms() {}
};

// Function SFXGameContent.SFXGUI_HeavyWeaponReticle.WeaponAmmoChanged
// [0x00020802] ( FUNC_Event )
struct USFXGUI_HeavyWeaponReticle_eventWeaponAmmoChanged_Parms
{
	int                                                nAmmo;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXGUI_HeavyWeaponReticle_eventWeaponAmmoChanged_Parms() { memset(this, 0, sizeof *this); }
	~USFXGUI_HeavyWeaponReticle_eventWeaponAmmoChanged_Parms() {}
};

// Function SFXGameContent.SFXGUI_HeavyWeaponReticle.OnReticleLoaded
// [0x00020002] 
struct USFXGUI_HeavyWeaponReticle_execOnReticleLoaded_Parms
{

	 USFXGUI_HeavyWeaponReticle_execOnReticleLoaded_Parms() { memset(this, 0, sizeof *this); }
	~USFXGUI_HeavyWeaponReticle_execOnReticleLoaded_Parms() {}
};

// Function SFXGameContent.SFXGUI_HeavyWeaponReticle.PerformReticleHide
// [0x00020802] ( FUNC_Event )
struct USFXGUI_HeavyWeaponReticle_eventPerformReticleHide_Parms
{
	unsigned long                                      bInstant;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXGUI_HeavyWeaponReticle_eventPerformReticleHide_Parms() { memset(this, 0, sizeof *this); }
	~USFXGUI_HeavyWeaponReticle_eventPerformReticleHide_Parms() {}
};

// Function SFXGameContent.SFXGUI_HeavyWeaponReticle.PerformReticleShow
// [0x00020802] ( FUNC_Event )
struct USFXGUI_HeavyWeaponReticle_eventPerformReticleShow_Parms
{
	unsigned long                                      bInstant;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXGUI_HeavyWeaponReticle_eventPerformReticleShow_Parms() { memset(this, 0, sizeof *this); }
	~USFXGUI_HeavyWeaponReticle_eventPerformReticleShow_Parms() {}
};

// Function SFXGameContent.SFXSeqAct_GiveStartingConsumables.Activated
// [0x00020002] 
struct USFXSeqAct_GiveStartingConsumables_execActivated_Parms
{
	// class AWorldInfo*                               WI;                                               		// 0x0000 (0x0008) [0x0000000000000000]              
	// class APlayerController*                        PC;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ASFXPawn_Player*                          pPawn;                                            		// 0x0010 (0x0008) [0x0000000000000000]              
	// class ASFXInventoryManager*                     InvManager;                                       		// 0x0018 (0x0008) [0x0000000000000000]              
	// class ASFXWeapon*                               Weapon;                                           		// 0x0020 (0x0008) [0x0000000000000000]              
	// class ABioBaseSquad*                            pSquad;                                           		// 0x0028 (0x0008) [0x0000000000000000]              
	// class APawn*                                    MemberPawn;                                       		// 0x0030 (0x0008) [0x0000000000000000]              
	// class ASFXPawn_Henchman*                        HPawn;                                            		// 0x0038 (0x0008) [0x0000000000000000]              
	// class USFXModule_DamagePlayer*                  DamageModule;                                     		// 0x0040 (0x0008) [0x0000000000000000]              
	// int                                             MaxHealth;                                        		// 0x0048 (0x0004) [0x0000000000000000]              

	 USFXSeqAct_GiveStartingConsumables_execActivated_Parms() { memset(this, 0, sizeof *this); }
	~USFXSeqAct_GiveStartingConsumables_execActivated_Parms() {}
};

// Function SFXGameContent.SFXSeqAct_OpenWeaponSelection.OnMovieClosedDelegate
// [0x00020002] 
struct USFXSeqAct_OpenWeaponSelection_execOnMovieClosedDelegate_Parms
{
	class USFXGUIMovie*                                i_ScreenToClose;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXSeqAct_OpenWeaponSelection_execOnMovieClosedDelegate_Parms() { memset(this, 0, sizeof *this); }
	~USFXSeqAct_OpenWeaponSelection_execOnMovieClosedDelegate_Parms() {}
};

// Function SFXGameContent.SFXSeqAct_OpenWeaponSelection.UpdateOp
// [0x00020002] 
struct USFXSeqAct_OpenWeaponSelection_execUpdateOp_Parms
{
	float                                              fDeltaT;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXSeqAct_OpenWeaponSelection_execUpdateOp_Parms() { memset(this, 0, sizeof *this); }
	~USFXSeqAct_OpenWeaponSelection_execUpdateOp_Parms() {}
};

// Function SFXGameContent.SFXSeqAct_OpenWeaponSelection.Activated
// [0x00020002] 
struct USFXSeqAct_OpenWeaponSelection_execActivated_Parms
{
	// class USFXGUIInteraction*                       oGUI;                                             		// 0x0000 (0x0008) [0x0000000000000000]              
	// class USFXGUI_WeaponSelection*                  oWeapGUI;                                         		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     oPC;                                              		// 0x0010 (0x0008) [0x0000000000000000]              

	 USFXSeqAct_OpenWeaponSelection_execActivated_Parms() { memset(this, 0, sizeof *this); }
	~USFXSeqAct_OpenWeaponSelection_execActivated_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.GetAdjustedAim
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execGetAdjustedAim_Parms
{
	union { struct FVector                             StartFireLoc; };                                  		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FRotator                            ReturnValue; };                                   		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ASFXWeapon_Heavy_Beam_Base_execGetAdjustedAim_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execGetAdjustedAim_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.PreCalculateAdjustedAim
// [0x00080002] 
struct ASFXWeapon_Heavy_Beam_Base_execPreCalculateAdjustedAim_Parms
{
	float                                              fDeltaTime;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// union { struct FVector                          StartFireLoc; };                                  		// 0x0004 (0x000C) [0x0000000000000000]              
	// union { struct FRotator                         rTargetAim; };                                    		// 0x0010 (0x000C) [0x0000000000000000]              
	// union { struct FRotator                         rCurrentAim; };                                   		// 0x001C (0x000C) [0x0000000000000000]              
	// float                                           fInterpSpeed;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	// class ASFXAI_Core*                              AI;                                               		// 0x002C (0x0008) [0x0000000000000000]              

	 ASFXWeapon_Heavy_Beam_Base_execPreCalculateAdjustedAim_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execPreCalculateAdjustedAim_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.UpdateBeam
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execUpdateBeam_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execUpdateBeam_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execUpdateBeam_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.ProcessInstantHit
// [0x00024102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execProcessInstantHit_Parms
{
	unsigned char                                      FiringMode;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FImpactInfo                         Impact; };                                        		// 0x0004 (0x0064) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumHits;                                          		// 0x0068 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execProcessInstantHit_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execProcessInstantHit_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.CalcFireStart
// [0x00020002] 
struct ASFXWeapon_Heavy_Beam_Base_execCalcFireStart_Parms
{
	// union { struct FVector                          StartFireLoc; };                                  		// 0x0000 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          FireDir; };                                       		// 0x000C (0x000C) [0x0000000000000000]              
	// union { struct FVector                          TargetLatVel; };                                  		// 0x0018 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          ToTarget; };                                      		// 0x0024 (0x000C) [0x0000000000000000]              
	// class ASFXAI_Core*                              AI;                                               		// 0x0030 (0x0008) [0x0000000000000000]              
	// int                                             Direction;                                        		// 0x0038 (0x0004) [0x0000000000000000]              
	// float                                           fVelBasedTrackingOffset;                          		// 0x003C (0x0004) [0x0000000000000000]              
	// float                                           fPitchMaxError;                                   		// 0x0040 (0x0004) [0x0000000000000000]              
	// union { struct FVector                          TargetLoc; };                                     		// 0x0044 (0x000C) [0x0000000000000000]              

	 ASFXWeapon_Heavy_Beam_Base_execCalcFireStart_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execCalcFireStart_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.StopFire
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execStopFire_Parms
{
	unsigned char                                      FireModeNum;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execStopFire_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execStopFire_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.StartFire
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execStartFire_Parms
{
	unsigned char                                      FireModeNum;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execStartFire_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execStartFire_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.Tick
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execTick_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execTick_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.SpawnImpactEffects
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execSpawnImpactEffects_Parms
{
	union { struct FImpactInfo                         Impact; };                                        		// 0x0000 (0x0064) [0x0000000000000080]              ( CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execSpawnImpactEffects_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execSpawnImpactEffects_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.GetWeaponSpecificImpactSound
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificImpactSound_Parms
{
	class USFXPhysicalMaterialImpactSounds*            ImpactSounds;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UWwiseEvent*                                 ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificImpactSound_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificImpactSound_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.GetWeaponSpecificImpactEffect
// [0x00022102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificImpactEffect_Parms
{
	class USFXPhysicalMaterialImpactEffects*           ImpactEffects;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UParticleSystem*                             ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificImpactEffect_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificImpactEffect_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.GetWeaponSpecificDecalData
// [0x00420102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificDecalData_Parms
{
	class USFXPhysicalMaterialDecals*                  DecalEffects;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              FadeTime;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UDecalComponent*                             ReturnValue;                                      		// 0x000C (0x0008) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
	// int                                             DecalLength;                                      		// 0x0014 (0x0004) [0x0000000000000000]              

	 ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificDecalData_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execGetWeaponSpecificDecalData_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.StopMuzzleFlashEffect
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execStopMuzzleFlashEffect_Parms
{

	 ASFXWeapon_Heavy_Beam_Base_execStopMuzzleFlashEffect_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execStopMuzzleFlashEffect_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.PlayMuzzleFlashEffect
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execPlayMuzzleFlashEffect_Parms
{

	 ASFXWeapon_Heavy_Beam_Base_execPlayMuzzleFlashEffect_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execPlayMuzzleFlashEffect_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.StretchDecal
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execStretchDecal_Parms
{
	union { struct FImpactInfo                         Impact; };                                        		// 0x0000 (0x0064) [0x0000000000000080]              ( CPF_Parm )
	// class UPhysicalMaterial*                        ParentPhysMaterial;                               		// 0x0064 (0x0008) [0x0000000000000000]              
	// class UDecalComponent*                          ImpactDecal;                                      		// 0x006C (0x0008) [0x0000000004000000]              ( CPF_EditInline )
	// union { struct FVector                          Stretch; };                                       		// 0x0074 (0x000C) [0x0000000000000000]              
	// float                                           Rot;                                              		// 0x0080 (0x0004) [0x0000000000000000]              
	// float                                           StretchFactor;                                    		// 0x0084 (0x0004) [0x0000000000000000]              
	// union { struct FRotator                         NormRot; };                                       		// 0x0088 (0x000C) [0x0000000000000000]              
	// float                                           FadeTime;                                         		// 0x0094 (0x0004) [0x0000000000000000]              
	// class UMaterialInstanceTimeVarying*             MITV;                                             		// 0x0098 (0x0008) [0x0000000000000000]              

	 ASFXWeapon_Heavy_Beam_Base_execStretchDecal_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execStretchDecal_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.SpawnADecal
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execSpawnADecal_Parms
{
	union { struct FImpactInfo                         Impact; };                                        		// 0x0000 (0x0064) [0x0000000000000080]              ( CPF_Parm )

	 ASFXWeapon_Heavy_Beam_Base_execSpawnADecal_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execSpawnADecal_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_Beam_Base.InitDefaultDecalProperties
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_Beam_Base_execInitDefaultDecalProperties_Parms
{

	 ASFXWeapon_Heavy_Beam_Base_execInitDefaultDecalProperties_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_Beam_Base_execInitDefaultDecalProperties_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.OutOfAmmo
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execOutOfAmmo_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execOutOfAmmo_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execOutOfAmmo_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.InitDefaultDecalProperties
// [0x00020100] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execInitDefaultDecalProperties_Parms
{

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execInitDefaultDecalProperties_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execInitDefaultDecalProperties_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.Tick
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             AmmoRounded;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           fMagSize;                                         		// 0x0008 (0x0004) [0x0000000000000000]              

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execTick_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execTick_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.GetWeaponSpecificImpactSound
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execGetWeaponSpecificImpactSound_Parms
{
	class USFXPhysicalMaterialImpactSounds*            ImpactSounds;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UWwiseEvent*                                 ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execGetWeaponSpecificImpactSound_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execGetWeaponSpecificImpactSound_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.GetWeaponSpecificImpactEffect
// [0x00022102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execGetWeaponSpecificImpactEffect_Parms
{
	class USFXPhysicalMaterialImpactEffects*           ImpactEffects;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UParticleSystem*                             ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execGetWeaponSpecificImpactEffect_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execGetWeaponSpecificImpactEffect_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.StopMuzzleFlashEffect
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execStopMuzzleFlashEffect_Parms
{

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execStopMuzzleFlashEffect_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execStopMuzzleFlashEffect_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Heavy_LegionDisinfectionWeapon.StopFireSounds
// [0x00020102] ( FUNC_Simulated )
struct ASFXWeapon_Heavy_LegionDisinfectionWeapon_execStopFireSounds_Parms
{

	 ASFXWeapon_Heavy_LegionDisinfectionWeapon_execStopFireSounds_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Heavy_LegionDisinfectionWeapon_execStopFireSounds_Parms() {}
};

// Function SFXGameContent.SFXWeapon_Pistol_Predator.GetWeaponSpecificDecalData
// [0x00420102] ( FUNC_Simulated )
struct ASFXWeapon_Pistol_Predator_execGetWeaponSpecificDecalData_Parms
{
	class USFXPhysicalMaterialDecals*                  DecalEffects;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              FadeTime;                                         		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UDecalComponent*                             ReturnValue;                                      		// 0x000C (0x0008) [0x0000000004000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline )
	// int                                             DecalLength;                                      		// 0x0014 (0x0004) [0x0000000000000000]              

	 ASFXWeapon_Pistol_Predator_execGetWeaponSpecificDecalData_Parms() { memset(this, 0, sizeof *this); }
	~ASFXWeapon_Pistol_Predator_execGetWeaponSpecificDecalData_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.BodyStanceAnimEndNotification
// [0x00020000] 
struct USFXCustomAction_Revive_execBodyStanceAnimEndNotification_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXCustomAction_Revive_execBodyStanceAnimEndNotification_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execBodyStanceAnimEndNotification_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.Replicate
// [0x00020002] 
struct USFXCustomAction_Revive_execReplicate_Parms
{

	 USFXCustomAction_Revive_execReplicate_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execReplicate_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.ClientDoCustomAction
// [0x00024002] 
struct USFXCustomAction_Revive_execClientDoCustomAction_Parms
{
	unsigned long                                      bForced;                                          		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXCustomAction_Revive_execClientDoCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execClientDoCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.CheckFiring
// [0x00020002] 
struct USFXCustomAction_Revive_execCheckFiring_Parms
{

	 USFXCustomAction_Revive_execCheckFiring_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execCheckFiring_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.TickCustomAction
// [0x00020002] 
struct USFXCustomAction_Revive_execTickCustomAction_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXCustomAction_Revive_execTickCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execTickCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_Revive_execStopCustomAction_Parms
{

	 USFXCustomAction_Revive_execStopCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execStopCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.Resurrect
// [0x00020002] 
struct USFXCustomAction_Revive_execResurrect_Parms
{
	// class UBioRemoteLogger*                         GLogger;                                          		// 0x0000 (0x0008) [0x0000000000000000]              
	// class USFXAccomplishmentManager*                AccManager;                                       		// 0x0008 (0x0008) [0x0000000000000000]              

	 USFXCustomAction_Revive_execResurrect_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execResurrect_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_Revive_execStartCustomAction_Parms
{

	 USFXCustomAction_Revive_execStartCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execStartCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Revive.InternalCanDoCustomAction
// [0x00080002] 
struct USFXCustomAction_Revive_execInternalCanDoCustomAction_Parms
{
	class ABioPawn*                                    SyncPawn;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bForced;                                          		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXCustomAction_Revive_execInternalCanDoCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Revive_execInternalCanDoCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Reload.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_Reload_execStopCustomAction_Parms
{

	 USFXCustomAction_Reload_execStopCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Reload_execStopCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Reload.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_Reload_execStartCustomAction_Parms
{

	 USFXCustomAction_Reload_execStartCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Reload_execStartCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_Reload.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_Reload_eventGetUsedAnimNames_Parms
{
	union { TArray<struct SFXName>                     UsedAnims; };                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 USFXCustomAction_Reload_eventGetUsedAnimNames_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_Reload_eventGetUsedAnimNames_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_ActivateWeaponFlashlight.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_ActivateWeaponFlashlight_execStopCustomAction_Parms
{

	 USFXCustomAction_ActivateWeaponFlashlight_execStopCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_ActivateWeaponFlashlight_execStopCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_ActivateWeaponFlashlight.StartCustomAction
// [0x00020002] 
struct USFXCustomAction_ActivateWeaponFlashlight_execStartCustomAction_Parms
{

	 USFXCustomAction_ActivateWeaponFlashlight_execStartCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_ActivateWeaponFlashlight_execStartCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execFlinchActionOverride_Parms
{

	 USFXCustomAction_MantleLookAt_execFlinchActionOverride_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_MantleLookAt_execFlinchActionOverride_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_MantleLookAt_eventGetUsedAnimNames_Parms
{
	union { TArray<struct SFXName>                     UsedAnims; };                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 USFXCustomAction_MantleLookAt_eventGetUsedAnimNames_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_MantleLookAt_eventGetUsedAnimNames_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execGetEndBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_MantleLookAt_execGetEndBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_MantleLookAt_execGetEndBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execGetLoopBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_MantleLookAt_execGetLoopBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_MantleLookAt_execGetLoopBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_MantleLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_MantleLookAt_execGetStartBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_MantleLookAt_execGetStartBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_MantleLookAt_execGetStartBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execFlinchActionOverride_Parms
{

	 USFXCustomAction_CoverSlipLookAt_execFlinchActionOverride_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_CoverSlipLookAt_execFlinchActionOverride_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_CoverSlipLookAt_eventGetUsedAnimNames_Parms
{
	union { TArray<struct SFXName>                     UsedAnims; };                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 USFXCustomAction_CoverSlipLookAt_eventGetUsedAnimNames_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_CoverSlipLookAt_eventGetUsedAnimNames_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execGetEndBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_CoverSlipLookAt_execGetEndBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_CoverSlipLookAt_execGetEndBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execGetLoopBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_CoverSlipLookAt_execGetLoopBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_CoverSlipLookAt_execGetLoopBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_CoverSlipLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_CoverSlipLookAt_execGetStartBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_CoverSlipLookAt_execGetStartBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_CoverSlipLookAt_execGetStartBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execFlinchActionOverride_Parms
{

	 USFXCustomAction_StdCoverSlipLookAt_execFlinchActionOverride_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdCoverSlipLookAt_execFlinchActionOverride_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_StdCoverSlipLookAt_eventGetUsedAnimNames_Parms
{
	union { TArray<struct SFXName>                     UsedAnims; };                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdCoverSlipLookAt_eventGetUsedAnimNames_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdCoverSlipLookAt_eventGetUsedAnimNames_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execGetEndBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdCoverSlipLookAt_execGetEndBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdCoverSlipLookAt_execGetEndBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execGetLoopBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdCoverSlipLookAt_execGetLoopBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdCoverSlipLookAt_execGetLoopBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdCoverSlipLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdCoverSlipLookAt_execGetStartBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdCoverSlipLookAt_execGetStartBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdCoverSlipLookAt_execGetStartBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execFlinchActionOverride_Parms
{

	 USFXCustomAction_SwatTurnLookAt_execFlinchActionOverride_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_SwatTurnLookAt_execFlinchActionOverride_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_SwatTurnLookAt_eventGetUsedAnimNames_Parms
{
	union { TArray<struct SFXName>                     UsedAnims; };                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 USFXCustomAction_SwatTurnLookAt_eventGetUsedAnimNames_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_SwatTurnLookAt_eventGetUsedAnimNames_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execGetEndBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_SwatTurnLookAt_execGetEndBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_SwatTurnLookAt_execGetEndBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execGetLoopBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_SwatTurnLookAt_execGetLoopBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_SwatTurnLookAt_execGetLoopBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_SwatTurnLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_SwatTurnLookAt_execGetStartBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_SwatTurnLookAt_execGetStartBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_SwatTurnLookAt_execGetStartBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.FlinchActionOverride
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execFlinchActionOverride_Parms
{

	 USFXCustomAction_StdSwatTurnLookAt_execFlinchActionOverride_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdSwatTurnLookAt_execFlinchActionOverride_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetUsedAnimNames
// [0x00422802] ( FUNC_Event )
struct USFXCustomAction_StdSwatTurnLookAt_eventGetUsedAnimNames_Parms
{
	union { TArray<struct SFXName>                     UsedAnims; };                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdSwatTurnLookAt_eventGetUsedAnimNames_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdSwatTurnLookAt_eventGetUsedAnimNames_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetEndBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execGetEndBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdSwatTurnLookAt_execGetEndBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdSwatTurnLookAt_execGetEndBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetLoopBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execGetLoopBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdSwatTurnLookAt_execGetLoopBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdSwatTurnLookAt_execGetLoopBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_StdSwatTurnLookAt.GetStartBodyStanceAnim
// [0x00020002] 
struct USFXCustomAction_StdSwatTurnLookAt_execGetStartBodyStanceAnim_Parms
{
	union { struct FBodyStance                         ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXCustomAction_StdSwatTurnLookAt_execGetStartBodyStanceAnim_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_StdSwatTurnLookAt_execGetStartBodyStanceAnim_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.NotifyBump
// [0x00020002] 
struct USFXCustomAction_GapJump_execNotifyBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             HitNormal; };                                     		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 OtherPawn;                                        		// 0x0018 (0x0008) [0x0000000000000000]              
	// union { struct FVector                          Dir; };                                           		// 0x0020 (0x000C) [0x0000000000000000]              

	 USFXCustomAction_GapJump_execNotifyBump_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execNotifyBump_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.EndThisCustomAction
// [0x00020002] 
struct USFXCustomAction_GapJump_execEndThisCustomAction_Parms
{

	 USFXCustomAction_GapJump_execEndThisCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execEndThisCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.RemoveBlockingEndPoints
// [0x00020002] 
struct USFXCustomAction_GapJump_execRemoveBlockingEndPoints_Parms
{
	// class USFXCustomReachSpec*                      CustomReachSpec;                                  		// 0x0000 (0x0008) [0x0000000000000000]              

	 USFXCustomAction_GapJump_execRemoveBlockingEndPoints_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execRemoveBlockingEndPoints_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.BlockMoveEndPoints
// [0x00020002] 
struct USFXCustomAction_GapJump_execBlockMoveEndPoints_Parms
{
	// class USFXCustomReachSpec*                      CustomReachSpec;                                  		// 0x0000 (0x0008) [0x0000000000000000]              

	 USFXCustomAction_GapJump_execBlockMoveEndPoints_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execBlockMoveEndPoints_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.BodyStanceAnimEndNotification
// [0x00020002] 
struct USFXCustomAction_GapJump_execBodyStanceAnimEndNotification_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXCustomAction_GapJump_execBodyStanceAnimEndNotification_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execBodyStanceAnimEndNotification_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.StopCustomAction
// [0x00020002] 
struct USFXCustomAction_GapJump_execStopCustomAction_Parms
{

	 USFXCustomAction_GapJump_execStopCustomAction_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execStopCustomAction_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.StartAnimation
// [0x00020002] 
struct USFXCustomAction_GapJump_execStartAnimation_Parms
{

	 USFXCustomAction_GapJump_execStartAnimation_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execStartAnimation_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.ReachedPrecisePosition
// [0x00020002] 
struct USFXCustomAction_GapJump_execReachedPrecisePosition_Parms
{

	 USFXCustomAction_GapJump_execReachedPrecisePosition_Parms() { memset(this, 0, sizeof *this); }
	~USFXCustomAction_GapJump_execReachedPrecisePosition_Parms() {}
};

// Function SFXGameContent.SFXCustomAction_GapJump.AlignmentTimeout
