/*
#############################################################################################
# Mass Effect 3 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: SFXOnlineFoundation_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXOnlineFoundation.SFXOnlineComponent.IsXbox360
// [0x00020802] ( FUNC_Event )
struct USFXOnlineComponent_eventIsXbox360_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_eventIsXbox360_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_eventIsXbox360_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.IsPS3
// [0x00020802] ( FUNC_Event )
struct USFXOnlineComponent_eventIsPS3_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_eventIsPS3_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_eventIsPS3_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.IsConsole
// [0x00020802] ( FUNC_Event )
struct USFXOnlineComponent_eventIsConsole_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_eventIsConsole_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_eventIsConsole_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.GetAllPendingEvents
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execGetAllPendingEvents_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<class USFXOnlineEvent*>             aPendingEvents; };                                		// 0x0004 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_execGetAllPendingEvents_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execGetAllPendingEvents_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.IsAnyEventPending
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execIsAnyEventPending_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_execIsAnyEventPending_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execIsAnyEventPending_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.IsEventPending
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execIsEventPending_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                nEventID;                                         		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_execIsEventPending_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execIsEventPending_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.GetEvent
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execGetEvent_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                nEventID;                                         		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_execGetEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execGetEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.WaitingForWorkSetObject
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execWaitingForWorkSetObject_Parms
{
	union { TArray<class USFXOnlineEvent*>             aOnlineEventSet; };                               		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { struct FScriptDelegate                     fnWorkComplete; };                                		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineComponent_execWaitingForWorkSetObject_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execWaitingForWorkSetObject_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.WaitingForWorkSetType
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execWaitingForWorkSetType_Parms
{
	union { TArray<unsigned char>                      aWorkUnits; };                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { struct FScriptDelegate                     fnWorkComplete; };                                		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineComponent_execWaitingForWorkSetType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execWaitingForWorkSetType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.WaitingForWorkObject
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execWaitingForWorkObject_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FScriptDelegate                     fnWorkComplete; };                                		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineComponent_execWaitingForWorkObject_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execWaitingForWorkObject_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.WaitingForWorkType
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execWaitingForWorkType_Parms
{
	unsigned char                                      eWork;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FScriptDelegate                     fnWorkComplete; };                                		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nEventID;                                         		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXOnlineComponent_execWaitingForWorkType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execWaitingForWorkType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.NotifyWorkFinishedObject
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execNotifyWorkFinishedObject_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      eStatusFinished;                                  		// 0x0008 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXOnlineComponent_execNotifyWorkFinishedObject_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execNotifyWorkFinishedObject_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.NotifyWorkFinishedType
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execNotifyWorkFinishedType_Parms
{
	unsigned char                                      eWork;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      eStatusFinished;                                  		// 0x0001 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                nEventID;                                         		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXOnlineComponent_execNotifyWorkFinishedType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execNotifyWorkFinishedType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.NotifyWorkStartedObject
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execNotifyWorkStartedObject_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      eEventType;                                       		// 0x0008 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              TimeOut;                                          		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXOnlineComponent_execNotifyWorkStartedObject_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execNotifyWorkStartedObject_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.NotifyWorkStartedType
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execNotifyWorkStartedType_Parms
{
	unsigned char                                      eWork;                                            		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                nEventID;                                         		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              fTimeOut;                                         		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXOnlineComponent_execNotifyWorkStartedType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execNotifyWorkStartedType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.NotifyEventObject
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execNotifyEventObject_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineComponent_execNotifyEventObject_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execNotifyEventObject_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.NotifyEventType
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execNotifyEventType_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      eStatus;                                          		// 0x0001 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned char                                      eOutcome;                                         		// 0x0002 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 USFXOnlineComponent_execNotifyEventType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execNotifyEventType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.StopWaitingForAllWork
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execStopWaitingForAllWork_Parms
{
	class UObject*                                     oCallbackTarget;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineComponent_execStopWaitingForAllWork_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execStopWaitingForAllWork_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.UnsubscribeFromAllEvents
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execUnsubscribeFromAllEvents_Parms
{
	class UObject*                                     oCallbackTarget;                                  		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineComponent_execUnsubscribeFromAllEvents_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execUnsubscribeFromAllEvents_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.UnsubscribeFromEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execUnsubscribeFromEvent_Parms
{
	unsigned char                                      oEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FScriptDelegate                     fnEventCallback; };                               		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineComponent_execUnsubscribeFromEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execUnsubscribeFromEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.SubscribeToEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineComponent_execSubscribeToEvent_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { struct FScriptDelegate                     fnEventCallback; };                               		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineComponent_execSubscribeToEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execSubscribeToEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.OnEvent
// [0x00120000] 
struct USFXOnlineComponent_execOnEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineComponent_execOnEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execOnEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.GetAPIName
// [0x00020400] ( FUNC_Native )
struct USFXOnlineComponent_execGetAPIName_Parms
{
	union { struct SFXName                             ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineComponent_execGetAPIName_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execGetAPIName_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.OnRelease
// [0x00020400] ( FUNC_Native )
struct USFXOnlineComponent_execOnRelease_Parms
{

	 USFXOnlineComponent_execOnRelease_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execOnRelease_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineComponent.OnInitialize
// [0x00020400] ( FUNC_Native )
struct USFXOnlineComponent_execOnInitialize_Parms
{
	class USFXOnlineSubsystem*                         oOnlineSubsystem;                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineComponent_execOnInitialize_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineComponent_execOnInitialize_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventTypeFromString
// [0x00022400] ( FUNC_Native )
struct USFXOnlineEvent_execGetEventTypeFromString_Parms
{
	union { FString                                    sEventString; };                                  		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x0010 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetEventTypeFromString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventTypeFromString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventOutcomeAsString
// [0x00022400] ( FUNC_Native )
struct USFXOnlineEvent_execGetEventOutcomeAsString_Parms
{
	unsigned char                                      oEventOutcome;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execGetEventOutcomeAsString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventOutcomeAsString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventStatusAsString
// [0x00022400] ( FUNC_Native )
struct USFXOnlineEvent_execGetEventStatusAsString_Parms
{
	unsigned char                                      eStatusStatus;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execGetEventStatusAsString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventStatusAsString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventTypeAsString
// [0x00022400] ( FUNC_Native )
struct USFXOnlineEvent_execGetEventTypeAsString_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execGetEventTypeAsString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventTypeAsString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.DumpEventInfo
// [0x00020400] ( FUNC_Native )
struct USFXOnlineEvent_execDumpEventInfo_Parms
{

	 USFXOnlineEvent_execDumpEventInfo_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execDumpEventInfo_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.Update
// [0x00020400] ( FUNC_Native )
struct USFXOnlineEvent_execUpdate_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execUpdate_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execUpdate_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsSucceeded
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsSucceeded_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsSucceeded_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsSucceeded_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsCanceled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsCanceled_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsCanceled_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsCanceled_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsInError
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsInError_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsInError_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsInError_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsComplete
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsComplete_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsComplete_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsComplete_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsPending
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsPending_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsPending_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsPending_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsCompleteAndSucceeded
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsCompleteAndSucceeded_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsCompleteAndSucceeded_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsCompleteAndSucceeded_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetEndTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetEndTime_Parms
{
	float                                              CurrentTime;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetEndTime_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetEndTime_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetStartTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetStartTime_Parms
{
	float                                              CurrentTime;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetStartTime_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetStartTime_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEndTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetEndTime_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetEndTime_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEndTime_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetStartTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetStartTime_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetStartTime_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetStartTime_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetTimeDifference
// [0x00024401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetTimeDifference_Parms
{
	float                                              CurrentTime;                                      		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetTimeDifference_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetTimeDifference_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.HasTimedOut
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execHasTimedOut_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execHasTimedOut_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execHasTimedOut_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.IsTimeoutEnabled
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execIsTimeoutEnabled_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execIsTimeoutEnabled_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execIsTimeoutEnabled_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.DisableTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execDisableTimeout_Parms
{

	 USFXOnlineEvent_execDisableTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execDisableTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.EnableTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execEnableTimeout_Parms
{

	 USFXOnlineEvent_execEnableTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execEnableTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetTimeout_Parms
{
	float                                              fEventTimeout;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetTimeout
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetTimeout_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetTimeout_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetTimeout_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetErrorString
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetErrorString_Parms
{
	union { FString                                    sMessage; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execSetErrorString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetErrorString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetErrorString
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetErrorString_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_execGetErrorString_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetErrorString_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetErrorCode
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetErrorCode_Parms
{
	int                                                nCode;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetErrorCode_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetErrorCode_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetErrorCode
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetErrorCode_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetErrorCode_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetErrorCode_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetStatus
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetStatus_Parms
{
	unsigned char                                      eNewStatus;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetStatus_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetStatus_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetStatus
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetStatus_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetStatus_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetStatus_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetOutcome
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetOutcome_Parms
{
	unsigned char                                      eStatusFinished;                                  		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetOutcome_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetOutcome_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetOutcome
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetOutcome_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetOutcome_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetOutcome_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetEventId
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetEventId_Parms
{
	int                                                nNewEventId;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetEventId_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetEventId_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventId
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetEventId_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetEventId_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventId_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.SetEventType
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execSetEventType_Parms
{
	unsigned char                                      eNewEventType;                                    		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_execSetEventType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execSetEventType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent.GetEventType
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_execGetEventType_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_execGetEventType_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_execGetEventType_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Integer.SetInteger
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Integer_execSetInteger_Parms
{
	int                                                nInteger;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_Integer_execSetInteger_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Integer_execSetInteger_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Integer.GetInteger
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Integer_execGetInteger_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_Integer_execGetInteger_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Integer_execGetInteger_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_String.SetStringData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_String_execSetStringData_Parms
{
	union { FString                                    sStringData; };                                   		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineEvent_String_execSetStringData_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_String_execSetStringData_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_String.GetStringData
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_String_execGetStringData_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_String_execGetStringData_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_String_execGetStringData_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.SetPriority
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execSetPriority_Parms
{
	int                                                nPriority;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 USFXOnlineEvent_Notification_execSetPriority_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execSetPriority_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.GetPriority
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execGetPriority_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEvent_Notification_execGetPriority_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execGetPriority_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.SetImageName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execSetImageName_Parms
{
	union { FString                                    sImageName; };                                    		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 USFXOnlineEvent_Notification_execSetImageName_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execSetImageName_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEvent_Notification.GetImageName
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEvent_Notification_execGetImageName_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 USFXOnlineEvent_Notification_execGetImageName_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEvent_Notification_execGetImageName_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetNextTimedOutEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetNextTimedOutEvent_Parms
{
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetNextTimedOutEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetNextTimedOutEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.RemoveEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execRemoveEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execRemoveEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execRemoveEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetAllPendingEvents
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetAllPendingEvents_Parms
{
	unsigned char                                      eEventType;                                       		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	union { TArray<class USFXOnlineEvent*>             PendingEvents; };                                 		// 0x0004 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetAllPendingEvents_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetAllPendingEvents_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.FindEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execFindEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execFindEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execFindEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetEventAtIndex
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetEventAtIndex_Parms
{
	int                                                nEventIndex;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetEventAtIndex_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetEventAtIndex_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.GetEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execGetEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class USFXOnlineEvent*                             ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execGetEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execGetEvent_Parms() {}
};

// Function SFXOnlineFoundation.SFXOnlineEventList.AddEvent
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct USFXOnlineEventList_execAddEvent_Parms
{
	class USFXOnlineEvent*                             oEvent;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 USFXOnlineEventList_execAddEvent_Parms() { memset(this, 0, sizeof *this); }
	~USFXOnlineEventList_execAddEvent_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponent.GetAPIName
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponent_execGetAPIName_Parms
{
	union { struct SFXName                             ReturnValue; };                                   		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponent_execGetAPIName_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponent_execGetAPIName_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponent.OnRelease
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponent_execOnRelease_Parms
{

	 UISFXOnlineComponent_execOnRelease_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponent_execOnRelease_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponent.OnInitialize
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponent_execOnInitialize_Parms
{
	class USFXOnlineSubsystem*                         oOnlineSubsystem;                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponent_execOnInitialize_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponent_execOnInitialize_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.GetTitleAchievementID
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UISFXOnlineComponentAchievement_execGetTitleAchievementID_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SetIndex;                                         		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAchievement_execGetTitleAchievementID_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execGetTitleAchievementID_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.GetPlatformAchievementID
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UISFXOnlineComponentAchievement_execGetPlatformAchievementID_Parms
{
	int                                                Index;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                SetIndex;                                         		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAchievement_execGetPlatformAchievementID_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execGetPlatformAchievementID_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.IsGranted
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAchievement_execIsGranted_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AchievementId;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAchievement_execIsGranted_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execIsGranted_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAchievement.Grant
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAchievement_execGrant_Parms
{
	unsigned char                                      LocalUserNum;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AchievementId;                                    		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentAchievement_execGrant_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAchievement_execGrant_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAPI.Idle
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAPI_execIdle_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAPI_execIdle_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAPI_execIdle_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAPI.ResetLocale
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAPI_execResetLocale_Parms
{

	 UISFXOnlineComponentAPI_execResetLocale_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAPI_execResetLocale_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentAPI.GetCurrentTime
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentAPI_execGetCurrentTime_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentAPI_execGetCurrentTime_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentAPI_execGetCurrentTime_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.METR_UpdateDLCEntitlements
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execMETR_UpdateDLCEntitlements_Parms
{

	 UISFXOnlineComponentCommerce_execMETR_UpdateDLCEntitlements_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execMETR_UpdateDLCEntitlements_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.DecryptOfflineEntitlementInfo
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execDecryptOfflineEntitlementInfo_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentCommerce_execDecryptOfflineEntitlementInfo_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execDecryptOfflineEntitlementInfo_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.StoreOfflineEntitlementInfo
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execStoreOfflineEntitlementInfo_Parms
{
	union { FString                                    a_sEncryptedContent; };                           		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentCommerce_execStoreOfflineEntitlementInfo_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execStoreOfflineEntitlementInfo_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.DumpTestData
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execDumpTestData_Parms
{

	 UISFXOnlineComponentCommerce_execDumpTestData_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execDumpTestData_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.NucleusEntitlementsRefreshOffline
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execNucleusEntitlementsRefreshOffline_Parms
{

	 UISFXOnlineComponentCommerce_execNucleusEntitlementsRefreshOffline_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execNucleusEntitlementsRefreshOffline_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.LoadDimeConfig
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execLoadDimeConfig_Parms
{
	union { FString                                    sConfig; };                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentCommerce_execLoadDimeConfig_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execLoadDimeConfig_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnDimeConfigLoaded
// [0x00120000] 
struct UISFXOnlineComponentCommerce_execOnDimeConfigLoaded_Parms
{

	 UISFXOnlineComponentCommerce_execOnDimeConfigLoaded_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execOnDimeConfigLoaded_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.FetchOfferDetails
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execFetchOfferDetails_Parms
{
	union { TArray<struct FBWOfferId>                  aOffers; };                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentCommerce_execFetchOfferDetails_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execFetchOfferDetails_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnFetchOfferDetailsComplete
// [0x00120000] 
struct UISFXOnlineComponentCommerce_execOnFetchOfferDetailsComplete_Parms
{

	 UISFXOnlineComponentCommerce_execOnFetchOfferDetailsComplete_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execOnFetchOfferDetailsComplete_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.GetOffersList
// [0x00424800] ( FUNC_Event )
struct UISFXOnlineComponentCommerce_eventGetOffersList_Parms
{
	union { TArray<struct FBWOfferInfo>                aOffers; };                                       		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	union { TArray<struct FBWOfferId>                  aOfferFilter; };                                  		// 0x0010 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentCommerce_eventGetOffersList_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_eventGetOffersList_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.GetWalletBalance
// [0x00020000] 
struct UISFXOnlineComponentCommerce_execGetWalletBalance_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UISFXOnlineComponentCommerce_execGetWalletBalance_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execGetWalletBalance_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.Display1stPartyStore
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execDisplay1stPartyStore_Parms
{

	 UISFXOnlineComponentCommerce_execDisplay1stPartyStore_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execDisplay1stPartyStore_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.PurchaseOfferId
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execPurchaseOfferId_Parms
{
	union { struct FBWOfferId                          Id; };                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentCommerce_execPurchaseOfferId_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execPurchaseOfferId_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnPurchaseOfferIdResult
// [0x00120000] 
struct UISFXOnlineComponentCommerce_execOnPurchaseOfferIdResult_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentCommerce_execOnPurchaseOfferIdResult_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execOnPurchaseOfferIdResult_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnCodeRedeemed
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execOnCodeRedeemed_Parms
{
	unsigned char                                      nResult;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentCommerce_execOnCodeRedeemed_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execOnCodeRedeemed_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.SubmitRedeemCode
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execSubmitRedeemCode_Parms
{
	unsigned long                                      bContinue;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    strCode; };                                       		// 0x0004 (0x0010) [0x0000000000400082]              ( CPF_Const | CPF_Parm | CPF_NeedCtorLink )

	 UISFXOnlineComponentCommerce_execSubmitRedeemCode_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execSubmitRedeemCode_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.PromptRedeemCode
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execPromptRedeemCode_Parms
{

	 UISFXOnlineComponentCommerce_execPromptRedeemCode_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execPromptRedeemCode_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnPromptRedeemCodeResult
// [0x00120000] 
struct UISFXOnlineComponentCommerce_execOnPromptRedeemCodeResult_Parms
{
	int                                                nResult;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UISFXOnlineComponentCommerce_execOnPromptRedeemCodeResult_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execOnPromptRedeemCodeResult_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.ProcessAutoGrants
// [0x00020400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execProcessAutoGrants_Parms
{

	 UISFXOnlineComponentCommerce_execProcessAutoGrants_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execProcessAutoGrants_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnProcessAutoGrantsComplete
// [0x00120000] 
struct UISFXOnlineComponentCommerce_execOnProcessAutoGrantsComplete_Parms
{

	 UISFXOnlineComponentCommerce_execOnProcessAutoGrantsComplete_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execOnProcessAutoGrantsComplete_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.GrantEntitlementId
// [0x00024400] ( FUNC_Native )
struct UISFXOnlineComponentCommerce_execGrantEntitlementId_Parms
{
	union { struct FBWEntitlementId                    Id; };                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bUseNucleusCheck;                                 		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UISFXOnlineComponentCommerce_execGrantEntitlementId_Parms() { memset(this, 0, sizeof *this); }
	~UISFXOnlineComponentCommerce_execGrantEntitlementId_Parms() {}
};

// Function SFXOnlineFoundation.ISFXOnlineComponentCommerce.OnGrantEntitlementResult
// [0x00120000] 
struct UISFXOnlineComponentCommerce_execOnGrantEntitlementResult_Parms
{
