/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: Engine_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function Engine.Engine.BioShowDebugMessageBox
// [0x00020400] ( FUNC_Native )
struct UEngine_execBioShowDebugMessageBox_Parms
{
	union { FString                                    sMessage; };                                      		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )

	 UEngine_execBioShowDebugMessageBox_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execBioShowDebugMessageBox_Parms() {}
};

// Function Engine.Engine.AddOverlayWrapped
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execAddOverlayWrapped_Parms
{
	class UFont*                                       Font;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Text; };                                          		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              X;                                                		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleX;                                           		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleY;                                           		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              WrapWidth;                                        		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UEngine_execAddOverlayWrapped_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execAddOverlayWrapped_Parms() {}
};

// Function Engine.Engine.AddOverlay
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execAddOverlay_Parms
{
	class UFont*                                       Font;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Text; };                                          		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              X;                                                		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleX;                                           		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ScaleY;                                           		// 0x0024 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bIsCentered;                                      		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UEngine_execAddOverlay_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execAddOverlay_Parms() {}
};

// Function Engine.Engine.RemoveAllOverlays
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execRemoveAllOverlays_Parms
{

	 UEngine_execRemoveAllOverlays_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execRemoveAllOverlays_Parms() {}
};

// Function Engine.Engine.StopMovie
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execStopMovie_Parms
{
	unsigned long                                      bDelayStopUntilGameHasRendered;                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UEngine_execStopMovie_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execStopMovie_Parms() {}
};

// Function Engine.Engine.PlayLoadMapMovie
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execPlayLoadMapMovie_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execPlayLoadMapMovie_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execPlayLoadMapMovie_Parms() {}
};

// Function Engine.Engine.GetLastMovieName
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetLastMovieName_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UEngine_execGetLastMovieName_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetLastMovieName_Parms() {}
};

// Function Engine.Engine.GetAudioDevice
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetAudioDevice_Parms
{
	class UAudioDevice*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetAudioDevice_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetAudioDevice_Parms() {}
};

// Function Engine.Engine.IsSplitScreen
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execIsSplitScreen_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execIsSplitScreen_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execIsSplitScreen_Parms() {}
};

// Function Engine.Engine.GetAdditionalFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetAdditionalFont_Parms
{
	int                                                AdditionalFontIndex;                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UFont*                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetAdditionalFont_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetAdditionalFont_Parms() {}
};

// Function Engine.Engine.GetSubtitleFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetSubtitleFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetSubtitleFont_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetSubtitleFont_Parms() {}
};

// Function Engine.Engine.GetLargeFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetLargeFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetLargeFont_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetLargeFont_Parms() {}
};

// Function Engine.Engine.GetMediumFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetMediumFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetMediumFont_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetMediumFont_Parms() {}
};

// Function Engine.Engine.GetSmallFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetSmallFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetSmallFont_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetSmallFont_Parms() {}
};

// Function Engine.Engine.GetTinyFont
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetTinyFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetTinyFont_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetTinyFont_Parms() {}
};

// Function Engine.Engine.GetBuildDate
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetBuildDate_Parms
{
	union { FString                                    ReturnValue; };                                   		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 UEngine_execGetBuildDate_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetBuildDate_Parms() {}
};

// Function Engine.Engine.GetCurrentWorldInfo
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execGetCurrentWorldInfo_Parms
{
	class AWorldInfo*                                  ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execGetCurrentWorldInfo_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execGetCurrentWorldInfo_Parms() {}
};

// Function Engine.Engine.IsGame
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execIsGame_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execIsGame_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execIsGame_Parms() {}
};

// Function Engine.Engine.IsEditor
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UEngine_execIsEditor_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execIsEditor_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execIsEditor_Parms() {}
};

// Function Engine.Engine.IsShip
// [0x00022400] ( FUNC_Native )
struct UEngine_execIsShip_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UEngine_execIsShip_Parms() { memset(this, 0, sizeof *this); }
	~UEngine_execIsShip_Parms() {}
};

// Function Engine.GameEngine.GetOnlineSubsystem
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct UGameEngine_execGetOnlineSubsystem_Parms
{
	class UOnlineSubsystem*                            ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UGameEngine_execGetOnlineSubsystem_Parms() { memset(this, 0, sizeof *this); }
	~UGameEngine_execGetOnlineSubsystem_Parms() {}
};

// Function Engine.GameEngine.ShouldUseNonLatentOcclusion
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execShouldUseNonLatentOcclusion_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UGameEngine_execShouldUseNonLatentOcclusion_Parms() { memset(this, 0, sizeof *this); }
	~UGameEngine_execShouldUseNonLatentOcclusion_Parms() {}
};

// Function Engine.GameEngine.TriggerLargeOcclusionChange
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execTriggerLargeOcclusionChange_Parms
{

	 UGameEngine_execTriggerLargeOcclusionChange_Parms() { memset(this, 0, sizeof *this); }
	~UGameEngine_execTriggerLargeOcclusionChange_Parms() {}
};

// Function Engine.GameEngine.SkipFrames
// [0x00020400] ( FUNC_Native )
struct UGameEngine_execSkipFrames_Parms
{
	int                                                nFrames;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 UGameEngine_execSkipFrames_Parms() { memset(this, 0, sizeof *this); }
	~UGameEngine_execSkipFrames_Parms() {}
};

// Function Engine.GameEngine.DestroyNamedNetDriver
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGameEngine_execDestroyNamedNetDriver_Parms
{
	union { struct SFXName                             NetDriverName; };                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 UGameEngine_execDestroyNamedNetDriver_Parms() { memset(this, 0, sizeof *this); }
	~UGameEngine_execDestroyNamedNetDriver_Parms() {}
};

// Function Engine.GameEngine.CreateNamedNetDriver
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UGameEngine_execCreateNamedNetDriver_Parms
{
	union { struct SFXName                             NetDriverName; };                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 UGameEngine_execCreateNamedNetDriver_Parms() { memset(this, 0, sizeof *this); }
	~UGameEngine_execCreateNamedNetDriver_Parms() {}
};

// Function Engine.Actor.WillOverlap
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execWillOverlap_Parms
{
	union { struct FVector                             PosA; };                                          		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             VelA; };                                          		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             PosB; };                                          		// 0x0018 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             VelB; };                                          		// 0x0024 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              StepSize;                                         		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Radius;                                           		// 0x0034 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Time;                                             		// 0x0038 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x003C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execWillOverlap_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execWillOverlap_Parms() {}
};

// Function Engine.Actor.GetAvoidanceVector
// [0x00424401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetAvoidanceVector_Parms
{
	union { TArray<class AActor*>                      Obstacles; };                                     		// 0x0000 (0x0010) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	union { struct FVector                             GoalLocation; };                                  		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              CollisionRadius;                                  		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              MaxSpeed;                                         		// 0x0020 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                NumSamples;                                       		// 0x0024 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              VelocityStepRate;                                 		// 0x0028 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              MaxTimeTilOverlap;                                		// 0x002C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	union { struct FVector                             ReturnValue; };                                   		// 0x0030 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execGetAvoidanceVector_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetAvoidanceVector_Parms() {}
};

// Function Engine.Actor.IsClient
// [0x00020103] ( FUNC_Final | FUNC_Simulated )
struct AActor_execIsClient_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsClient_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsClient_Parms() {}
};

// Function Engine.Actor.IsServer
// [0x00020103] ( FUNC_Final | FUNC_Simulated )
struct AActor_execIsServer_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsServer_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsServer_Parms() {}
};

// Function Engine.Actor.IsOwningClient
// [0x00020102] ( FUNC_Simulated )
struct AActor_execIsOwningClient_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsOwningClient_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsOwningClient_Parms() {}
};

// Function Engine.Actor.ReplicationEnded
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventReplicationEnded_Parms
{

	 AActor_eventReplicationEnded_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventReplicationEnded_Parms() {}
};

// Function Engine.Actor.PostDemoRewind
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventPostDemoRewind_Parms
{

	 AActor_eventPostDemoRewind_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventPostDemoRewind_Parms() {}
};

// Function Engine.Actor.AnimTreeUpdated
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventAnimTreeUpdated_Parms
{
	class USkeletalMeshComponent*                      SkelMesh;                                         		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )

	 AActor_eventAnimTreeUpdated_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventAnimTreeUpdated_Parms() {}
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct AActor_execSupportsKismetModification_Parms
{
	class USequenceOp*                                 AskingOp;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    Reason; };                                        		// 0x0008 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execSupportsKismetModification_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execSupportsKismetModification_Parms() {}
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyEnd_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )

	 AActor_eventTrailsNotifyEnd_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventTrailsNotifyEnd_Parms() {}
};

// Function Engine.Actor.TrailsNotifyTick
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotifyTick_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )

	 AActor_eventTrailsNotifyTick_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventTrailsNotifyTick_Parms() {}
};

// Function Engine.Actor.TrailsNotify
// [0x00020800] ( FUNC_Event )
struct AActor_eventTrailsNotify_Parms
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )

	 AActor_eventTrailsNotify_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventTrailsNotify_Parms() {}
};

// Function Engine.Actor.PlayParticleEffect
// [0x00020800] ( FUNC_Event )
struct AActor_eventPlayParticleEffect_Parms
{
	class UAnimNotify_PlayParticleEffect*              AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )

	 AActor_eventPlayParticleEffect_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventPlayParticleEffect_Parms() {}
};

// Function Engine.Actor.GetAimAdhesionExtent
// [0x00420102] ( FUNC_Simulated )
struct AActor_execGetAimAdhesionExtent_Parms
{
	float                                              Width;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Height;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { struct FVector                             Center; };                                        		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 AActor_execGetAimAdhesionExtent_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetAimAdhesionExtent_Parms() {}
};

// Function Engine.Actor.GetAimFrictionExtent
// [0x00420102] ( FUNC_Simulated )
struct AActor_execGetAimFrictionExtent_Parms
{
	float                                              Width;                                            		// 0x0000 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	float                                              Height;                                           		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { struct FVector                             Center; };                                        		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 AActor_execGetAimFrictionExtent_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetAimFrictionExtent_Parms() {}
};

// Function Engine.Actor.IsInLevel
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execIsInLevel_Parms
{
	class ULevel*                                      TestLevel;                                        		// 0x0000 (0x0008) [0x0000000000000082]              ( CPF_Const | CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsInLevel_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsInLevel_Parms() {}
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execIsInPersistentLevel_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsInPersistentLevel_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsInPersistentLevel_Parms() {}
};

// Function Engine.Actor.SetActive
// [0x00020400] ( FUNC_Native )
struct AActor_execSetActive_Parms
{
	unsigned long                                      bActive;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execSetActive_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execSetActive_Parms() {}
};

// Function Engine.Actor.GetModule
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetModule_Parms
{
	class UClass*                                      ModuleClass;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class USFXModule*                                  ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm )

	 AActor_execGetModule_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetModule_Parms() {}
};

// Function Engine.Actor.ExceededPhysicsThreshold
// [0x00020800] ( FUNC_Event )
struct AActor_eventExceededPhysicsThreshold_Parms
{
	class AActor*                                      InstigatedBy;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventExceededPhysicsThreshold_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventExceededPhysicsThreshold_Parms() {}
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventOnRigidBodySpringOverextension_Parms
{
	class URB_BodyInstance*                            BodyInstance;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventOnRigidBodySpringOverextension_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventOnRigidBodySpringOverextension_Parms() {}
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AActor_execGetPackageGuid_Parms
{
	union { struct SFXName                             PackageName; };                                   		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FGuid                               ReturnValue; };                                   		// 0x0008 (0x0010) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execGetPackageGuid_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetPackageGuid_Parms() {}
};

// Function Engine.Actor.PostInitAnimTree
// [0x00020800] ( FUNC_Event )
struct AActor_eventPostInitAnimTree_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )

	 AActor_eventPostInitAnimTree_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventPostInitAnimTree_Parms() {}
};

// Function Engine.Actor.RootMotionExtracted
// [0x00420900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventRootMotionExtracted_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	union { struct FBoneAtom                           ExtractedRootMotionDelta; };                      		// 0x0010 (0x0020) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 AActor_eventRootMotionExtracted_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventRootMotionExtracted_Parms() {}
};

// Function Engine.Actor.RootMotionModeChanged
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventRootMotionModeChanged_Parms
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )

	 AActor_eventRootMotionModeChanged_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventRootMotionModeChanged_Parms() {}
};

// Function Engine.Actor.PostRenderFor
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventPostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             CameraPosition; };                                		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             CameraDir; };                                     		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventPostRenderFor_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventPostRenderFor_Parms() {}
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500] ( FUNC_Simulated | FUNC_Native )
struct AActor_execNativePostRenderFor_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UCanvas*                                     Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             CameraPosition; };                                		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             CameraDir; };                                     		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execNativePostRenderFor_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execNativePostRenderFor_Parms() {}
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500] ( FUNC_Simulated | FUNC_Native )
struct AActor_execSetHUDLocation_Parms
{
	union { struct FVector                             NewHUDLocation; };                                		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execSetHUDLocation_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execSetHUDLocation_Parms() {}
};

// Function Engine.Actor.OnRanOver
// [0x00020800] ( FUNC_Event )
struct AActor_eventOnRanOver_Parms
{
	class ASVehicle*                                   Vehicle;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UPrimitiveComponent*                         RunOverComponent;                                 		// 0x0008 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	int                                                WheelIndex;                                       		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventOnRanOver_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventOnRanOver_Parms() {}
};

// Function Engine.Actor.RigidBodyCollision
// [0x00420800] ( FUNC_Event )
struct AActor_eventRigidBodyCollision_Parms
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0008 (0x0008) [0x0000000004000080]              ( CPF_Parm | CPF_EditInline )
	union { struct FCollisionImpactData                RigidCollisionData; };                            		// 0x0010 (0x0028) [0x0000000000400182]              ( CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ContactIndex;                                     		// 0x0038 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventRigidBodyCollision_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventRigidBodyCollision_Parms() {}
};

// Function Engine.Actor.InterpolationChanged
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventInterpolationChanged_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventInterpolationChanged_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventInterpolationChanged_Parms() {}
};

// Function Engine.Actor.InterpolationFinished
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventInterpolationFinished_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventInterpolationFinished_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventInterpolationFinished_Parms() {}
};

// Function Engine.Actor.InterpolationStarted
// [0x00020900] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventInterpolationStarted_Parms
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UInterpGroupInst*                            GroupInst;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventInterpolationStarted_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventInterpolationStarted_Parms() {}
};

// Function Engine.Actor.PickedUpBy
// [0x00020000] 
struct AActor_execPickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execPickedUpBy_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execPickedUpBy_Parms() {}
};

// Function Engine.Actor.SpawnedByKismet
// [0x00020800] ( FUNC_Event )
struct AActor_eventSpawnedByKismet_Parms
{

	 AActor_eventSpawnedByKismet_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventSpawnedByKismet_Parms() {}
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500] ( FUNC_Simulated | FUNC_Native )
struct AActor_execGetTargetLocation_Parms
{
	class AActor*                                      RequestedBy;                                      		// 0x0000 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bRequestAlternateLoc;                             		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	union { struct FVector                             ReturnValue; };                                   		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execGetTargetLocation_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetTargetLocation_Parms() {}
};

// Function Engine.Actor.FindGoodEndView
// [0x00420102] ( FUNC_Simulated )
struct AActor_execFindGoodEndView_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { struct FRotator                            GoodRotation; };                                  		// 0x0008 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 AActor_execFindGoodEndView_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execFindGoodEndView_Parms() {}
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// [0x00020100] ( FUNC_Simulated )
struct AActor_execNotifyLocalPlayerTeamReceived_Parms
{

	 AActor_execNotifyLocalPlayerTeamReceived_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execNotifyLocalPlayerTeamReceived_Parms() {}
};

// Function Engine.Actor.GetLocationStringFor
// [0x00020102] ( FUNC_Simulated )
struct AActor_execGetLocationStringFor_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    ReturnValue; };                                   		// 0x0008 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )

	 AActor_execGetLocationStringFor_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetLocationStringFor_Parms() {}
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x00020902] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventScriptGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_eventScriptGetTeamNum_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventScriptGetTeamNum_Parms() {}
};

// Function Engine.Actor.GetTeamNum
// [0x00020500] ( FUNC_Simulated | FUNC_Native )
struct AActor_execGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execGetTeamNum_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execGetTeamNum_Parms() {}
};

// Function Engine.Actor.PawnBaseDied
// [0x00020000] 
struct AActor_execPawnBaseDied_Parms
{

	 AActor_execPawnBaseDied_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execPawnBaseDied_Parms() {}
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500] ( FUNC_Simulated | FUNC_Native )
struct AActor_execIsPlayerOwned_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsPlayerOwned_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsPlayerOwned_Parms() {}
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420902] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventGetActorEyesViewPoint_Parms
{
	union { struct FVector                             out_Location; };                                  		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	union { struct FRotator                            out_Rotation; };                                  		// 0x000C (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )

	 AActor_eventGetActorEyesViewPoint_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventGetActorEyesViewPoint_Parms() {}
};

// Function Engine.Actor.IsStationary
// [0x00020002] 
struct AActor_execIsStationary_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsStationary_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsStationary_Parms() {}
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x00020800] ( FUNC_Event )
struct AActor_eventGetActorFaceFXAsset_Parms
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_eventGetActorFaceFXAsset_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventGetActorFaceFXAsset_Parms() {}
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x00020102] ( FUNC_Simulated )
struct AActor_execCanActorPlayFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execCanActorPlayFaceFXAnim_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execCanActorPlayFaceFXAnim_Parms() {}
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x00020102] ( FUNC_Simulated )
struct AActor_execIsActorPlayingFaceFXAnim_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_execIsActorPlayingFaceFXAnim_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execIsActorPlayingFaceFXAnim_Parms() {}
};

// Function Engine.Actor.SetSkelControlScale
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetSkelControlScale_Parms
{
	union { struct SFXName                             SkelControlName; };                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Scale;                                            		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventSetSkelControlScale_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventSetSkelControlScale_Parms() {}
};

// Function Engine.Actor.SetMorphWeight
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetMorphWeight_Parms
{
	union { struct SFXName                             MorphNodeName; };                                 		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              MorphWeight;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventSetMorphWeight_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventSetMorphWeight_Parms() {}
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventStopActorFaceFXAnim_Parms
{

	 AActor_eventStopActorFaceFXAnim_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventStopActorFaceFXAnim_Parms() {}
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x00020800] ( FUNC_Event )
struct AActor_eventPlayActorFaceFXAnim_Parms
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	union { FString                                    GroupName; };                                     		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	union { FString                                    SeqName; };                                       		// 0x0018 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class USoundCue*                                   SoundCueToPlay;                                   		// 0x0028 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )

	 AActor_eventPlayActorFaceFXAnim_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventPlayActorFaceFXAnim_Parms() {}
};

// Function Engine.Actor.FinishAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventFinishAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventFinishAnimControl_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventFinishAnimControl_Parms() {}
};

// Function Engine.Actor.SetAnimPosition
// [0x00020800] ( FUNC_Event )
struct AActor_eventSetAnimPosition_Parms
{
	union { struct SFXName                             SlotName; };                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ChannelIndex;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             InAnimSeqName; };                                 		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              InPosition;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bFireNotifies;                                    		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bLooping;                                         		// 0x001C (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventSetAnimPosition_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventSetAnimPosition_Parms() {}
};

// Function Engine.Actor.BeginAnimControl
// [0x00020800] ( FUNC_Event )
struct AActor_eventBeginAnimControl_Parms
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventBeginAnimControl_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventBeginAnimControl_Parms() {}
};

// Function Engine.Actor.OnAnimPlay
// [0x00020802] ( FUNC_Event )
struct AActor_eventOnAnimPlay_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventOnAnimPlay_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventOnAnimPlay_Parms() {}
};

// Function Engine.Actor.OnAnimEnd
// [0x00020802] ( FUNC_Event )
struct AActor_eventOnAnimEnd_Parms
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_eventOnAnimEnd_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventOnAnimEnd_Parms() {}
};

// Function Engine.Actor.DoKismetAttachment
// [0x00820002] 
struct AActor_execDoKismetAttachment_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// unsigned long                                   bOldCollideActors;                                		// 0x0010 (0x0004) [0x0000000000000000]              
	// unsigned long                                   bOldBlockActors;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	// union { struct FVector                          X; };                                             		// 0x0018 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          Y; };                                             		// 0x0024 (0x000C) [0x0000000000000000]              
	// union { struct FVector                          Z; };                                             		// 0x0030 (0x000C) [0x0000000000000000]              

	 AActor_execDoKismetAttachment_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execDoKismetAttachment_Parms() {}
};

// Function Engine.Actor.OnAttachToActor
// [0x00020002] 
struct AActor_execOnAttachToActor_Parms
{
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Idx;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
	// class AActor*                                   Attachment;                                       		// 0x000C (0x0008) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x0014 (0x0008) [0x0000000000000000]              
	// union { TArray<class UObject*>                  objVars; };                                       		// 0x001C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

	 AActor_execOnAttachToActor_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnAttachToActor_Parms() {}
};

// Function Engine.Actor.BioEnqueueDoKismetAttachment
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execBioEnqueueDoKismetAttachment_Parms
{
	class AActor*                                      InAttachment;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInDetach;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInHardAttach;                                    		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             InBoneName; };                                    		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeOffset;                             		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             InRelativeOffset; };                              		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeRotation;                           		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FRotator                            InRelativeRotation; };                            		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execBioEnqueueDoKismetAttachment_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execBioEnqueueDoKismetAttachment_Parms() {}
};

// Function Engine.Actor.BioDoKismetAttachment
// [0x00020802] ( FUNC_Event )
struct AActor_eventBioDoKismetAttachment_Parms
{
	class AActor*                                      InAttachment;                                     		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInDetach;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInHardAttach;                                    		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct SFXName                             InBoneName; };                                    		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeOffset;                             		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FVector                             InRelativeOffset; };                              		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bInUseRelativeRotation;                           		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	union { struct FRotator                            InRelativeRotation; };                            		// 0x002C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// class USeqAct_AttachToActor*                    Seq;                                              		// 0x0038 (0x0008) [0x0000000000000000]              

	 AActor_eventBioDoKismetAttachment_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventBioDoKismetAttachment_Parms() {}
};

// Function Engine.Actor.OnToggleHidden
// [0x00020102] ( FUNC_Simulated )
struct AActor_execOnToggleHidden_Parms
{
	class USeqAct_ToggleHidden*                        Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             AttachIdx;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             IgnoreIdx;                                        		// 0x000C (0x0004) [0x0000000000000000]              
	// class AActor*                                   A;                                                		// 0x0010 (0x0008) [0x0000000000000000]              

	 AActor_execOnToggleHidden_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnToggleHidden_Parms() {}
};

// Function Engine.Actor.OnChangeCollision
// [0x00020002] 
struct AActor_execOnChangeCollision_Parms
{
	class USeqAct_ChangeCollision*                     Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execOnChangeCollision_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnChangeCollision_Parms() {}
};

// Function Engine.Actor.OnSetPhysics
// [0x00020102] ( FUNC_Simulated )
struct AActor_execOnSetPhysics_Parms
{
	class USeqAct_SetPhysics*                          Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execOnSetPhysics_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnSetPhysics_Parms() {}
};

// Function Engine.Actor.OnSetBlockRigidBody
// [0x00020102] ( FUNC_Simulated )
struct AActor_execOnSetBlockRigidBody_Parms
{
	class USeqAct_SetBlockRigidBody*                   Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execOnSetBlockRigidBody_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnSetBlockRigidBody_Parms() {}
};

// Function Engine.Actor.OnSetVelocity
// [0x00820102] ( FUNC_Simulated )
struct AActor_execOnSetVelocity_Parms
{
	class USeqAct_SetVelocity*                         Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// union { struct FVector                          V; };                                             		// 0x0008 (0x000C) [0x0000000000000000]              
	// float                                           Mag;                                              		// 0x0014 (0x0004) [0x0000000000000000]              

	 AActor_execOnSetVelocity_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnSetVelocity_Parms() {}
};

// Function Engine.Actor.OnTeleport
// [0x00020102] ( FUNC_Simulated )
struct AActor_execOnTeleport_Parms
{
	class USeqAct_Teleport*                            Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// union { TArray<class UObject*>                  objVars; };                                       		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             Idx;                                              		// 0x0018 (0x0004) [0x0000000000000000]              
	// class AActor*                                   destActor;                                        		// 0x001C (0x0008) [0x0000000000000000]              
	// class AController*                              C;                                                		// 0x0024 (0x0008) [0x0000000000000000]              

	 AActor_execOnTeleport_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnTeleport_Parms() {}
};

// Function Engine.Actor.OnModifyHealth
// [0x00020102] ( FUNC_Simulated )
struct AActor_execOnModifyHealth_Parms
{
	class USeqAct_ModifyHealth*                        Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class AController*                              InstigatorController;                             		// 0x0008 (0x0008) [0x0000000000000000]              
	// class APawn*                                    InstigatorPawn;                                   		// 0x0010 (0x0008) [0x0000000000000000]              

	 AActor_execOnModifyHealth_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execOnModifyHealth_Parms() {}
};

// Function Engine.Actor.PrestreamTextures
// [0x00024400] ( FUNC_Native )
struct AActor_execPrestreamTextures_Parms
{
	float                                              Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bEnableStreaming;                                 		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                CinematicTextureGroups;                           		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )

	 AActor_execPrestreamTextures_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execPrestreamTextures_Parms() {}
};

// Function Engine.Actor.ShutDown
// [0x00020902] ( FUNC_Simulated | FUNC_Event )
struct AActor_eventShutDown_Parms
{

	 AActor_eventShutDown_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventShutDown_Parms() {}
};

// Function Engine.Actor.SetNetUpdateTime
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct AActor_execSetNetUpdateTime_Parms
{
	float                                              NewUpdateTime;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )

	 AActor_execSetNetUpdateTime_Parms() { memset(this, 0, sizeof *this); }
	~AActor_execSetNetUpdateTime_Parms() {}
};

// Function Engine.Actor.ForceNetRelevant
// [0x00020802] ( FUNC_Event )
struct AActor_eventForceNetRelevant_Parms
{

	 AActor_eventForceNetRelevant_Parms() { memset(this, 0, sizeof *this); }
	~AActor_eventForceNetRelevant_Parms() {}
};

// Function Engine.Actor.OnDestroy
// [0x00020102] ( FUNC_Simulated )
struct AActor_execOnDestroy_Parms
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
