/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: PlotManagerDLC_DHME1_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2039
// [0x00020002] 
struct UBioAutoConditionals_execF2039_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2039_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2039_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2038
// [0x00020002] 
struct UBioAutoConditionals_execF2038_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2038_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2038_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2025
// [0x00020002] 
struct UBioAutoConditionals_execF2025_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2025_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2025_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2024
// [0x00020002] 
struct UBioAutoConditionals_execF2024_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2024_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2024_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2023
// [0x00020002] 
struct UBioAutoConditionals_execF2023_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2023_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2023_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2022
// [0x00020002] 
struct UBioAutoConditionals_execF2022_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2022_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2022_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2021
// [0x00020002] 
struct UBioAutoConditionals_execF2021_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2021_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2021_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2020
// [0x00020002] 
struct UBioAutoConditionals_execF2020_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2020_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2020_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2019
// [0x00020002] 
struct UBioAutoConditionals_execF2019_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2019_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2019_Parms() {}
};

// Function PlotManagerDLC_DHME1.BioAutoConditionals.F2018
// [0x00020002] 
struct UBioAutoConditionals_execF2018_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2018_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2018_Parms() {}
};



#undef LESDK_IN_GENERATED

#ifdef _MSC_VER
	#pragma pack ( pop )
#endif
