/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: PlotManagerDLC_EXP_Part02_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2032
// [0x00020002] 
struct UBioAutoConditionals_execF2032_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2032_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2032_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2031
// [0x00020002] 
struct UBioAutoConditionals_execF2031_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2031_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2031_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2037
// [0x00020002] 
struct UBioAutoConditionals_execF2037_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2037_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2037_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2036
// [0x00020002] 
struct UBioAutoConditionals_execF2036_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2036_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2036_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2027
// [0x00020002] 
struct UBioAutoConditionals_execF2027_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2027_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2027_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2026
// [0x00020002] 
struct UBioAutoConditionals_execF2026_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2026_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2026_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2002
// [0x00020002] 
struct UBioAutoConditionals_execF2002_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2002_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2002_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1999
// [0x00020002] 
struct UBioAutoConditionals_execF1999_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1999_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1999_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2001
// [0x00020002] 
struct UBioAutoConditionals_execF2001_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2001_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2001_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2000
// [0x00020002] 
struct UBioAutoConditionals_execF2000_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2000_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2000_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2003
// [0x00020002] 
struct UBioAutoConditionals_execF2003_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2003_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2003_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2005
// [0x00020002] 
struct UBioAutoConditionals_execF2005_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2005_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2005_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2004
// [0x00020002] 
struct UBioAutoConditionals_execF2004_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2004_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2004_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1991
// [0x00020002] 
struct UBioAutoConditionals_execF1991_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1991_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1991_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1990
// [0x00020002] 
struct UBioAutoConditionals_execF1990_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1990_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1990_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1989
// [0x00020002] 
struct UBioAutoConditionals_execF1989_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1989_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1989_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1996
// [0x00020002] 
struct UBioAutoConditionals_execF1996_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1996_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1996_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1986
// [0x00020002] 
struct UBioAutoConditionals_execF1986_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1986_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1986_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1985
// [0x00020002] 
struct UBioAutoConditionals_execF1985_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1985_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1985_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1983
// [0x00020002] 
struct UBioAutoConditionals_execF1983_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1983_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1983_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1982
// [0x00020002] 
struct UBioAutoConditionals_execF1982_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1982_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1982_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1981
// [0x00020002] 
struct UBioAutoConditionals_execF1981_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1981_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1981_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1980
// [0x00020002] 
struct UBioAutoConditionals_execF1980_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1980_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1980_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1979
// [0x00020002] 
struct UBioAutoConditionals_execF1979_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1979_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1979_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1978
// [0x00020002] 
struct UBioAutoConditionals_execF1978_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1978_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1978_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1977
// [0x00020002] 
struct UBioAutoConditionals_execF1977_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1977_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1977_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1969
// [0x00020002] 
struct UBioAutoConditionals_execF1969_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1969_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1969_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1968
// [0x00020002] 
struct UBioAutoConditionals_execF1968_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1968_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1968_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1967
// [0x00020002] 
struct UBioAutoConditionals_execF1967_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1967_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1967_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1966
// [0x00020002] 
struct UBioAutoConditionals_execF1966_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1966_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1966_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1964
// [0x00020002] 
struct UBioAutoConditionals_execF1964_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1964_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1964_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1963
// [0x00020002] 
struct UBioAutoConditionals_execF1963_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1963_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1963_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1962
// [0x00020002] 
struct UBioAutoConditionals_execF1962_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1962_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1962_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1961
// [0x00020002] 
struct UBioAutoConditionals_execF1961_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1961_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1961_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F1960
// [0x00020002] 
struct UBioAutoConditionals_execF1960_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1960_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1960_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2030
// [0x00020002] 
struct UBioAutoConditionals_execF2030_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2030_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2030_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2008
// [0x00020002] 
struct UBioAutoConditionals_execF2008_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2008_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2008_Parms() {}
};

// Function PlotManagerDLC_EXP_Part02.BioAutoConditionals.F2007
// [0x00020002] 
struct UBioAutoConditionals_execF2007_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF2007_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF2007_Parms() {}
};



#undef LESDK_IN_GENERATED

#ifdef _MSC_VER
	#pragma pack ( pop )
#endif
