/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: PlotManagerDLC_HEN_VT_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1666
// [0x00020002] 
struct UBioAutoConditionals_execF1666_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1666_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1666_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1665
// [0x00020002] 
struct UBioAutoConditionals_execF1665_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1665_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1665_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1656
// [0x00020002] 
struct UBioAutoConditionals_execF1656_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1656_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1656_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1655
// [0x00020002] 
struct UBioAutoConditionals_execF1655_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1655_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1655_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1650
// [0x00020002] 
struct UBioAutoConditionals_execF1650_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1650_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1650_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1649
// [0x00020002] 
struct UBioAutoConditionals_execF1649_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1649_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1649_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1648
// [0x00020002] 
struct UBioAutoConditionals_execF1648_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1648_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1648_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1647
// [0x00020002] 
struct UBioAutoConditionals_execF1647_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1647_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1647_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1646
// [0x00020002] 
struct UBioAutoConditionals_execF1646_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1646_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1646_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1645
// [0x00020002] 
struct UBioAutoConditionals_execF1645_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1645_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1645_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1644
// [0x00020002] 
struct UBioAutoConditionals_execF1644_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1644_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1644_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1643
// [0x00020002] 
struct UBioAutoConditionals_execF1643_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1643_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1643_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1654
// [0x00020002] 
struct UBioAutoConditionals_execF1654_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1654_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1654_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1653
// [0x00020002] 
struct UBioAutoConditionals_execF1653_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1653_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1653_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1652
// [0x00020002] 
struct UBioAutoConditionals_execF1652_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1652_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1652_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1651
// [0x00020002] 
struct UBioAutoConditionals_execF1651_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1651_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1651_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1639
// [0x00020002] 
struct UBioAutoConditionals_execF1639_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1639_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1639_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1492
// [0x00020002] 
struct UBioAutoConditionals_execF1492_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1492_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1492_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1690
// [0x00020002] 
struct UBioAutoConditionals_execF1690_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1690_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1690_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1616
// [0x00020002] 
struct UBioAutoConditionals_execF1616_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1616_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1616_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1578
// [0x00020002] 
struct UBioAutoConditionals_execF1578_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1578_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1578_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1575
// [0x00020002] 
struct UBioAutoConditionals_execF1575_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1575_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1575_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1554
// [0x00020002] 
struct UBioAutoConditionals_execF1554_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1554_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1554_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1676
// [0x00020002] 
struct UBioAutoConditionals_execF1676_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1676_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1676_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1640
// [0x00020002] 
struct UBioAutoConditionals_execF1640_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1640_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1640_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1552
// [0x00020002] 
struct UBioAutoConditionals_execF1552_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1552_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1552_Parms() {}
};

// Function PlotManagerDLC_HEN_VT.BioAutoConditionals.F1494
// [0x00020002] 
struct UBioAutoConditionals_execF1494_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1494_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1494_Parms() {}
};



#undef LESDK_IN_GENERATED

#ifdef _MSC_VER
	#pragma pack ( pop )
#endif
