/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: PlotManagerDLC_UNC_Moment01_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1711
// [0x00020002] 
struct UBioAutoConditionals_execF1711_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1711_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1711_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1689
// [0x00020002] 
struct UBioAutoConditionals_execF1689_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1689_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1689_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1688
// [0x00020002] 
struct UBioAutoConditionals_execF1688_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1688_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1688_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1669
// [0x00020002] 
struct UBioAutoConditionals_execF1669_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1669_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1669_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1668
// [0x00020002] 
struct UBioAutoConditionals_execF1668_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1668_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1668_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1667
// [0x00020002] 
struct UBioAutoConditionals_execF1667_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1667_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1667_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1622
// [0x00020002] 
struct UBioAutoConditionals_execF1622_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1622_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1622_Parms() {}
};

// Function PlotManagerDLC_UNC_Moment01.BioAutoConditionals.F1621
// [0x00020002] 
struct UBioAutoConditionals_execF1621_Parms
{
	class ABioWorldInfo*                               bioWorld;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                Argument;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UBioGlobalVariableTable*                  gv;                                               		// 0x0010 (0x0008) [0x0000000000000000]              

	 UBioAutoConditionals_execF1621_Parms() { memset(this, 0, sizeof *this); }
	~UBioAutoConditionals_execF1621_Parms() {}
};



#undef LESDK_IN_GENERATED

#ifdef _MSC_VER
	#pragma pack ( pop )
#endif
