/*
#############################################################################################
# Mass Effect 2 (Legendary Edition) (2.0.0.48602) SDK
# Generated with TheFeckless UE3 SDK Generator v1.5_Beta-Rev.60-MELE
# ========================================================================================= #
# File: SFXGameContent_Powers_f_structs.hpp
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, SirCxyrtyx
# Thanks: HOOAH07, lowHertz
#############################################################################################
*/


#pragma once


#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif
#define LESDK_IN_GENERATED


/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.RemovePowerBonusEffect
// [0x00020002] 
struct USFXPowerScript_PassivePower_execRemovePowerBonusEffect_Parms
{
	class AActor*                                      oTarget;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      ClassName;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct SFXName                                     nmCategory;                                       		// 0x0010 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      PowerClass;                                       		// 0x0018 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0020 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect_PowerBonus*                Effect;                                           		// 0x0028 (0x0008) [0x0000000000000000]              
	// int                                             nIndex;                                           		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyPowerBonusEffect
// [0x00020002] 
struct USFXPowerScript_PassivePower_execApplyPowerBonusEffect_Parms
{
	class AActor*                                      oTarget;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      ClassName;                                        		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fEffectValue;                                     		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct SFXName                                     nmCategory;                                       		// 0x0014 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      PowerClass;                                       		// 0x001C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0024 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect_PowerBonus*                Effect;                                           		// 0x002C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyHealthModifier
// [0x00024002] 
struct USFXPowerScript_PassivePower_execApplyHealthModifier_Parms
{
	float                                              fHealthModifier;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyWeaponDamageModifier
// [0x00024002] 
struct USFXPowerScript_PassivePower_execApplyWeaponDamageModifier_Parms
{
	float                                              fDamageModifier;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyPowerCooldownModifier
// [0x00024002] 
struct USFXPowerScript_PassivePower_execApplyPowerCooldownModifier_Parms
{
	float                                              fCooldownModifier;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0004 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyPassiveBonus
// [0x00024002] 
struct USFXPowerScript_PassivePower_execApplyPassiveBonus_Parms
{
	class UClass*                                      EffectClass;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fModifier;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x000C (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.ApplyGlobalBonus
// [0x00020000] 
struct USFXPowerScript_PassivePower_execApplyGlobalBonus_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.OnSquadMemberAdded
// [0x00020002] 
struct USFXPowerScript_PassivePower_execOnSquadMemberAdded_Parms
{
	class APawn*                                       Pawn;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.OnPowersLoaded
// [0x00020002] 
struct USFXPowerScript_PassivePower_execOnPowersLoaded_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.OnPowerRankIncreased
// [0x00020002] 
struct USFXPowerScript_PassivePower_execOnPowerRankIncreased_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_PassivePower.InitializePowerScript
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_PassivePower_eventInitializePowerScript_Parms
{
};

// Function SFXGameContent_Powers.SFXPowerScript_HenchmanPassive.ApplyGlobalBonus
// [0x00020002] 
struct USFXPowerScript_HenchmanPassive_execApplyGlobalBonus_Parms
{
	// float                                           fHealthIncrease;                                  		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           fWeaponDamageIncrease;                            		// 0x0004 (0x0004) [0x0000000000000000]              
	// class USFXPower_HenchmanPassive*                oPassivePower;                                    		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_TaliPassive.ApplyGlobalBonus
// [0x00020002] 
struct USFXPowerScript_TaliPassive_execApplyGlobalBonus_Parms
{
	// class USFXPower_TaliPassive*                    oPassivePower;                                    		// 0x0000 (0x0008) [0x0000000000000000]              
	// float                                           DurationBonus;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneDeath.OnImpact
// [0x00820802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneDeath_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFXGame*                                 oGame;                                            		// 0x001C (0x0008) [0x0000000000000000]              
	// class ASFXObjectPool*                           oPool;                                            		// 0x0024 (0x0008) [0x0000000000000000]              
	// struct FVector                                  DirectionToSprayParticles;                        		// 0x002C (0x000C) [0x0000000000000000]              
	// class AEmitter*                                 oEmitter;                                         		// 0x0038 (0x0008) [0x0000000000000000]              
	// class ASFXPawn_EngineerCombatDrone*             CombatDrone;                                      		// 0x0040 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneDeath.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneDeath_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack.ShouldUsePower
// [0x00420002] 
struct USFXPowerScript_CombatDroneAttack_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class FString                                      sOptionalInfo;                                    		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack.OnImpact
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneAttack_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x001C (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0024 (0x0008) [0x0000000000000000]              
	// class ABioWorldInfo*                            pWorldInfo;                                       		// 0x002C (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     pController;                                      		// 0x0034 (0x0008) [0x0000000000000000]              
	// class ASFXAI_Core*                              oController;                                      		// 0x003C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPowerScript_CombatDroneAttack.StartPhase
// [0x00020802] ( FUNC_Event )
struct USFXPowerScript_CombatDroneAttack_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPawn_EngineerTechDrone.SpawnDeathVFX
// [0x00020002] 
struct ASFXPawn_EngineerTechDrone_execSpawnDeathVFX_Parms
{
	// class ASFXGame*                                 oGame;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ASFXObjectPool*                           oPool;                                            		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ASFXEmitter*                              oEmitter;                                         		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPawn_EngineerTechDrone.Died
// [0x00020802] ( FUNC_Event )
struct ASFXPawn_EngineerTechDrone_eventDied_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 HitPawn;                                          		// 0x0020 (0x0008) [0x0000000000000000]              
	// class USFXPower_CombatDrone_Tech*               TechDronePower;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
	// unsigned long                                   bResult;                                          		// 0x0030 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioShieldJackScript.ShouldUsePower
// [0x00420002] 
struct UBioShieldJackScript_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class FString                                      sOptionalInfo;                                    		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioShieldJackScript.GetCurrentEnergyShields
// [0x00020002] 
struct UBioShieldJackScript_execGetCurrentEnergyShields_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           fEnergyShieldsLeft;                               		// 0x000C (0x0004) [0x0000000000000000]              
	// class ASFXShield_Energy*                        EnergyShield;                                     		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioShieldJackScript.SpawnImpactVFX
// [0x00020002] 
struct UBioShieldJackScript_execSpawnImpactVFX_Parms
{
	struct FVector                                     Location;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UParticleSystem*                             PS;                                               		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class ASFXGame*                                 oGame;                                            		// 0x0014 (0x0008) [0x0000000000000000]              
	// class ASFXObjectPool*                           oPool;                                            		// 0x001C (0x0008) [0x0000000000000000]              
	// class ASFXEmitter*                              oEmitter;                                         		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioShieldJackScript.OnImpact
// [0x00020802] ( FUNC_Event )
struct UBioShieldJackScript_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oTargetPawn;                                      		// 0x001C (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0024 (0x0008) [0x0000000000000000]              
	// class ASFXShield_Base*                          MyShields;                                        		// 0x002C (0x0008) [0x0000000000000000]              
	// float                                           fEnergyShields;                                   		// 0x0034 (0x0004) [0x0000000000000000]              
	// float                                           fPowerDamage;                                     		// 0x0038 (0x0004) [0x0000000000000000]              
	// float                                           fMachineHealth;                                   		// 0x003C (0x0004) [0x0000000000000000]              
	// float                                           fStealAmount;                                     		// 0x0040 (0x0004) [0x0000000000000000]              
	// class UClass*                                   DamageClass;                                      		// 0x0044 (0x0008) [0x0000000000000000]              
	// class ABioVisualEffect*                         oVisualEffect;                                    		// 0x004C (0x0008) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             CasterManager;                                    		// 0x0054 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioShieldJackScript.StartPhase
// [0x00020802] ( FUNC_Event )
struct UBioShieldJackScript_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXGameEffect_HenchmenIgnorePawn.OnRemoved
// [0x00020002] 
struct USFXGameEffect_HenchmenIgnorePawn_execOnRemoved_Parms
{
	// class ABioAiController*                         Controller;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     PlayerController;                                 		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 PlayerPawn;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXGameEffect_HenchmenIgnorePawn.OnApplied
// [0x00020002] 
struct USFXGameEffect_HenchmenIgnorePawn_execOnApplied_Parms
{
	// class ABioAiController*                         Controller;                                       		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ABioPlayerController*                     PlayerController;                                 		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 PlayerPawn;                                       		// 0x0010 (0x0008) [0x0000000000000000]              
	// class ASFXAI_Core*                              AICore;                                           		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioHackingScript.ShouldUsePower
// [0x00420002] 
struct UBioHackingScript_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class FString                                      sOptionalInfo;                                    		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oPawn;                                            		// 0x0024 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioHackingScript.IsHacked
// [0x00020002] 
struct UBioHackingScript_execIsHacked_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x000C (0x0008) [0x0000000000000000]              
	// class USFXGameEffect*                           oEffect;                                          		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioHackingScript.RemoveWeakerHack
// [0x00020002] 
struct UBioHackingScript_execRemoveWeakerHack_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fNewDuration;                                     		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0010 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect*                           oEffect;                                          		// 0x0018 (0x0008) [0x0000000000000000]              
	// struct SFXName                                  EffectCategory;                                   		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioHackingScript.UnHackPreviousTargets
// [0x00020002] 
struct UBioHackingScript_execUnHackPreviousTargets_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0008 (0x0008) [0x0000000000000000]              
	// class AActor*                                   oActor;                                           		// 0x0010 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioHackingScript.OnImpact
// [0x00020802] ( FUNC_Event )
struct UBioHackingScript_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           Duration;                                         		// 0x001C (0x0004) [0x0000000000000000]              
	// class ABioPawn*                                 oPawn;                                            		// 0x0020 (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0028 (0x0008) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0030 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect_GiveShield*                Effect;                                           		// 0x0038 (0x0008) [0x0000000000000000]              
	// float                                           fShieldStrength;                                  		// 0x0040 (0x0004) [0x0000000000000000]              
	// class USFXGameEffect_AIHacking*                 HackingEffect;                                    		// 0x0044 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioHackingScript.StartPhase
// [0x00020802] ( FUNC_Event )
struct UBioHackingScript_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXGameEffect_IgnorePawn.OnRemoved
// [0x00020002] 
struct USFXGameEffect_IgnorePawn_execOnRemoved_Parms
{
	// class ASFXAI_Core*                              oController;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXGameEffect_IgnorePawn.OnApplied
// [0x00020002] 
struct USFXGameEffect_IgnorePawn_execOnApplied_Parms
{
	// class ASFXAI_Core*                              oController;                                      		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.PlayDeathVocalization
// [0x00020000] 
struct ASFXPawn_EngineerCombatDrone_execPlayDeathVocalization_Parms
{
	class ABioPawn*                                    Killer;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.Destroyed
// [0x00820902] ( FUNC_Simulated | FUNC_Event )
struct ASFXPawn_EngineerCombatDrone_eventDestroyed_Parms
{
	// class ASFXGame*                                 oGame;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ASFXObjectPool*                           oPool;                                            		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector                                  DirectionToSprayParticles;                        		// 0x0010 (0x000C) [0x0000000000000000]              
	// class AEmitter*                                 oEmitter;                                         		// 0x001C (0x0008) [0x0000000000000000]              
	// class USFXModule_Damage*                        DamageModule;                                     		// 0x0024 (0x0008) [0x0000000000000000]              
	// class ASFXAI_Core*                              oAI;                                              		// 0x002C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.Died
// [0x00020802] ( FUNC_Event )
struct ASFXPawn_EngineerCombatDrone_eventDied_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.SetDroneColor2
// [0x00020002] 
struct ASFXPawn_EngineerCombatDrone_execSetDroneColor2_Parms
{
	struct FVector                                     NewColor;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.SetDroneColor
// [0x00020002] 
struct ASFXPawn_EngineerCombatDrone_execSetDroneColor_Parms
{
	struct FVector                                     NewColor;                                         		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.PostBeginPlay
// [0x00020002] 
struct ASFXPawn_EngineerCombatDrone_execPostBeginPlay_Parms
{
};

// Function SFXGameContent_Powers.SFXPawn_EngineerCombatDrone.OnDroneKilled
// [0x00120000] 
struct ASFXPawn_EngineerCombatDrone_execOnDroneKilled_Parms
{
};

// Function SFXGameContent_Powers.SFXPower_CombatDrone.GetHealthMultiplier
// [0x00020002] 
struct USFXPower_CombatDrone_execGetHealthMultiplier_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioCombatDroneScript.ShouldUsePower
// [0x00420002] 
struct UBioCombatDroneScript_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class FString                                      sOptionalInfo;                                    		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioCombatDroneScript.OnDroneKilled
// [0x00020002] 
struct UBioCombatDroneScript_execOnDroneKilled_Parms
{
};

// Function SFXGameContent_Powers.BioCombatDroneScript.DespawnDrone
// [0x00020002] 
struct UBioCombatDroneScript_execDespawnDrone_Parms
{
};

// Function SFXGameContent_Powers.BioCombatDroneScript.OnOwnerDied
// [0x00020002] 
struct UBioCombatDroneScript_execOnOwnerDied_Parms
{
};

// Function SFXGameContent_Powers.BioCombatDroneScript.OnPowerRankIncreased
// [0x00020002] 
struct UBioCombatDroneScript_execOnPowerRankIncreased_Parms
{
};

// Function SFXGameContent_Powers.BioCombatDroneScript.SpawnDrone
// [0x00024002] 
struct UBioCombatDroneScript_execSpawnDrone_Parms
{
	class ABioPawn*                                    oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DroneClass;                                       		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     Location;                                         		// 0x0010 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FRotator                                    Rotation;                                         		// 0x001C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	float                                              HealthMultiplier;                                 		// 0x0028 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Lifetime;                                         		// 0x002C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bCustomColor;                                     		// 0x0030 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CustomColor;                                      		// 0x0034 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bCustomColor2;                                    		// 0x0040 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     CustomColor2;                                     		// 0x0044 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      DroneTarget;                                      		// 0x0050 (0x0008) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class ABioPawn*                                    ReturnValue;                                      		// 0x0058 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class USFXModule_Damage*                        DamageModule;                                     		// 0x0060 (0x0008) [0x0000000000000000]              
	// class ASFXPawn_EngineerCombatDrone*             SFXDrone;                                         		// 0x0068 (0x0008) [0x0000000000000000]              
	// float                                           fBonus;                                           		// 0x0070 (0x0004) [0x0000000000000000]              
	// class USFXPower*                                oPower;                                           		// 0x0074 (0x0008) [0x0000000000000000]              
	// class ASFXAI_Core*                              DroneAI;                                          		// 0x007C (0x0008) [0x0000000000000000]              
	// unsigned long                                   bPlayerSquad;                                     		// 0x0084 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCombatDroneScript.GetSpawnLocation
// [0x00820002] 
struct UBioCombatDroneScript_execGetSpawnLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  SpawnLocation;                                    		// 0x000C (0x000C) [0x0000000000000000]              
	// class TArray<struct FVector>                    SpawnLocations;                                   		// 0x0018 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// class ABioPawn*                                 PlayerPartyTarget;                                		// 0x0028 (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 CasterPawn;                                       		// 0x0030 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCombatDroneScript.GetBackLocation
// [0x00020002] 
struct UBioCombatDroneScript_execGetBackLocation_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioCombatDroneScript.GetFrontLocation
// [0x00824002] 
struct UBioCombatDroneScript_execGetFrontLocation_Parms
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              YawOffset;                                        		// 0x0008 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FRotator                                 Rotation;                                         		// 0x0018 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCombatDroneScript.IsSafeSpawnLocation
// [0x00C20002] 
struct UBioCombatDroneScript_execIsSafeSpawnLocation_Parms
{
	struct FVector                                     SpawnLocation;                                    		// 0x0000 (0x000C) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  FloorLocation;                                    		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCombatDroneScript.IsDroneAlive
// [0x00020002] 
struct UBioCombatDroneScript_execIsDroneAlive_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioCombatDroneScript.StartPhase
// [0x00820802] ( FUNC_Event )
struct UBioCombatDroneScript_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  vDroneLocation;                                   		// 0x0014 (0x000C) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCombatDroneScript.CanStartPower
// [0x00020802] ( FUNC_Event )
struct UBioCombatDroneScript_eventCanStartPower_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.ShouldUsePower
// [0x00420002] 
struct UBioWeaponPowerScript_execShouldUsePower_Parms
{
	class AActor*                                      Caster;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      Target;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class FString                                      sOptionalInfo;                                    		// 0x0010 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class APawn*                                    CasterAsPawn;                                     		// 0x0024 (0x0008) [0x0000000000000000]              
	// class ASFXWeapon*                               Weapon;                                           		// 0x002C (0x0008) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0034 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect*                           Effect;                                           		// 0x003C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.ApplyPowerEffects
// [0x00020000] 
struct UBioWeaponPowerScript_execApplyPowerEffects_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class ASFXWeapon*                                  oWeapon;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.SetWeaponPower
// [0x00020002] 
struct UBioWeaponPowerScript_execSetWeaponPower_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class ASFXWeapon*                                  oWeapon;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bOverrideCurrentPower;                            		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ASFXHeavyWeapon*                          oHeavyWeapon;                                     		// 0x0018 (0x0008) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0020 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect_WeaponVFXChange*           WeaponVFXEffect;                                  		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.ReloadAmmoPower
// [0x00020002] 
struct UBioWeaponPowerScript_execReloadAmmoPower_Parms
{
	class ABioPawn*                                    Target;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class ASFXWeapon*                                  Weapon;                                           		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.StartPhase
// [0x00020802] ( FUNC_Event )
struct UBioWeaponPowerScript_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 oCasterPawn;                                      		// 0x0014 (0x0008) [0x0000000000000000]              
	// class ABioPawn*                                 oSquadMember;                                     		// 0x001C (0x0008) [0x0000000000000000]              
	// class ABioBaseSquad*                            oSquad;                                           		// 0x0024 (0x0008) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x002C (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.ApplyToSquadMembers
// [0x00020002] 
struct UBioWeaponPowerScript_execApplyToSquadMembers_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.GetDuration
// [0x00020102] ( FUNC_Simulated )
struct UBioWeaponPowerScript_execGetDuration_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.GetElapsedTime
// [0x00020102] ( FUNC_Simulated )
struct UBioWeaponPowerScript_execGetElapsedTime_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioWeaponPowerScript.CanStartPower
// [0x00020802] ( FUNC_Event )
struct UBioWeaponPowerScript_eventCanStartPower_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ABioPawn*                                 CasterAsPawn;                                     		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.RemoveWeaponHologram
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execRemoveWeaponHologram_Parms
{
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.EnableWeaponHologram
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execEnableWeaponHologram_Parms
{
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.OnWeaponUnequip
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execOnWeaponUnequip_Parms
{
	class ASFXWeapon*                                  Weapon;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.OnWeaponEquip
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execOnWeaponEquip_Parms
{
	class ASFXWeapon*                                  Weapon;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.OnWeaponReload
// [0x00020000] 
struct USFXGameEffect_AmmoPower_execOnWeaponReload_Parms
{
	class ASFXWeapon*                                  Weapon;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.GetDamageVocProbabilityMod
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execGetDamageVocProbabilityMod_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.OnWeaponImpact
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execOnWeaponImpact_Parms
{
	class ASFXWeapon*                                  Weapon;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FImpactInfo                                 Impact;                                           		// 0x0008 (0x0060) [0x0000000000000080]              ( CPF_Parm )
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.OnRemoved
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execOnRemoved_Parms
{
	// class ABioPawn*                                 oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXGameEffect_AmmoPower.OnApplied
// [0x00020002] 
struct USFXGameEffect_AmmoPower_execOnApplied_Parms
{
};

// Function SFXGameContent_Powers.BioCarnageScript.ApplyPowerEffects
// [0x00020002] 
struct UBioCarnageScript_execApplyPowerEffects_Parms
{
	class ABioPawn*                                    oPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class ASFXWeapon*                                  oWeapon;                                          		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0010 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect_IncendiaryAmmo*            oEffect;                                          		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCarnageScript.OnImpact
// [0x00020802] ( FUNC_Event )
struct UBioCarnageScript_eventOnImpact_Parms
{
	class AActor*                                      oCaster;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fCasterStability;                                 		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oImpacted;                                        		// 0x000C (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                nPreviouslyImpacted;                              		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned long                                   bSuccess;                                         		// 0x001C (0x0004) [0x0000000000000000]              
	// class APawn*                                    oPawn;                                            		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.BioCarnageScript.StartPhase
// [0x00020802] ( FUNC_Event )
struct UBioCarnageScript_eventStartPhase_Parms
{
	unsigned char                                      ePhase;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class AActor*                                      oCaster;                                          		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioCarnageScript.ApplyToSquadMembers
// [0x00020002] 
struct UBioCarnageScript_execApplyToSquadMembers_Parms
{
	unsigned long                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function SFXGameContent_Powers.BioCarnageScript.InitializePowerScript
// [0x00020802] ( FUNC_Event )
struct UBioCarnageScript_eventInitializePowerScript_Parms
{
};

// Function SFXGameContent_Powers.SFXGameEffect_IncendiaryAmmo.CauseAnimatedReaction
// [0x00020002] 
struct USFXGameEffect_IncendiaryAmmo_execCauseAnimatedReaction_Parms
{
	class AActor*                                      oHitActor;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDelay;                                           		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class ABioPawn*                                 oPawn;                                            		// 0x000C (0x0008) [0x0000000000000000]              
	// class USFXModule_GameEffectManager*             Manager;                                          		// 0x0014 (0x0008) [0x0000000000000000]              
	// class USFXGameEffect_DelayedCustomAction*       oEffect;                                          		// 0x001C (0x0008) [0x0000000000000000]              
	// float                                           Random;                                           		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function SFXGameContent_Powers.SFXGameEffect_IncendiaryAmmo.AddGameEffects
// [0x00020002] 
struct USFXGameEffect_IncendiaryAmmo_execAddGameEffects_Parms
{
	class AActor*                                      oTarget;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDuration;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              fDamagePerSecond;                                 		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
